{
  "workExperience": [
    {
      "company": "Công ty TNHH Hisamitsu Pharmaceutical Việt Nam",
      "position": "Kế toán Tổng hợp & Chi tiết",
      "location": "TP. Hồ Chí Minh",
      "type": "Toàn thời gian",
      "startDate": "Tháng 3/2022",
      "endDate": "Hiện tại",
      "responsibilities": [
        "Kiểm tra và đối chiếu giao dịch, số dư, công nợ, chi phí và VAT để đảm bảo tính chính xác",
        "Lập báo cáo tài chính định kỳ và hướng dẫn các kế toán viên khác",
        "Đề xuất cải tiến quy trình kế toán và lưu trữ dữ liệu để nâng cao hiệu quả"
      ],
      "achievements": [
        "Triển khai thành công các cải tiến quy trình, nâng cao hiệu quả hoạt động kế toán",
        "Duy trì độ chính xác cao trong báo cáo tài chính và đối chiếu",
        "Cung cấp hướng dẫn và hỗ trợ hiệu quả cho các thành viên trong nhóm kế toán"
      ]
    },
    {
      "company": "Ngân hàng TMCP Kiên Long",
      "position": "Hành chính – Nhân sự",
      "location": "TP. Hồ Chí Minh",
      "type": "Toàn thời gian",
      "startDate": "Tháng 5/2019",
      "endDate": "Tháng 3/2022",
      "responsibilities": [
        "Xử lý hồ sơ nợ xấu và tham dự phiên tòa cùng ban lãnh đạo",
        "Quản lý chấm công, tính KPI, bảo hiểm xã hội, hợp đồng lao động và chính sách nhân sự",
        "Tuyển dụng, phỏng vấn và điều phối nhân sự trong đơn vị"
      ],
      "achievements": [
        "Quản lý thành công các hoạt động và hồ sơ nhân sự phức tạp",
        "Cải thiện quy trình nhân sự và triển khai chính sách",
        "Xử lý hiệu quả các vụ việc nợ xấu nhạy cảm và thủ tục pháp lý"
      ]
    },
    {
      "company": "Công ty Cổ phần Dịch vụ Đấu giá Trung Nam",
      "position": "Kế toán Trưởng",
      "location": "TP. Hồ Chí Minh",
      "type": "Toàn thời gian",
      "startDate": "Tháng 1/2017",
      "endDate": "Tháng 5/2019",
      "responsibilities": [
        "Giám sát tất cả hoạt động kế toán và tài chính, đảm bảo báo cáo chính xác và kịp thời",
        "Thiết lập và duy trì hệ thống kế toán và tài liệu theo quy định pháp luật",
        "Theo dõi việc sử dụng và quản lý tài sản để đảm bảo hiệu quả và ngăn ngừa thất thoát",
        "Điều phối lập kế hoạch ngân sách, kiểm soát chi phí và giám sát nhân viên kế toán"
      ],
      "achievements": [
        "Lãnh đạo và quản lý thành công toàn bộ phòng kế toán",
        "Triển khai hệ thống kế toán và kiểm soát chặt chẽ",
        "Đảm bảo tuân thủ mọi yêu cầu pháp lý và quy định"
      ]
    },
    {
      "company": "Công ty TNHH Tư vấn Thuế SAF",
      "position": "Kế toán Thuế",
      "location": "TP. Hồ Chí Minh",
      "type": "Toàn thời gian",
      "startDate": "Tháng 8/2014",
      "endDate": "Tháng 9/2016",
      "responsibilities": [
        "Lập báo cáo VAT, TNCN, TNDN và báo cáo tài chính năm theo quy định",
        "Theo dõi và quản lý hóa đơn, chứng từ kế toán; kê khai thuế chính xác và kịp thời",
        "Phối hợp với cơ quan thuế trong thanh tra và quản lý thủ tục hoàn thuế khi cần thiết"
      ],
      "achievements": [
        "Duy trì thành tích xuất sắc trong tuân thủ và báo cáo thuế",
        "Quản lý thành công các cuộc thanh tra thuế và thủ tục hoàn thuế",
        "Phát triển chuyên môn về các quy định và thủ tục thuế"
      ]
    },
    {
      "company": "Công ty TNHH Tôn Long Vân",
      "position": "Kế toán Kho",
      "location": "TP. Hồ Chí Minh",
      "type": "Toàn thời gian",
      "startDate": "Tháng 10/2013",
      "endDate": "Tháng 7/2014",
      "responsibilities": [
        "Kiểm tra và đối chiếu dữ liệu tồn kho để đảm bảo tính chính xác và kịp thời",
        "Phát hành hóa đơn, chứng từ và lập báo cáo tồn kho",
        "Theo dõi và quản lý mức tồn kho; đề xuất bổ sung hoặc phân bổ lại khi cần thiết"
      ],
      "achievements": [
        "Duy trì hồ sơ và tài liệu tồn kho chính xác",
        "Cải thiện quy trình kế toán kho",
        "Đóng góp vào quản lý và kiểm soát kho hiệu quả"
      ]
    }
  ]
} 