{
  "places": [
    {
      "id": "cho-sapa",
      "name": "Chợ Sa Pa",
      "location": "Lào Cai",
      "image": "assets/images/places/checkin-cho-sapa-lao-cai.jpg",
      "description": "Khu chợ truyền thống của người dân vùng cao",
      "detailedDescription": "Chợ Sa Pa là nơi giao thương sầm uất của đồng bào các dân tộc vùng cao Tây Bắc. Nơi đây không chỉ là điểm mua sắm mà còn là nơi giao lưu văn hóa độc đáo giữa các dân tộc H'Mông, Dao, Tày, Giáy.",
      "howToGet": "Chợ nằm ở trung tâm thị trấn Sa Pa, dễ dàng di chuyển bằng đi bộ từ các khách sạn trong khu vực.",
      "bestTimeToVisit": "Chợ phiên họp vào các ngày cuối tuần là sôi động nhất, đặc biệt vào sáng sớm.",
      "localFood": [
        {
          "name": "Thắng cố",
          "description": "Món ăn truyền thống của người H'Mông, được nấu từ thịt ngựa và các loại gia vị đặc biệt.",
          "image": "assets/images/foods/thang-co.jpg"
        },
        {
          "name": "Cá hồi nướng",
          "description": "Đặc sản cá hồi Sa Pa được nướng với gia vị đặc trưng vùng cao.",
          "image": "assets/images/foods/ca-hoi-nuong.jpg"
        }
      ]
    },
    {
      "id": "cho-tinh-sapa",
      "name": "Chợ Tình Sa Pa",
      "location": "Lào Cai",
      "image": "assets/images/places/checkin-cho-tinh-sapa-lao-cai.jpg",
      "description": "Phiên chợ độc đáo của người dân tộc vùng cao",
      "detailedDescription": "Chợ Tình Sa Pa là nét văn hóa đặc sắc của đồng bào dân tộc vùng cao, nơi các chàng trai cô gái trẻ gặp gỡ, giao lưu và tìm hiểu nhau. Chợ không chỉ là nơi buôn bán mà còn là điểm hẹn văn hóa độc đáo.",
      "howToGet": "Chợ nằm ở khu vực trung tâm Sa Pa, có thể đi bộ hoặc xe máy từ các điểm trong thị trấn.",
      "bestTimeToVisit": "Chợ thường họp vào tối thứ 7 hàng tuần, đặc biệt sôi động vào các dịp lễ tết."
    },
    {
      "id": "wat-arun",
      "name": "Chùa Wat Arun",
      "location": "Bangkok, Thái Lan",
      "image": "assets/images/places/checkin-chua-wat-arun-thai-lan.jpg",
      "description": "Ngôi chùa Bình Minh nổi tiếng của Thái Lan",
      "detailedDescription": "Wat Arun hay còn gọi là Chùa Bình Minh là một trong những ngôi chùa nổi tiếng nhất Bangkok, Thái Lan. Với kiến trúc độc đáo và vị trí bên bờ sông Chao Phraya, chùa là điểm đến không thể bỏ qua khi đến Bangkok.",
      "howToGet": "Từ trung tâm Bangkok, bạn có thể đi thuyền qua sông Chao Phraya để đến chùa.",
      "bestTimeToVisit": "Thời điểm đẹp nhất để thăm chùa là lúc hoàng hôn, khi ánh nắng chiếu vào các tháp chùa tạo nên khung cảnh tuyệt đẹp."
    },
    {
      "id": "san-bay-suvarnabhumi",
      "name": "Sân bay Suvarnabhumi",
      "location": "Bangkok, Thái Lan",
      "image": "assets/images/places/checkin-san-bay-suvarnabhumi-bangkok.jpg",
      "description": "Sân bay quốc tế chính của Thái Lan",
      "detailedDescription": "Sân bay Suvarnabhumi là một trong những sân bay hiện đại và lớn nhất Đông Nam Á. Với kiến trúc độc đáo và quy mô hoành tráng, sân bay không chỉ là cửa ngõ giao thương mà còn là điểm check-in nổi tiếng của du khách.",
      "howToGet": "Từ trung tâm Bangkok có thể đi taxi, xe buýt hoặc tàu điện Airport Rail Link.",
      "bestTimeToVisit": "Sân bay hoạt động 24/7, nhưng thời điểm ít đông đúc nhất là từ 23h đến 4h sáng."
    },
    {
      "id": "chua-van-thien",
      "name": "Chùa Vạn Thiện",
      "location": "Đồng Nai",
      "image": "assets/images/places/checkin-chua-van-thien-dong-nai.jpg",
      "description": "Ngôi chùa cổ kính với kiến trúc độc đáo",
      "detailedDescription": "Chùa Vạn Thiện là một trong những ngôi chùa cổ của tỉnh Đồng Nai, với kiến trúc độc đáo kết hợp giữa phong cách truyền thống và hiện đại. Chùa không chỉ là nơi sinh hoạt tâm linh mà còn là điểm đến văn hóa hấp dẫn.",
      "howToGet": "Từ trung tâm thành phố Biên Hòa, đi theo hướng dẫn đến chùa khoảng 10km.",
      "bestTimeToVisit": "Có thể thăm quan quanh năm, đặc biệt vào các dịp lễ Phật giáo."
    }
  ]
}
