{
  "places": [
    {
      "id": "wat-phnom-phnompenh",
      "name": "Chùa Wat Phnom",
      "location": "Phnom Penh, Campuchia",
      "image": "assets/images/places/checkin-chua-wat-phnom-phnompenh-campuchia.jpg",
      "description": "Ngôi chùa cổ biểu tượng của thủ đô Phnom Penh, điểm đến tâm linh quan trọng và là minh chứng cho sự giao thoa văn hóa Khmer-Phật giáo qua nhiều thế kỷ",
      "detailedDescription": "Chùa Wat Phnom là một trong những ngôi chùa cổ nhất và là biểu tượng của thủ đô Phnom Penh, được xây dựng vào năm 1373 bởi bà Daun Penh. Theo truyền thuyết, bà đã tìm thấy bốn pho tượng Phật trong một thân cây gỗ trôi dạt vào bờ sông Mekong và cho xây dựng ngôi chùa này trên đỉnh đồi nhân tạo cao 27m để thờ phụng. Quần thể chùa bao gồm ngôi chùa chính với kiến trúc Khmer truyền thống, các tượng Phật trang nghiêm, những bức bích họa kể về cuộc đời Đức Phật và các vị thần trong Hindu giáo. Xung quanh chùa là khu vườn được quy hoạch đẹp với nhiều cây cổ thụ, tượng đài và đền thờ nhỏ. Đặc biệt, chùa còn là nơi diễn ra nhiều lễ hội quan trọng trong năm, thu hút đông đảo Phật tử và du khách đến chiêm bái và tham quan.",
      "howToGet": "Từ Việt Nam có thể đi máy bay đến Phnom Penh (khoảng 1 giờ bay từ TP.HCM), sau đó di chuyển bằng taxi hoặc tuk tuk đến chùa. Chùa nằm ở giao lộ đường Norodom và Street 96.",
      "bestTimeToVisit": "Thời điểm thích hợp để thăm chùa là từ tháng 11 đến tháng 4 năm sau, khi thời tiết mát mẻ và ít mưa. Nên đến vào buổi sáng sớm hoặc chiều tà để tránh nắng nóng và đông đúc.",
      "attractions": {
        "religious": [
          {
            "name": "Chùa Wat Phnom",
            "description": "Ngôi chùa cổ trên đồi với kiến trúc Khmer truyền thống, nổi bật với mái chùa nhiều tầng và những họa tiết chạm khắc tinh xảo",
            "image": "assets/images/places/checkin-chua-wat-phnom-phnompenh-campuchia.jpg"
          },
          {
            "name": "Tượng Phật lớn",
            "description": "Tượng Phật trang nghiêm trong khuôn viên chùa, được trang trí với những họa tiết và màu sắc đặc trưng của Phật giáo Campuchia",
            "image": "assets/images/places/tuong-phat-wat-phnom.jpg"
          }
        ],
        "cultural": [
          {
            "name": "Bảo tàng lịch sử",
            "description": "Trưng bày các hiện vật về lịch sử chùa và Phật giáo Campuchia, với bộ sưu tập phong phú về nghệ thuật và văn hóa Khmer",
            "image": "assets/images/places/bao-tang-wat-phnom.jpg"
          },
          {
            "name": "Vườn tượng",
            "description": "Khu vườn với nhiều tượng điêu khắc kể về truyền thuyết và lịch sử của ngôi chùa",
            "image": "assets/images/places/vuon-tuong-wat-phnom.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Amok",
          "description": "Món cá đặc trưng của Campuchia, được nấu trong lá chuối với nước cốt dừa và các loại gia vị đặc biệt",
          "image": "assets/images/foods/amok.jpg"
        },
        {
          "name": "Num Banh Chok",
          "description": "Bún cà ri xanh kiểu Khmer, được làm từ bột gạo tươi và nước cốt cà ri với các loại rau thơm địa phương",
          "image": "assets/images/foods/num-banh-chok.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Chợ Trung tâm",
          "description": "Khu chợ truyền thống sầm uất với kiến trúc Art Deco độc đáo từ thời Pháp thuộc",
          "distance": "1km",
          "travelTime": "15 phút đi bộ"
        },
        {
          "name": "Cung điện Hoàng gia",
          "description": "Công trình kiến trúc hoàng gia tráng lệ với những mái ngói vàng và vườn cảnh đẹp",
          "distance": "2km",
          "travelTime": "20 phút đi bộ hoặc 5 phút đi tuk tuk"
        }
      ],
      "recommendedFood": [
        {
          "name": "Lok Lak",
          "description": "Món bò xào truyền thống Campuchia với sốt tiêu Kampot đặc biệt",
          "restaurant": "Romdeng Restaurant - Gần chùa Wat Phnom",
          "price": "5-8 USD/phần"
        },
        {
          "name": "Bánh mì Campuchia",
          "description": "Bánh mì kẹp thịt kiểu Khmer với patê và rau thơm đặc trưng",
          "restaurant": "Các quầy bánh mì xung quanh chùa",
          "price": "1-2 USD/ổ"
        }
      ]
    },
    {
      "id": "binh-dinh",
      "name": "Thành phố Quy Nhơn",
      "location": "Bình Định",
      "image": "assets/images/places/checkin-binh-dinh.jpg",
      "description": "Thành phố biển với nhiều di tích lịch sử, nơi hội tụ giữa văn hóa Chăm cổ đại và nét đẹp hiện đại, được mệnh danh là một trong những thành phố đáng sống nhất Việt Nam",
      "detailedDescription": "Quy Nhơn là thành phố biển xinh đẹp của tỉnh Bình Định, nổi tiếng với những bãi biển hoang sơ, tháp Chăm cổ kính và ẩm thực đặc sắc. Thành phố không chỉ là quê hương của nhiều danh nhân văn hóa như Hàn Mặc Tử, Xuân Diệu, mà còn là vùng đất có truyền thống võ thuật lâu đời với các môn phái nổi tiếng. Quy Nhơn sở hữu đường bờ biển dài với nhiều bãi tắm đẹp như Quy Nhơn, Ghềnh Ráng, Eo Gió, cùng hệ thống tháp Chăm Pa cổ kính như tháp Đôi, tháp Bánh Ít. Thành phố cũng nổi tiếng với ẩm thực phong phú, đặc biệt là các món hải sản tươi sống và đặc sản như bánh xèo tôm nhảy, bún chả cá. Trong những năm gần đây, Quy Nhơn đang phát triển mạnh mẽ về du lịch nhưng vẫn giữ được nét thanh bình và giá trị văn hóa truyền thống.",
      "howToGet": "Có thể đến Quy Nhơn bằng máy bay (sân bay Phù Cát, cách trung tâm 30km), tàu hỏa (ga Quy Nhơn) hoặc xe khách từ các tỉnh thành lớn. Từ sân bay có xe buýt và taxi đưa về trung tâm thành phố.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là từ tháng 3 đến tháng 9, khi thời tiết ít mưa và biển lặng sóng. Nên tránh mùa mưa bão từ tháng 10 đến tháng 12. Buổi sáng sớm và chiều tà là thời điểm lý tưởng để tham quan các điểm du lịch và tắm biển.",
      "attractions": {
        "historical": [
          {
            "name": "Tháp Chăm",
            "description": "Quần thể tháp Chăm cổ với kiến trúc độc đáo, minh chứng cho nền văn minh Chăm Pa rực rỡ một thời",
            "image": "assets/images/places/checkin-binh-dinh.jpg"
          },
          {
            "name": "Nhà thờ Nhạn",
            "description": "Công trình kiến trúc độc đáo thời Pháp, nổi bật với tháp chuông hình chim nhạn bay lên",
            "image": "assets/images/places/nha-tho-nhan.jpg"
          }
        ],
        "natural": [
          {
            "name": "Bãi biển Quy Nhơn",
            "description": "Bãi biển đẹp với cát trắng mịn, nước trong xanh và hàng dương rợp bóng",
            "image": "assets/images/places/bai-bien-quy-nhon.jpg"
          },
          {
            "name": "Kỳ Co",
            "description": "Bãi biển hoang sơ với nước biển xanh ngọc, được ví như 'Maldives của Việt Nam'",
            "image": "assets/images/places/ky-co.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Bánh xèo tôm nhảy",
          "description": "Món bánh xèo đặc trưng của Quy Nhơn, được làm với tôm nhảy tươi ngon và nước chấm chua ngọt đặc biệt",
          "image": "assets/images/foods/banh-xeo-tom-nhay.jpg"
        },
        {
          "name": "Bún chả cá",
          "description": "Bún với chả cá tươi ngon được làm từ cá thu tươi, nước dùng ngọt thanh đặc trưng",
          "image": "assets/images/foods/bun-cha-ca.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Ghềnh Ráng",
          "description": "Thắng cảnh đẹp với bãi đá và biển, nơi có bãi tắm Hoàng Hậu và mộ thi sĩ Hàn Mặc Tử",
          "distance": "5km",
          "travelTime": "15 phút đi xe máy"
        },
        {
          "name": "Eo Gió",
          "description": "Vách đá nhìn ra biển tuyệt đẹp, điểm ngắm bình minh và hoàng hôn nổi tiếng",
          "distance": "20km",
          "travelTime": "40 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Bánh hỏi lòng heo",
          "description": "Món ăn truyền thống Bình Định với bánh hỏi mềm mịn và lòng heo được chế biến công phu",
          "restaurant": "Quán Bà Tám - Đường Nguyễn Huệ",
          "price": "30000-50000 VND/phần"
        },
        {
          "name": "Gỏi cá mai",
          "description": "Đặc sản gỏi cá tươi với cá mai được chế biến theo công thức đặc biệt của người Quy Nhơn",
          "restaurant": "Quán Bé Mặn - Khu ẩm thực biển",
          "price": "60000-100000 VND/phần"
        }
      ]
    },
    {
      "id": "quy-nhon-binh-dinh",
      "name": "Bãi biển Quy Nhơn",
      "location": "Bình Định",
      "image": "assets/images/places/checkin-quy-nhon-binh-dinh.jpg",
      "description": "Bãi biển đẹp với cát trắng mịn và nước trong xanh, một trong những bãi biển đô thị đẹp nhất Việt Nam với đường bờ biển cong hình lưỡi liềm ôm trọn thành phố",
      "detailedDescription": "Bãi biển Quy Nhơn nổi tiếng với cát trắng mịn, nước biển trong xanh và không gian yên bình. Trải dài hơn 5km dọc theo đường An Dương Vương và Xuân Diệu, bãi biển có hình cong như lưỡi liềm ôm trọn thành phố. Đặc biệt, bãi biển có độ dốc thoai thoải, sóng nhẹ, rất thích hợp cho việc tắm biển và các hoạt động thể thao dưới nước. Dọc bãi biển là con đường ven biển rợp bóng dừa, nơi lý tưởng để đi dạo, ngắm bình minh và hoàng hôn. Vào buổi sáng sớm, bãi biển nhộn nhịp với các hoạt động thể dục thể thao của người dân địa phương, còn buổi chiều tối là thời điểm lý tưởng để thưởng thức hải sản tươi sống tại các nhà hàng ven biển.",
      "howToGet": "Bãi biển nằm ngay trung tâm thành phố Quy Nhơn, dễ dàng di chuyển bằng mọi phương tiện. Từ sân bay Phù Cát về trung tâm khoảng 30km, từ ga Quy Nhơn chỉ cách 2km.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là từ tháng 3 đến tháng 8, khi thời tiết nắng đẹp và biển lặng. Nên đến sớm buổi sáng (5h-7h) để ngắm bình minh và tránh nắng nóng, hoặc chiều tà (16h-18h) để thưởng thức hoàng hôn.",
      "attractions": {
        "natural": [
          {
            "name": "Bãi biển trung tâm",
            "description": "Bãi biển đẹp với cát trắng mịn, nước trong xanh, được bao quanh bởi hàng dừa xanh mát và đường đi bộ ven biển hiện đại",
            "image": "assets/images/places/checkin-quy-nhon-binh-dinh.jpg"
          },
          {
            "name": "Kỳ Co",
            "description": "Bãi biển hoang sơ với nước trong như ngọc, được ví như 'Maldives của Việt Nam', nổi tiếng với những mỏm đá độc đáo và hang động tự nhiên",
            "image": "assets/images/places/ky-co.jpg"
          }
        ],
        "entertainment": [
          {
            "name": "Công viên biển",
            "description": "Khu vui chơi giải trí ven biển với nhiều hoạt động thú vị như thể thao biển, khu vui chơi trẻ em và các show diễn nghệ thuật",
            "image": "assets/images/places/cong-vien-bien.jpg"
          },
          {
            "name": "Phố đi bộ ven biển",
            "description": "Tuyến phố đi bộ sầm uất với nhiều hoạt động văn hóa, nghệ thuật và ẩm thực đường phố",
            "image": "assets/images/places/pho-di-bo-quy-nhon.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Hải sản tươi sống",
          "description": "Các loại hải sản tươi ngon từ biển như tôm hùm, cua, ghẹ, mực, sò điệp được chế biến theo phong cách đặc trưng Quy Nhơn",
          "image": "assets/images/foods/hai-san-quy-nhon.jpg"
        },
        {
          "name": "Bánh căn",
          "description": "Món bánh truyền thống Quy Nhơn được làm từ bột gạo, trứng, ăn kèm với nước mắm pha đặc biệt và rau sống",
          "image": "assets/images/foods/banh-can.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Ghềnh Ráng",
          "description": "Thắng cảnh đẹp với bãi đá và biển, nơi có bãi tắm Hoàng Hậu và khu tưởng niệm thi sĩ Hàn Mặc Tử",
          "distance": "3km",
          "travelTime": "10 phút đi xe máy"
        },
        {
          "name": "Tháp Đôi",
          "description": "Di tích tháp Chăm cổ với kiến trúc độc đáo, là biểu tượng văn hóa của Quy Nhơn",
          "distance": "2km",
          "travelTime": "7 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cá nướng",
          "description": "Cá biển tươi nướng than hồng với gia vị đặc trưng của người Quy Nhơn, ăn kèm với rau sống và bánh tráng",
          "restaurant": "Quán Năm Bảy - Khu ẩm thực ven biển",
          "price": "150000-200000 VND/kg"
        },
        {
          "name": "Bánh căn sốt cá",
          "description": "Bánh căn nóng hổi với sốt cá đặc biệt, được làm từ cá tươi và gia vị địa phương",
          "restaurant": "Quán Út Lý - Đường Xuân Diệu",
          "price": "30000-40000 VND/phần"
        }
      ]
    },
    {
      "id": "quang-ngai",
      "name": "Thành phố Quảng Ngãi",
      "location": "Quảng Ngãi",
      "image": "assets/images/places/checkin-quang-ngai.jpg",
      "description": "Vùng đất với nhiều di tích lịch sử và danh thắng, nơi ghi dấu những trang sử hào hùng của dân tộc và sở hữu những cảnh quan thiên nhiên tuyệt đẹp cùng nền ẩm thực đặc sắc",
      "detailedDescription": "Quảng Ngãi là vùng đất giàu truyền thống lịch sử và văn hóa, nổi tiếng với di tích Sơn Mỹ - chứng tích của một thời kỳ lịch sử đau thương, đảo Lý Sơn - 'Vương quốc tỏi' với những cảnh quan tuyệt đẹp và nhiều di tích văn hóa Sa Huỳnh cổ. Thành phố không chỉ thu hút du khách bởi những di tích lịch sử như thành cổ Châu Sa, mộ Hoàng đế Quang Trung, mà còn bởi vẻ đẹp của những bãi biển hoang sơ như Sa Huỳnh, Mỹ Khê. Đặc biệt, Quảng Ngãi còn nổi tiếng với nền ẩm thực phong phú, đặc trưng với các món ăn như mì Quảng, bánh bèo, ram bắp và nhiều đặc sản từ biển đảo Lý Sơn.",
      "howToGet": "Có thể đến Quảng Ngãi bằng tàu hỏa (ga Quảng Ngãi nằm trên tuyến đường sắt Bắc-Nam) hoặc xe khách theo quốc lộ 1A. Từ sân bay Chu Lai cách thành phố khoảng 40km.",
      "bestTimeToVisit": "Thời điểm thích hợp để thăm Quảng Ngãi là từ tháng 1 đến tháng 8, khi thời tiết khô ráo và ít mưa. Tránh mùa mưa bão từ tháng 9 đến tháng 12. Đặc biệt nên đến vào mùa hè để tham gia lễ hội đảo Lý Sơn.",
      "attractions": {
        "historical": [
          {
            "name": "Di tích Sơn Mỹ",
            "description": "Di tích lịch sử quan trọng của cuộc kháng chiến, nơi ghi dấu một trang sử đau thương và bài học về hòa bình cho nhân loại",
            "image": "assets/images/places/checkin-quang-ngai.jpg"
          },
          {
            "name": "Thành cổ Châu Sa",
            "description": "Di tích lịch sử thời Champa với kiến trúc độc đáo, là minh chứng cho nền văn minh Chăm cổ xưa",
            "image": "assets/images/places/thanh-co-chau-sa.jpg"
          }
        ],
        "natural": [
          {
            "name": "Đảo Lý Sơn",
            "description": "Hòn đảo với cảnh quan thiên nhiên tuyệt đẹp, nổi tiếng với các cánh đồng tỏi, những vách núi đá dựng đứng và biển xanh trong vắt",
            "image": "assets/images/places/dao-ly-son.jpg"
          },
          {
            "name": "Bãi biển Mỹ Khê",
            "description": "Bãi biển hoang sơ với cát trắng mịn, nước trong xanh và hàng dừa rợp bóng",
            "image": "assets/images/places/bai-bien-my-khe.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Mì Quảng",
          "description": "Món mì đặc trưng của miền Trung với sợi mì vàng, thịt gà hoặc tôm, đậu phộng rang và rau sống, được chế biến theo công thức truyền thống",
          "image": "assets/images/foods/mi-quang.jpg"
        },
        {
          "name": "Bánh bèo",
          "description": "Món bánh truyền thống Quảng Ngãi với bột gạo tinh khiết, nhân tôm thịt băm nhuyễn và nước mắm chua ngọt đặc biệt",
          "image": "assets/images/foods/banh-beo.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Đảo Lý Sơn",
          "description": "Đảo với nhiều danh thắng và đặc sản tỏi, nổi tiếng với Cổng Tò Vò, Hang Câu và các di tích lịch sử",
          "distance": "30km",
          "travelTime": "1 giờ đi tàu cao tốc"
        },
        {
          "name": "Núi Ấn - Sông Trà",
          "description": "Khu bảo tồn thiên nhiên với hệ sinh thái đa dạng, thác nước và cảnh quan núi rừng hùng vĩ",
          "distance": "25km",
          "travelTime": "45 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Mì Quảng gà",
          "description": "Mì Quảng với thịt gà ta thơm ngon, được chế biến theo công thức gia truyền",
          "restaurant": "Quán Mì Quảng Bà Mua - Đường Phan Đình Phùng",
          "price": "25000-35000 VND/tô"
        },
        {
          "name": "Bánh bèo chén",
          "description": "Bánh bèo với nhân tôm thịt thơm ngon, nước mắm pha chế đặc biệt",
          "restaurant": "Quán Bánh bèo Bà Bảy - Chợ Quảng Ngãi",
          "price": "20000-30000 VND/10 chén"
        }
      ]
    },
    {
      "id": "quang-nam",
      "name": "Phố cổ Hội An",
      "location": "Quảng Nam",
      "image": "assets/images/places/checkin-quang-nam.jpg",
      "description": "Di sản văn hóa thế giới với kiến trúc cổ độc đáo, nơi giao thoa văn hóa Đông - Tây qua nhiều thế kỷ, được mệnh danh là một trong những thành phố cổ đẹp nhất Đông Nam Á",
      "detailedDescription": "Hội An là đô thị cổ nằm ở tỉnh Quảng Nam, được UNESCO công nhận là Di sản Văn hóa Thế giới năm 1999. Thành phố này từng là thương cảng quốc tế sầm uất từ thế kỷ 16-17, nơi giao thương của thương nhân Nhật Bản, Trung Quốc, Bồ Đào Nha và Hà Lan. Ngày nay, Hội An vẫn giữ nguyên vẹn hơn 1.000 di tích kiến trúc cổ bao gồm nhà cổ, hội quán, đình, chùa, miếu, giếng cổ, và đặc biệt là chùa Cầu - biểu tượng của phố cổ. Mỗi tối, phố cổ lung linh trong ánh đèn lồng đủ màu sắc, tạo nên khung cảnh lãng mạn và cổ kính. Hội An không chỉ nổi tiếng với kiến trúc mà còn với nghề may đo truyền thống, ẩm thực đặc sắc như cao lầu, mì Quảng, và các hoạt động văn hóa nghệ thuật truyền thống.",
      "howToGet": "Từ sân bay Đà Nẵng đi taxi hoặc xe khách khoảng 30km đến Hội An. Có thể đi xe buýt từ bến xe Đà Nẵng hoặc thuê xe máy để khám phá thành phố. Từ ga Đà Nẵng cũng có nhiều xe khách chạy thẳng đến Hội An.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là từ tháng 2 đến tháng 4, khi thời tiết mát mẻ và ít mưa. Nên đến vào buổi chiều tối để tận hưởng không khí lãng mạn của phố cổ với đèn lồng và các hoạt động văn hóa. Đặc biệt vào đêm rằm hàng tháng, phố cổ tổ chức nhiều hoạt động truyền thống đặc sắc.",
      "attractions": {
        "cultural": [
          {
            "name": "Phố cổ Hội An",
            "description": "Khu phố cổ với kiến trúc truyền thống và đèn lồng rực rỡ, nơi bảo tồn nguyên vẹn những giá trị văn hóa, kiến trúc của một thương cảng cổ",
            "image": "assets/images/places/checkin-quang-nam.jpg"
          },
          {
            "name": "Chùa Cầu",
            "description": "Cây cầu cổ biểu tượng của Hội An, được xây dựng từ thế kỷ 17 bởi thương nhân Nhật Bản, kết hợp kiến trúc Nhật - Việt độc đáo",
            "image": "assets/images/places/chua-cau.jpg"
          }
        ],
        "historical": [
          {
            "name": "Nhà cổ Phùng Hưng",
            "description": "Ngôi nhà cổ với kiến trúc truyền thống, được bảo tồn nguyên vẹn với các chi tiết chạm khắc tinh xảo và nội thất cổ quý giá",
            "image": "assets/images/places/nha-co-phung-hung.jpg"
          },
          {
            "name": "Hội quán Phúc Kiến",
            "description": "Công trình kiến trúc đặc sắc của người Hoa với nghệ thuật chạm khắc và trang trí độc đáo",
            "image": "assets/images/places/hoi-quan-phuc-kien.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Cao lầu",
          "description": "Món mì đặc trưng của Hội An với sợi mì vàng được làm từ nước giếng cổ Bá Lễ, thịt xá xíu, rau sống và nước dùng đặc biệt",
          "image": "assets/images/foods/cao-lau.jpg"
        },
        {
          "name": "Bánh mì Phượng",
          "description": "Bánh mì nổi tiếng nhất Hội An, được Anthony Bourdain ca ngợi, với nhân đặc biệt và nước sốt bí truyền",
          "image": "assets/images/foods/banh-mi-phuong.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Làng gốm Thanh Hà",
          "description": "Làng nghề gốm truyền thống với lịch sử hơn 500 năm, nơi du khách có thể trải nghiệm làm gốm",
          "distance": "3km",
          "travelTime": "10 phút đi xe máy"
        },
        {
          "name": "Bãi biển An Bàng",
          "description": "Bãi biển đẹp gần phố cổ với cát trắng mịn, được CNN bình chọn là một trong những bãi biển đẹp nhất châu Á",
          "distance": "5km",
          "travelTime": "15 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cao lầu",
          "description": "Mì đặc sản chỉ có ở Hội An với sợi mì vàng đặc biệt và nước dùng độc đáo",
          "restaurant": "Quán Cao Lầu Thanh - Chợ Hội An",
          "price": "30000-45000 VND/tô"
        },
        {
          "name": "Bánh mì Phượng",
          "description": "Bánh mì nổi tiếng thế giới với công thức đặc biệt và nhiều loại nhân khác nhau",
          "restaurant": "Bánh Mì Phượng - 2B Phan Châu Trinh",
          "price": "20000-35000 VND/ổ"
        }
      ]
    },
    {
      "id": "hai-van-quan",
      "name": "Hải Vân Quan",
      "location": "Đà Nẵng - Thừa Thiên Huế",
      "image": "assets/images/places/checkin-hai-van-quan.jpg",
      "description": "Cửa ải lịch sử trên đèo Hải Vân, nơi được mệnh danh là 'thiên hạ đệ nhất hùng quan', điểm giao thoa giữa hai miền khí hậu và là ranh giới tự nhiên tuyệt đẹp giữa Đà Nẵng và Thừa Thiên Huế",
      "detailedDescription": "Hải Vân Quan là cửa ải cổ nằm trên đỉnh đèo Hải Vân ở độ cao 496m so với mực nước biển, là ranh giới tự nhiên giữa Đà Nẵng và Thừa Thiên Huế. Được xây dựng từ thế kỷ thứ XI và được tu sửa nhiều lần qua các triều đại, cổng thành này mang đậm dấu ấn kiến trúc thời Nguyễn với ba chữ 'Hải Vân Quan' được khắc trên cổng. Từ đây có thể ngắm toàn cảnh vịnh Đà Nẵng, bán đảo Sơn Trà một bên và vịnh Lăng Cô thơ mộng bên kia. Đèo Hải Vân được mệnh danh là 'đệ nhất thiên hạ hùng quan' bởi vẻ đẹp hùng vĩ và vị trí chiến lược quan trọng. Nơi đây còn lưu giữ nhiều di tích quân sự từ thời Pháp và Mỹ, tạo nên một điểm du lịch độc đáo kết hợp giữa lịch sử, văn hóa và cảnh quan thiên nhiên.",
      "howToGet": "Từ Đà Nẵng đi xe máy hoặc ô tô khoảng 30km theo quốc lộ 1A về phía Bắc. Có thể thuê xe máy hoặc tham gia tour du lịch từ Đà Nẵng hoặc Huế. Nên chọn phương tiện phù hợp vì đèo có nhiều khúc cua gắt.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là từ tháng 3 đến tháng 8, khi thời tiết nắng đẹp và ít sương mù. Nên đến vào sáng sớm để ngắm bình minh và tránh sương mù buổi chiều. Tránh đi vào mùa mưa (tháng 9-12) vì đường trơn trượt và hay có sương mù dày đặc.",
      "attractions": {
        "historical": [
          {
            "name": "Cửa ải Hải Vân",
            "description": "Di tích lịch sử với kiến trúc cổ và cảnh quan tuyệt đẹp, nơi còn lưu dấu tích của nhiều triều đại và là chứng nhân lịch sử quan trọng",
            "image": "assets/images/places/checkin-hai-van-quan.jpg"
          },
          {
            "name": "Pháo đài cổ",
            "description": "Công trình quân sự thời Pháp thuộc với hệ thống pháo đài, hầm trú ẩn và các công sự quân sự còn nguyên vẹn",
            "image": "assets/images/places/phao-dai-hai-van.jpg"
          }
        ],
        "natural": [
          {
            "name": "Đỉnh đèo Hải Vân",
            "description": "Điểm ngắm cảnh tuyệt đẹp với tầm nhìn bao quát vịnh Đà Nẵng và vịnh Lăng Cô, nơi giao thoa của hai miền khí hậu",
            "image": "assets/images/places/dinh-deo-hai-van.jpg"
          },
          {
            "name": "Rừng nguyên sinh",
            "description": "Khu rừng nguyên sinh với hệ sinh thái đa dạng và nhiều loài thực vật quý hiếm",
            "image": "assets/images/places/rung-hai-van.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Mì Quảng",
          "description": "Món mì đặc trưng miền Trung với sợi mì vàng, thịt gà, tôm, trứng và nước dùng đặc biệt, ăn kèm bánh tráng và rau sống",
          "image": "assets/images/foods/mi-quang.jpg"
        },
        {
          "name": "Bánh tráng cuốn thịt heo",
          "description": "Món ăn đặc sản Đà Nẵng với thịt heo nướng, rau sống và bánh tráng, chấm với nước mắm pha đặc biệt",
          "image": "assets/images/foods/banh-trang-cuon-thit-heo.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Bãi biển Lăng Cô",
          "description": "Bãi biển đẹp phía Bắc đèo với cát trắng mịn, nước trong xanh và cảnh quan hoang sơ",
          "distance": "15km",
          "travelTime": "25 phút đi xe máy"
        },
        {
          "name": "Bán đảo Sơn Trà",
          "description": "Khu bảo tồn thiên nhiên với rừng nguyên sinh, bãi biển đẹp và chùa Linh Ứng nổi tiếng",
          "distance": "20km",
          "travelTime": "40 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Mì Quảng gà",
          "description": "Mì Quảng với thịt gà ta và nước dùng đặc trưng của vùng Quảng Nam",
          "restaurant": "Quán Mì Quảng Bà Vị - Chân đèo Hải Vân",
          "price": "25000-35000 VND/tô"
        },
        {
          "name": "Bánh mì que",
          "description": "Bánh mì que nướng đặc sản với patê và ớt cay nồng, món ăn vặt được yêu thích",
          "restaurant": "Xe bánh mì que dì Hoa - Khu vực Hải Vân Quan",
          "price": "5000-10000 VND/cái"
        }
      ]
    },
    {
      "id": "thanh-co-quang-tri",
      "name": "Thành cổ Quảng Trị",
      "location": "Quảng Trị",
      "image": "assets/images/places/checkin-thanh-co-quang-tri.jpg",
      "description": "Di tích lịch sử quốc gia đặc biệt, chứng tích hào hùng của 81 ngày đêm chiến đấu anh dũng, biểu tượng của tinh thần bất khuất và ý chí kiên cường của quân và dân ta trong cuộc kháng chiến chống Mỹ",
      "detailedDescription": "Thành cổ Quảng Trị là một công trình kiến trúc quân sự được xây dựng từ năm 1824 dưới triều Minh Mạng. Tuy nhiên, di tích này nổi tiếng nhất với 81 ngày đêm chiến đấu anh dũng năm 1972, khi quân và dân ta đã kiên cường bảo vệ thành cổ trước cuộc tấn công ác liệt của địch. Thành có hình vuông với chu vi 2.160m, bốn góc thành có pháo đài, bốn cửa thành theo bốn hướng Đông - Tây - Nam - Bắc. Ngày nay, di tích vẫn còn lưu giữ nhiều dấu tích của cuộc chiến như vết đạn trên tường thành, hầm hào chiến đấu, và các hiện vật quý giá. Bảo tàng trong khuôn viên thành cổ trưng bày nhiều tư liệu, hiện vật về cuộc chiến đấu lịch sử, giúp người tham quan hiểu rõ hơn về một giai đoạn lịch sử hào hùng của dân tộc.",
      "howToGet": "Từ trung tâm thành phố Đông Hà đi khoảng 12km theo quốc lộ 1A về phía Nam. Có thể đi xe máy, ô tô hoặc taxi. Từ ga Đông Hà cũng có xe buýt và xe ôm đến thành cổ.",
      "bestTimeToVisit": "Có thể tham quan quanh năm, nhưng thời điểm đẹp nhất là từ tháng 3 đến tháng 8 khi thời tiết khô ráo. Nên tránh mùa mưa (tháng 9-12) vì có thể gây khó khăn cho việc tham quan. Đặc biệt nên đến vào dịp kỷ niệm 81 ngày đêm (từ 28/6 đến 16/9) để tham dự các hoạt động tưởng niệm.",
      "attractions": {
        "historical": [
          {
            "name": "Tường thành cổ",
            "description": "Công trình kiến trúc quân sự thời Nguyễn với bốn cửa thành và hệ thống phòng thủ kiên cố, mang nhiều dấu tích lịch sử của cuộc chiến 81 ngày đêm",
            "image": "assets/images/places/tuong-thanh-co.jpg"
          },
          {
            "name": "Bảo tàng Thành cổ",
            "description": "Nơi trưng bày các hiện vật, tư liệu quý về cuộc chiến đấu bảo vệ thành cổ và lịch sử phát triển của vùng đất Quảng Trị",
            "image": "assets/images/places/bao-tang-thanh-co.jpg"
          }
        ],
        "memorial": [
          {
            "name": "Đài tưởng niệm",
            "description": "Công trình tưởng niệm các anh hùng liệt sĩ đã hy sinh trong cuộc chiến bảo vệ thành cổ, được xây dựng trang nghiêm và đầy ý nghĩa",
            "image": "assets/images/places/dai-tuong-niem-thanh-co.jpg"
          },
          {
            "name": "Hệ thống hầm hào",
            "description": "Hệ thống phòng thủ còn sót lại từ cuộc chiến, giúp du khách hiểu rõ hơn về điều kiện chiến đấu của quân và dân ta",
            "image": "assets/images/places/ham-hao-thanh-co.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Bánh ít lá gai",
          "description": "Món bánh truyền thống của Quảng Trị, làm từ bột gạo nếp và lá gai, nhân đậu xanh hoặc dừa, có hương vị đặc trưng và màu xanh tự nhiên",
          "image": "assets/images/foods/banh-it-la-gai.jpg"
        },
        {
          "name": "Cháo canh Quảng Trị",
          "description": "Món ăn đặc sản với sợi bột gạo, thịt nạc, chả cá, và nước dùng đậm đà, thường ăn kèm với rau sống và ớt tươi",
          "image": "assets/images/foods/chao-canh.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Sông Thạch Hãn",
          "description": "Dòng sông lịch sử gắn liền với cuộc chiến bảo vệ thành cổ, nơi diễn ra nhiều trận đánh ác liệt",
          "distance": "0.5km",
          "travelTime": "5 phút đi bộ"
        },
        {
          "name": "Nghĩa trang liệt sĩ Trường Sơn",
          "description": "Nơi yên nghỉ của hàng vạn anh hùng liệt sĩ, một trong những nghĩa trang liệt sĩ lớn nhất cả nước",
          "distance": "15km",
          "travelTime": "25 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cháo canh Quảng Trị",
          "description": "Món ăn truyền thống với sợi bột gạo tươi và nước dùng đặc biệt",
          "restaurant": "Quán cháo canh Bà Đào - Đường Trần Hưng Đạo",
          "price": "25000-35000 VND/tô"
        },
        {
          "name": "Bánh ít lá gai",
          "description": "Bánh truyền thống với nhân đậu xanh thơm ngon",
          "restaurant": "Cơ sở bánh ít Bà Liên - Phường 1",
          "price": "5000-10000 VND/cái"
        }
      ]
    },
    {
      "id": "quang-binh",
      "name": "Động Phong Nha",
      "location": "Quảng Bình",
      "image": "assets/images/places/checkin-quang-binh.jpg",
      "description": "Di sản thiên nhiên thế giới với hệ thống hang động kỳ vĩ",
      "detailedDescription": "Vườn quốc gia Phong Nha - Kẻ Bàng là di sản thiên nhiên thế giới với hệ thống hang động đá vôi lớn nhất thế giới. Nơi đây có cảnh quan thiên nhiên tuyệt đẹp và đa dạng sinh học phong phú.",
      "howToGet": "Từ Đồng Hới đi xe khách khoảng 50km đến Phong Nha. Có thể bay đến sân bay Đồng Hới từ Hà Nội hoặc TP.HCM.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là từ tháng 3 đến tháng 8, khi thời tiết thuận lợi cho việc khám phá hang động.",
      "attractions": {
        "natural": [
          {
            "name": "Động Phong Nha",
            "description": "Hang động với hệ thống sông ngầm và thạch nhũ tuyệt đẹp",
            "image": "assets/images/places/checkin-quang-binh.jpg"
          },
          {
            "name": "Động Thiên Đường",
            "description": "Hang động đẹp nhất thế giới",
            "image": "assets/images/places/dong-thien-duong.jpg"
          }
        ],
        "adventure": [
          {
            "name": "Sông Chày",
            "description": "Điểm chèo thuyền kayak và zipline",
            "image": "assets/images/places/song-chay.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Cháo canh",
          "description": "Món ăn đặc trưng Quảng Bình",
          "image": "assets/images/foods/chao-canh.jpg"
        },
        {
          "name": "Bánh lọc",
          "description": "Bánh gói lá chuối",
          "image": "assets/images/foods/banh-loc.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Bãi biển Nhật Lệ",
          "description": "Bãi biển đẹp của Đồng Hới",
          "distance": "45km",
          "image": "assets/images/places/bai-bien-nhat-le.jpg"
        },
        {
          "name": "Suối nước Moọc",
          "description": "Khu du lịch sinh thái",
          "distance": "10km",
          "image": "assets/images/places/suoi-nuoc-mooc.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cháo canh Quảng Bình",
          "description": "Món ăn truyền thống",
          "price": "25000-35000 VND/tô",
          "where": "Các quán ăn địa phương"
        },
        {
          "name": "Bánh lọc gói lá chuối",
          "description": "Bánh đặc sản",
          "price": "5000-10000 VND/cái",
          "where": "Chợ và các quán ăn vặt"
        }
      ]
    },
    {
      "id": "cho-rong-ninh-binh",
      "name": "Chợ Rồng Ninh Bình",
      "location": "Ninh Bình",
      "image": "assets/images/places/checkin-cho-rong-ninh-binh.jpg",
      "description": "Khu chợ truyền thống sầm uất",
      "detailedDescription": "Chợ Rồng là khu chợ truyền thống lớn nhất Ninh Bình, nơi tập trung buôn bán nhiều mặt hàng đặc sản địa phương. Chợ không chỉ là nơi giao thương mà còn là điểm gặp gỡ văn hóa của người dân địa phương.",
      "howToGet": "Chợ nằm ở trung tâm thành phố Ninh Bình, dễ dàng di chuyển bằng các phương tiện công cộng.",
      "bestTimeToVisit": "Chợ họp sớm nhất vào buổi sáng, đặc biệt nhộn nhịp vào các ngày cuối tuần.",
      "attractions": {
        "cultural": [
          {
            "name": "Khu chợ truyền thống",
            "description": "Nơi buôn bán sầm uất với nhiều đặc sản địa phương",
            "image": "assets/images/places/checkin-cho-rong-ninh-binh.jpg"
          },
          {
            "name": "Khu ẩm thực",
            "description": "Nơi thưởng thức các món ăn đặc sản",
            "image": "assets/images/places/khu-am-thuc-cho-rong.jpg"
          }
        ],
        "shopping": [
          {
            "name": "Khu bán đồ thủ công",
            "description": "Nơi bán các sản phẩm thủ công mỹ nghệ",
            "image": "assets/images/places/khu-thu-cong-cho-rong.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Cơm cháy Ninh Bình",
          "description": "Món ăn đặc sản nổi tiếng",
          "image": "assets/images/foods/com-chay.jpg"
        },
        {
          "name": "Nem chua Ninh Bình",
          "description": "Đặc sản nem chua truyền thống",
          "image": "assets/images/foods/nem-chua.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Tam Cốc - Bích Động",
          "description": "Danh thắng được mệnh danh là Hạ Long trên cạn",
          "distance": "7km",
          "image": "assets/images/places/tam-coc.jpg"
        },
        {
          "name": "Tràng An",
          "description": "Di sản văn hóa và thiên nhiên thế giới",
          "distance": "5km",
          "image": "assets/images/places/trang-an.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cơm cháy chà bông",
          "description": "Món ăn vặt đặc trưng",
          "price": "30000-50000 VND/phần",
          "where": "Các quầy ăn trong chợ"
        },
        {
          "name": "Nem chua Ninh Bình",
          "description": "Đặc sản nổi tiếng",
          "price": "100000-150000 VND/kg",
          "where": "Các cửa hàng đặc sản trong chợ"
        }
      ]
    },
    {
      "id": "mui-dien-phu-yen",
      "name": "Mũi Điện",
      "location": "Phú Yên",
      "image": "assets/images/places/checkin-mui-dien-phu-yen.png",
      "description": "Điểm cực Đông của Tổ quốc",
      "detailedDescription": "Mũi Điện hay còn gọi là Đại Lãnh là điểm cực Đông trên đất liền của Tổ quốc. Nơi đây có ngọn hải đăng cổ và cảnh quan thiên nhiên tuyệt đẹp với những bãi biển hoang sơ.",
      "howToGet": "Từ Tuy Hòa đi xe máy hoặc ô tô khoảng 35km theo quốc lộ 1A.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là từ tháng 3 đến tháng 8, đặc biệt là lúc bình minh.",
      "attractions": {
        "natural": [
          {
            "name": "Hải đăng Mũi Điện",
            "description": "Ngọn hải đăng cổ với cảnh quan biển tuyệt đẹp",
            "image": "assets/images/places/checkin-mui-dien-phu-yen.png"
          },
          {
            "name": "Bãi biển Mũi Điện",
            "description": "Bãi biển hoang sơ dưới chân hải đăng",
            "image": "assets/images/places/bai-bien-mui-dien.jpg"
          }
        ],
        "historical": [
          {
            "name": "Hải đăng cổ",
            "description": "Công trình kiến trúc thời Pháp",
            "image": "assets/images/places/hai-dang-co.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Mực một nắng",
          "description": "Đặc sản hải sản Phú Yên",
          "image": "assets/images/foods/muc-mot-nang.jpg"
        },
        {
          "name": "Bánh canh hẹ",
          "description": "Món ăn truyền thống Phú Yên",
          "image": "assets/images/foods/banh-canh-he.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Gành Đá Đĩa",
          "description": "Thắng cảnh với những khối đá hình lục giác",
          "distance": "20km",
          "image": "assets/images/places/ganh-da-dia.jpg"
        },
        {
          "name": "Bãi Xép",
          "description": "Bãi biển hoang sơ nổi tiếng",
          "distance": "15km",
          "image": "assets/images/places/bai-xep.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Mực một nắng nướng",
          "description": "Đặc sản biển",
          "price": "150000-200000 VND/phần",
          "where": "Các quán hải sản ven biển"
        },
        {
          "name": "Bánh canh hẹ",
          "description": "Món ăn truyền thống",
          "price": "25000-35000 VND/tô",
          "where": "Các quán ăn địa phương"
        }
      ]
    },
    {
      "id": "co-do-hue",
      "name": "Cố đô Huế",
      "location": "Thừa Thiên Huế",
      "image": "assets/images/places/checkin-co-do-hue.jpg",
      "description": "Di sản văn hóa thế giới UNESCO, kinh đô cuối cùng của triều đại phong kiến Việt Nam, nơi lưu giữ những giá trị văn hóa, kiến trúc và nghệ thuật độc đáo của dân tộc qua hơn 400 năm lịch sử",
      "detailedDescription": "Cố đô Huế là quần thể di tích rộng lớn bao gồm Kinh thành Huế, các lăng tẩm vua chúa và nhiều công trình kiến trúc độc đáo khác. Được UNESCO công nhận là Di sản Văn hóa Thế giới năm 1993, Huế là minh chứng sống động cho sự phát triển của kiến trúc cung đình và nghệ thuật Việt Nam thời Nguyễn (1802-1945). Kinh thành Huế được xây dựng theo mô hình 'Kinh đô kép' với Hoàng thành và Tử cấm thành bên trong, được bao bọc bởi hệ thống thành quách, hào nước kiên cố. Ngoài ra, quần thể còn bao gồm các lăng tẩm của các vị vua triều Nguyễn, mỗi lăng là một công trình nghệ thuật độc đáo với kiến trúc hài hòa giữa cảnh quan thiên nhiên và nhân tạo. Đặc biệt, Huế còn nổi tiếng với ẩm thực cung đình tinh tế, nghệ thuật ca Huế truyền thống và những khu vườn ngự uyển tuyệt đẹp.",
      "howToGet": "Có thể đến Huế bằng máy bay (sân bay Phú Bài), tàu hỏa (ga Huế) hoặc xe khách. Từ sân bay về trung tâm khoảng 15km, có thể đi taxi hoặc xe buýt. Trong nội thành, có thể thuê xe đạp hoặc xe máy để tham quan các điểm di tích.",
      "bestTimeToVisit": "Thời điểm lý tưởng nhất là từ tháng 1 đến tháng 4, khi thời tiết mát mẻ và ít mưa. Tháng 4 đến tháng 6 thường nóng nhưng là dịp diễn ra Festival Huế. Nên tránh mùa mưa (tháng 10-12). Buổi sáng sớm hoặc chiều tối là thời điểm đẹp nhất để chụp ảnh các di tích.",
      "attractions": {
        "historical": [
          {
            "name": "Đại Nội - Hoàng thành Huế",
            "description": "Trung tâm chính trị của triều Nguyễn với kiến trúc độc đáo, bao gồm Ngọ Môn, điện Thái Hòa, Tử Cấm Thành và các công trình quan trọng khác",
            "image": "assets/images/places/dai-noi-hue.jpg"
          },
          {
            "name": "Lăng Tự Đức",
            "description": "Công trình kiến trúc tuyệt đẹp, là nơi an nghỉ của vị vua thi sĩ, được thiết kế như một khu vườn thơ mộng với hồ nước, đình tạ và các công trình nghệ thuật",
            "image": "assets/images/places/lang-tu-duc.jpg"
          }
        ],
        "religious": [
          {
            "name": "Chùa Thiên Mụ",
            "description": "Ngôi chùa cổ nhất Huế với tháp Phước Duyên bảy tầng nổi tiếng, biểu tượng văn hóa và tâm linh của cố đô, nơi hội tụ giữa kiến trúc tôn giáo và cảnh quan thiên nhiên tuyệt đẹp bên dòng sông Hương thơ mộng",
            "image": "assets/images/places/checkin-chua-thien-mu.jpg"
          },
          {
            "name": "Điện Hòn Chén",
            "description": "Đền thờ Thiên Y A Na với kiến trúc độc đáo, nơi diễn ra lễ hội tế đàn hàng năm vào tháng 7 âm lịch",
            "image": "assets/images/places/dien-hon-chen.jpg"
          }
        ],
        "cultural": [
          {
            "name": "Vườn ngự uyển",
            "description": "Khu vườn hoàng gia với kiến trúc tinh tế, nơi các vua chúa thời Nguyễn nghỉ ngơi và thưởng ngoạn",
            "image": "assets/images/places/vuon-ngu-uyen.jpg"
          },
          {
            "name": "Bảo tàng Cổ vật Cung đình Huế",
            "description": "Nơi trưng bày các hiện vật quý giá thời Nguyễn, từ đồ dùng hoàng gia đến các tác phẩm nghệ thuật độc đáo",
            "image": "assets/images/places/bao-tang-co-vat.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Cơm hến",
          "description": "Món ăn dân dã đặc trưng của Huế, được chế biến từ hến sông Hương, ăn kèm với rau sống, bánh tráng và nước mắm cay",
          "image": "assets/images/foods/com-hen.jpg"
        },
        {
          "name": "Bún bò Huế",
          "description": "Món bún nổi tiếng với nước dùng đậm đà, thịt bò, giò heo và các gia vị đặc trưng của xứ Huế",
          "image": "assets/images/foods/bun-bo-hue.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Đầm Chuồn",
          "description": "Khu đầm phá tự nhiên với làng chài truyền thống, nơi thưởng thức hải sản tươi sống và ngắm hoàng hôn đẹp",
          "distance": "15km",
          "travelTime": "30 phút đi xe máy"
        },
        {
          "name": "Biển Thuận An",
          "description": "Bãi biển đẹp với cát trắng mịn, nước trong xanh và nhiều nhà hàng hải sản nổi tiếng",
          "distance": "12km",
          "travelTime": "25 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Bún bò Huế",
          "description": "Món bún bò truyền thống với nước dùng đậm đà và gia vị đặc trưng xứ Huế",
          "restaurant": "Bún bò Bà Mỹ - 17 Huỳnh Thúc Kháng",
          "price": "40000-55000 VND/tô"
        },
        {
          "name": "Bánh khoái Huế",
          "description": "Bánh khoái giòn với nhân tôm thịt và nước chấm đặc biệt",
          "restaurant": "Bánh khoái Lạc Thiện - 6 Đinh Tiên Hoàng",
          "price": "25000-35000 VND/cái"
        }
      ]
    },
    {
      "id": "chua-thien-mu",
      "name": "Chùa Thiên Mụ",
      "location": "Thừa Thiên Huế",
      "image": "assets/images/places/checkin-chua-thien-mu.jpg",
      "description": "Ngôi chùa cổ nhất xứ Huế với tháp Phước Duyên bảy tầng nổi tiếng, biểu tượng văn hóa và tâm linh của cố đô, nơi hội tụ giữa kiến trúc tôn giáo và cảnh quan thiên nhiên tuyệt đẹp bên dòng sông Hương thơ mộng",
      "detailedDescription": "Chùa Thiên Mụ, còn gọi là chùa Linh Mụ, được xây dựng vào năm 1601 dưới triều chúa Nguyễn Hoàng. Tọa lạc trên đồi Hà Khê, bên bờ sông Hương, chùa không chỉ là một công trình kiến trúc tôn giáo độc đáo mà còn là chứng nhân lịch sử của nhiều sự kiện quan trọng. Điểm nhấn của chùa là tháp Phước Duyên bảy tầng cao 21m, được xây dựng năm 1844 dưới triều vua Thiệu Trị, mỗi tầng thờ một vị Phật khác nhau. Ngoài ra, chùa còn có nhiều công trình kiến trúc quan trọng như điện Đại Hùng, nhà Thuyết Pháp, lầu chuông, lầu trống và khu vườn cảnh với những cây cổ thụ hàng trăm năm tuổi. Đặc biệt, chùa còn lưu giữ chiếc xe Austin màu xanh gắn liền với sự kiện lịch sử năm 1963. Hàng năm, chùa tổ chức nhiều lễ hội Phật giáo quan trọng, thu hút hàng nghìn Phật tử và du khách thập phương.",
      "howToGet": "Từ trung tâm thành phố Huế đi khoảng 5km theo đường Kim Long hoặc đường Lê Duẩn. Có thể đi xe máy, taxi hoặc tham gia tour du lịch sông Hương bằng thuyền. Từ bến thuyền trung tâm đi thuyền khoảng 30 phút để đến chùa.",
      "bestTimeToVisit": "Có thể tham quan quanh năm, nhưng đẹp nhất là vào buổi sáng sớm hoặc chiều tà khi thời tiết mát mẻ. Tháng 1-2 (dịp Tết) và tháng 4 (lễ Phật Đản) là thời điểm chùa tổ chức nhiều lễ hội đặc sắc. Nên tránh giờ trưa nắng nóng và mùa mưa (tháng 10-12).",
      "attractions": {
        "religious": [
          {
            "name": "Tháp Phước Duyên",
            "description": "Tháp bảy tầng cao 21m, biểu tượng của chùa Thiên Mụ, được xây dựng năm 1844 với kiến trúc độc đáo và ý nghĩa tâm linh sâu sắc",
            "image": "assets/images/places/thap-phuoc-duyen.jpg"
          },
          {
            "name": "Điện Đại Hùng",
            "description": "Điện thờ chính của chùa với tượng Phật trang nghiêm và kiến trúc truyền thống, nơi diễn ra các nghi lễ quan trọng",
            "image": "assets/images/places/dien-dai-hung.jpg"
          }
        ],
        "historical": [
          {
            "name": "Xe Austin lịch sử",
            "description": "Chiếc xe Austin màu xanh gắn liền với sự kiện lịch sử năm 1963, được bảo quản nguyên vẹn trong khuôn viên chùa",
            "image": "assets/images/places/xe-austin.jpg"
          },
          {
            "name": "Bảo tháp Tổ",
            "description": "Nơi thờ các vị cao tăng đã từng trụ trì tại chùa, công trình mang đậm kiến trúc Phật giáo truyền thống",
            "image": "assets/images/places/bao-thap-to.jpg"
          }
        ],
        "natural": [
          {
            "name": "Vườn cảnh quan",
            "description": "Khu vườn với nhiều cây cổ thụ hàng trăm năm tuổi, tạo nên không gian thanh tịnh và mát mẻ",
            "image": "assets/images/places/vuon-canh-quan.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Chè Huế",
          "description": "Các loại chè truyền thống của Huế được chế biến tinh tế, đặc biệt là chè khoai tía và chè bột lọc",
          "image": "assets/images/foods/che-hue.jpg"
        },
        {
          "name": "Cơm chay",
          "description": "Các món ăn chay được chế biến công phu theo phong cách Phật giáo, đảm bảo dinh dưỡng và thanh tịnh",
          "image": "assets/images/foods/com-chay.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Điện Hòn Chén",
          "description": "Đền thờ cổ nằm bên bờ sông Hương, nơi diễn ra lễ hội tế đàn truyền thống",
          "distance": "3km",
          "travelTime": "10 phút đi xe máy"
        },
        {
          "name": "Lăng Tự Đức",
          "description": "Lăng tẩm của vị vua thi sĩ triều Nguyễn với kiến trúc tinh tế và cảnh quan thơ mộng",
          "distance": "5km",
          "travelTime": "15 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cơm chay Thiên Mụ",
          "description": "Bữa cơm chay thanh tịnh với các món ăn được chế biến từ rau củ tươi và đậu phụ",
          "restaurant": "Nhà hàng chay Thiên Mụ - Trong khuôn viên chùa",
          "price": "35000-50000 VND/suất"
        },
        {
          "name": "Chè khoai tía",
          "description": "Món chè truyền thống của Huế với khoai tía thơm ngon và nước cốt dừa béo ngậy",
          "restaurant": "Quán chè Hương - Đối diện cổng chùa",
          "price": "15000-25000 VND/chén"
        }
      ]
    },
    {
      "id": "lang-tu-duc",
      "name": "Lăng Tự Đức",
      "location": "Thừa Thiên Huế",
      "image": "assets/images/places/checkin-lang-tu-duc.jpg",
      "description": "Quần thể lăng tẩm đẹp nhất và lãng mạn nhất trong các lăng tẩm nhà Nguyễn, nơi an nghỉ của vị vua thi sĩ Tự Đức, là kiệt tác kiến trúc hài hòa giữa cảnh quan thiên nhiên và bàn tay con người",
      "detailedDescription": "Lăng Tự Đức được xây dựng từ năm 1864 đến 1867, là nơi an nghỉ của vua Tự Đức - vị vua trị vì lâu nhất triều Nguyễn (1847-1883). Quần thể lăng rộng 12 ha được thiết kế như một công viên thu nhỏ với hơn 50 công trình kiến trúc. Đặc biệt, đây là lăng tẩm duy nhất được vua sử dụng làm nơi nghỉ ngơi, làm việc và ngao du thưởng ngoạn khi còn sống. Kiến trúc lăng thể hiện sự hài hòa tuyệt đối giữa cảnh quan thiên nhiên và nhân tạo, với hồ Lưu Khiêm, đảo Tiểu Trung Châu, các điện thờ, nhà bia, và vườn thơ Xung Khiêm. Mỗi công trình đều mang tên gọi thể hiện đức tính khiêm nhường của vua Tự Đức. Nơi đây còn lưu giữ nhiều bài thơ do chính vua sáng tác, khắc trên bia đá, phản ánh tâm hồn nghệ sĩ và triết lý sống của ông.",
      "howToGet": "Từ trung tâm thành phố Huế đi khoảng 7km theo đường Lê Ngô Cát hoặc đường Nam Giao. Có thể đi xe máy, taxi hoặc tham gia tour tham quan lăng tẩm. Nên thuê hướng dẫn viên để hiểu rõ hơn về lịch sử và ý nghĩa của các công trình.",
      "bestTimeToVisit": "Thời điểm lý tưởng là từ tháng 2 đến tháng 4, khi thời tiết mát mẻ và hoa nở rộ. Nên đến vào buổi sáng sớm hoặc chiều tà để tránh nắng nóng và có ánh sáng đẹp cho việc chụp ảnh. Tránh thời điểm mưa nhiều (tháng 10-12) vì đường trơn trượt và khó tham quan.",
      "attractions": {
        "historical": [
          {
            "name": "Điện Khiêm Cung",
            "description": "Nơi vua Tự Đức làm việc và nghỉ ngơi khi còn sống, với kiến trúc tinh tế và nội thất quý giá thời Nguyễn",
            "image": "assets/images/places/dien-khiem-cung.jpg"
          },
          {
            "name": "Bia Khiêm Cung",
            "description": "Bia đá khắc bài văn do chính vua Tự Đức soạn, kể về cuộc đời và triều đại của mình với giọng văn khiêm nhường",
            "image": "assets/images/places/bia-khiem-cung.jpg"
          }
        ],
        "architectural": [
          {
            "name": "Vườn Xung Khiêm",
            "description": "Khu vườn thơ mộng với hồ nước, cầu nhỏ và đình tạ, nơi vua thường ngâm thơ và thưởng ngoạn",
            "image": "assets/images/places/vuon-xung-khiem.jpg"
          },
          {
            "name": "Lầu Hữu Phối",
            "description": "Công trình kiến trúc độc đáo dùng làm nơi thờ các phi tần của vua, thể hiện nghệ thuật kiến trúc tinh xảo thời Nguyễn",
            "image": "assets/images/places/lau-huu-phoi.jpg"
          }
        ],
        "natural": [
          {
            "name": "Hồ Lưu Khiêm",
            "description": "Hồ nước nhân tạo rộng lớn với đảo Tiểu Trung Châu ở giữa, tạo nên cảnh quan thơ mộng và yên bình",
            "image": "assets/images/places/ho-luu-khiem.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Trà sen Tự Đức",
          "description": "Trà ướp sen theo phương pháp cổ truyền của cung đình Huế, thơm ngon và tinh tế",
          "image": "assets/images/foods/tra-sen.jpg"
        },
        {
          "name": "Bánh đặc sản Huế",
          "description": "Các loại bánh truyền thống như bánh khoái, bánh bèo, bánh nậm được chế biến theo công thức cung đình",
          "image": "assets/images/foods/banh-hue.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Lăng Khải Định",
          "description": "Lăng tẩm độc đáo với kiến trúc kết hợp Đông - Tây, nổi tiếng với các họa tiết trang trí công phu",
          "distance": "4km",
          "travelTime": "15 phút đi xe máy"
        },
        {
          "name": "Chùa Thiên Mụ",
          "description": "Ngôi chùa cổ nổi tiếng với tháp Phước Duyên bảy tầng, biểu tượng của thành phố Huế",
          "distance": "5km",
          "travelTime": "20 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cơm hến",
          "description": "Món ăn dân dã đặc trưng của Huế với hến sông Hương và các gia vị đặc biệt",
          "restaurant": "Quán cơm hến Hoa Đông - Đường Nguyễn Sinh Cung",
          "price": "25000-35000 VND/phần"
        },
        {
          "name": "Chè Huế",
          "description": "Các loại chè truyền thống được chế biến tinh tế theo phong cách cung đình",
          "restaurant": "Chè Hẻm - Kiệt Đội Cung",
          "price": "15000-25000 VND/chén"
        }
      ]
    },
    {
      "id": "lang-khai-dinh",
      "name": "Lăng Khải Định",
      "location": "Thừa Thiên Huế",
      "image": "assets/images/places/checkin-lang-khai-dinh.jpg",
      "description": "Công trình kiến trúc độc đáo nhất trong các lăng tẩm nhà Nguyễn, nơi hội tụ giữa nghệ thuật Đông - Tây với những họa tiết trang trí tinh xảo và phong cách kiến trúc pha trộn độc đáo",
      "detailedDescription": "Lăng Khải Định được xây dựng từ năm 1920 đến 1931, là nơi an nghỉ của vua Khải Định - vị vua thứ 12 của triều Nguyễn. Đây là lăng tẩm duy nhất được xây dựng bằng bê tông cốt thép, với kiến trúc độc đáo kết hợp giữa phong cách Gothic, Baroque của phương Tây và nghệ thuật trang trí truyền thống của phương Đông. Lăng được xây dựng trên núi Chung Sơn với 127 bậc đá dẫn lên, gồm ba tầng chính: Tầng 1 là sân Thiên Điện, tầng 2 là điện Thiên Định, và tầng 3 là cung Ứng Lăng. Đặc biệt, nội thất của điện Thiên Định được trang trí cực kỳ công phu với các bức tranh khảm sứ, thủy tinh màu và gốm sứ quý, tạo nên một không gian nghệ thuật độc đáo. Trần điện được trang trí 9 con rồng uốn lượn tinh xảo, tượng trưng cho 9 đời vua nhà Nguyễn.",
      "howToGet": "Từ trung tâm thành phố Huế đi khoảng 10km theo đường Lê Ngô Cát hoặc đường Nam Giao. Có thể đi xe máy, taxi hoặc tham gia tour tham quan lăng tẩm. Nên thuê xe ôm hoặc taxi vì đường lên lăng khá dốc.",
      "bestTimeToVisit": "Thời điểm lý tưởng là từ tháng 2 đến tháng 4, khi thời tiết mát mẻ và trong lành. Nên đến vào buổi sáng sớm để tránh nắng nóng và đông khách. Ánh sáng buổi sáng cũng tốt nhất để ngắm các chi tiết trang trí và chụp ảnh. Tránh những ngày mưa vì đường dốc sẽ trơn trượt.",
      "attractions": {
        "architectural": [
          {
            "name": "Điện Thiên Định",
            "description": "Công trình chính của lăng với kiến trúc độc đáo, nổi tiếng với trần nhà được trang trí 9 con rồng và các bức tranh khảm sứ công phu",
            "image": "assets/images/places/dien-thien-dinh.jpg"
          },
          {
            "name": "Cung Ứng Lăng",
            "description": "Nơi đặt long vị và bài vị của vua Khải Định, được trang trí lộng lẫy với nhiều họa tiết tinh xảo",
            "image": "assets/images/places/cung-ung-lang.jpg"
          }
        ],
        "decorative": [
          {
            "name": "Tranh khảm sứ",
            "description": "Bộ sưu tập tranh khảm sứ độc đáo với hơn 2000 bức tranh được làm từ mảnh sứ và thủy tinh màu",
            "image": "assets/images/places/tranh-kham-su.jpg"
          },
          {
            "name": "Tượng đồng vua Khải Định",
            "description": "Tượng đồng của vua được đúc tại Pháp, là tác phẩm điêu khắc quý giá với độ tinh xảo cao",
            "image": "assets/images/places/tuong-khai-dinh.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Bánh bột lọc Huế",
          "description": "Bánh trong suốt nhân tôm thịt, đặc sản truyền thống của xứ Huế được gói trong lá chuối",
          "image": "assets/images/foods/banh-bot-loc.jpg"
        },
        {
          "name": "Bánh khoái Huế",
          "description": "Bánh đặc sản với vỏ giòn, nhân tôm thịt và trứng, ăn kèm rau sống và nước chấm đặc biệt",
          "image": "assets/images/foods/banh-khoai.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Lăng Tự Đức",
          "description": "Lăng tẩm lãng mạn nhất trong các lăng tẩm nhà Nguyễn, nổi tiếng với cảnh quan thơ mộng",
          "distance": "4km",
          "travelTime": "15 phút đi xe máy"
        },
        {
          "name": "Làng hương Thủy Xuân",
          "description": "Làng nghề truyền thống nổi tiếng với nghề làm hương, tạo nên những nén hương thơm nổi tiếng xứ Huế",
          "distance": "3km",
          "travelTime": "10 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Bánh bột lọc Huyền Anh",
          "description": "Bánh bột lọc truyền thống với nhân tôm thịt đậm đà, được gói trong lá chuối tươi",
          "restaurant": "Quán Huyền Anh - Đường Hùng Vương",
          "price": "30000-40000 VND/10 cái"
        },
        {
          "name": "Bánh khoái Lạc Thiện",
          "description": "Bánh khoái giòn rụm với nhân tôm thịt và trứng, nước chấm đặc biệt",
          "restaurant": "Quán Lạc Thiện - 6 Đinh Tiên Hoàng",
          "price": "25000-35000 VND/cái"
        }
      ]
    },
    {
      "id": "dai-noi-hue",
      "name": "Đại Nội Huế",
      "location": "Thừa Thiên Huế",
      "image": "assets/images/places/checkin-dai-noi-hue.jpg",
      "description": "Trung tâm quyền lực của triều Nguyễn và là quần thể di tích hoàng cung đồ sộ nhất Việt Nam, nơi lưu giữ những giá trị văn hóa, kiến trúc và lịch sử độc đáo của triều đại phong kiến cuối cùng",
      "detailedDescription": "Đại Nội Huế, hay còn gọi là Hoàng thành Huế, được xây dựng từ năm 1805 dưới triều vua Gia Long và hoàn thiện vào năm 1832 dưới triều vua Minh Mạng. Quần thể này bao gồm Kinh thành (chu vi 10km), Hoàng thành và Tử Cấm thành với hơn 100 công trình kiến trúc đặc sắc. Kinh thành được bao bọc bởi hệ thống thành lũy kiên cố với 10 cổng thành, trong đó Ngọ Môn là cổng chính phía Nam dành cho vua. Bên trong Tử Cấm thành có điện Thái Hòa - nơi vua thiết triều, Cung Diên Thọ - nơi ở của Hoàng thái hậu, Cung Trường Sanh - nơi ở của Hoàng thái hậu về hưu, và nhiều cung điện khác. Đặc biệt, kiến trúc nơi đây thể hiện rõ tư tưởng phong thủy và triết học phương Đông, với trục chính Nam-Bắc và các công trình được bố trí hài hòa, cân đối.",
      "howToGet": "Từ trung tâm thành phố Huế có thể đi bộ hoặc đi xe khoảng 10 phút. Cổng chính của Đại Nội (Ngọ Môn) nằm trên đường Lê Duẩn. Có thể thuê xe đạp hoặc tham gia tour tham quan có hướng dẫn viên để hiểu rõ hơn về lịch sử và ý nghĩa của các công trình.",
      "bestTimeToVisit": "Thời điểm lý tưởng là từ tháng 2 đến tháng 4, khi thời tiết mát mẻ và ít mưa. Nên đến sớm vào buổi sáng (7-9h) để tránh nắng nóng và đông khách. Dịp Festival Huế (thường tổ chức vào tháng 4 hoặc tháng 6) là thời điểm có nhiều hoạt động văn hóa đặc sắc.",
      "attractions": {
        "historical": [
          {
            "name": "Ngọ Môn",
            "description": "Cổng chính của Hoàng thành với kiến trúc độc đáo gồm 5 cửa và lầu Ngũ Phụng, nơi vua quan sát các lễ hội và duyệt binh",
            "image": "assets/images/places/ngo-mon.jpg"
          },
          {
            "name": "Điện Thái Hòa",
            "description": "Nơi vua thiết triều và tổ chức các nghi lễ quan trọng, nổi tiếng với 80 cột sơn son thếp vàng và kiến trúc cung đình tinh xảo",
            "image": "assets/images/places/dien-thai-hoa.jpg"
          }
        ],
        "architectural": [
          {
            "name": "Thế Miếu",
            "description": "Nơi thờ các vị vua triều Nguyễn, với kiến trúc trang nghiêm và những tấm bia đá ghi chép công trạng các vị vua",
            "image": "assets/images/places/the-mieu.jpg"
          },
          {
            "name": "Cửu Đỉnh",
            "description": "Chín đỉnh đồng lớn đúc dưới triều Minh Mạng, biểu tượng quyền lực của hoàng gia và là báu vật quốc gia",
            "image": "assets/images/places/cuu-dinh.jpg"
          }
        ],
        "cultural": [
          {
            "name": "Bảo tàng Cổ vật Hoàng cung",
            "description": "Trưng bày các hiện vật quý giá thời Nguyễn như ngọc ấn, đồ thờ cúng, trang phục hoàng gia",
            "image": "assets/images/places/bao-tang-co-vat.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Cơm hến",
          "description": "Món ăn dân dã đặc trưng của Huế với hến sông Hương, ăn kèm các loại rau thơm và gia vị đặc biệt",
          "image": "assets/images/foods/com-hen.jpg"
        },
        {
          "name": "Bánh bèo Huế",
          "description": "Bánh truyền thống làm từ bột gạo, ăn kèm tôm khô, mỡ hành và nước mắm chua ngọt",
          "image": "assets/images/foods/banh-beo.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Sông Hương",
          "description": "Dòng sông thơ mộng chảy qua thành phố, nơi lý tưởng để đi thuyền ngắm cảnh và thưởng thức ca Huế",
          "distance": "0.2km",
          "travelTime": "5 phút đi bộ"
        },
        {
          "name": "Chợ Đông Ba",
          "description": "Khu chợ truyền thống lớn nhất Huế, nơi bán các đặc sản và đồ thủ công mỹ nghệ",
          "distance": "1km",
          "travelTime": "15 phút đi bộ"
        }
      ],
      "recommendedFood": [
        {
          "name": "Bún bò Huế",
          "description": "Món bún bò truyền thống với nước dùng đậm đà và gia vị đặc trưng xứ Huế",
          "restaurant": "Bún bò Mụ Rơi - 11 Trương Định",
          "price": "40000-55000 VND/tô"
        },
        {
          "name": "Bánh khoái",
          "description": "Bánh đặc sản với vỏ giòn, nhân tôm thịt và nước chấm đặc biệt",
          "restaurant": "Bánh khoái Hạnh - 11 Phó Đức Chính",
          "price": "25000-35000 VND/cái"
        }
      ]
    },
    {
      "id": "cho-dong-ba",
      "name": "Chợ Đông Ba",
      "location": "Thừa Thiên Huế",
      "image": "assets/images/places/checkin-cho-dong-ba.jpg",
      "description": "Khu chợ truyền thống lớn nhất và lâu đời nhất xứ Huế, trung tâm thương mại sầm uất với đầy đủ hàng hóa địa phương, nơi hội tụ văn hóa ẩm thực và sinh hoạt đặc trưng của người dân cố đô",
      "detailedDescription": "Chợ Đông Ba được xây dựng từ năm 1887 dưới triều vua Đồng Khánh, nằm bên bờ sông Hương thơ mộng. Chợ có lịch sử hơn 130 năm, là một trong những khu chợ lâu đời và lớn nhất miền Trung. Với diện tích hơn 16.000m², chợ có hơn 2.500 gian hàng, chia thành nhiều khu vực chuyên biệt như khu bán vải Huế, khu ẩm thực, khu đồ thủ công mỹ nghệ, và khu bán đặc sản. Đặc biệt, chợ nổi tiếng với các mặt hàng truyền thống như nón lá bài thơ, áo dài Huế, các loại mắm và đặc sản địa phương. Khu ẩm thực của chợ là nơi du khách có thể thưởng thức đầy đủ các món ăn đặc trưng của xứ Huế như bún bò, cơm hến, bánh bèo, bánh nậm. Chợ không chỉ là trung tâm mua sắm mà còn là điểm đến văn hóa, nơi du khách có thể tìm hiểu về đời sống thường nhật của người dân địa phương.",
      "howToGet": "Từ trung tâm thành phố Huế đi bộ khoảng 10-15 phút theo đường Trần Hưng Đạo. Chợ nằm ngay cạnh cầu Tràng Tiền, một trong những biểu tượng của thành phố. Có thể đi xe máy, taxi hoặc xích lô từ các điểm du lịch khác trong thành phố.",
      "bestTimeToVisit": "Chợ hoạt động từ sáng sớm đến tối. Thời điểm lý tưởng để tham quan là từ 7-9h sáng khi các hàng quán vừa bày bán và thực phẩm còn tươi ngon. Buổi chiều từ 15-17h cũng là thời điểm tốt để mua sắm khi thời tiết mát mẻ hơn. Nên tránh giờ trưa nắng nóng và những ngày mưa lớn.",
      "attractions": {
        "shopping": [
          {
            "name": "Khu vải Huế",
            "description": "Khu vực chuyên bán vải may áo dài truyền thống, lụa Huế và các loại vải địa phương với nhiều mẫu mã đẹp",
            "image": "assets/images/places/khu-vai-hue.jpg"
          },
          {
            "name": "Khu đồ lưu niệm",
            "description": "Nơi bán các sản phẩm thủ công mỹ nghệ, tranh thêu, nón lá bài thơ và các món quà lưu niệm đặc trưng Huế",
            "image": "assets/images/places/khu-do-luu-niem.jpg"
          }
        ],
        "culinary": [
          {
            "name": "Khu ẩm thực",
            "description": "Tập trung nhiều quầy bán đặc sản Huế như bún bò, cơm hến, các loại bánh truyền thống và chè Huế",
            "image": "assets/images/places/khu-am-thuc.jpg"
          },
          {
            "name": "Khu đặc sản",
            "description": "Nơi bán các loại mắm, gia vị, trái cây và đặc sản địa phương để làm quà",
            "image": "assets/images/places/khu-dac-san.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Bún bò Huế",
          "description": "Món bún bò truyền thống với nước dùng đậm đà, thịt bò, giò heo và các gia vị đặc trưng xứ Huế",
          "image": "assets/images/foods/bun-bo-hue.jpg"
        },
        {
          "name": "Bánh bèo chợ Đông Ba",
          "description": "Bánh bèo được làm tại chỗ, ăn kèm tôm khô, mỡ hành và nước mắm chua ngọt đặc biệt",
          "image": "assets/images/foods/banh-beo.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Cầu Tràng Tiền",
          "description": "Cây cầu lịch sử bắc qua sông Hương, biểu tượng của thành phố Huế, đặc biệt đẹp về đêm với hệ thống đèn LED đổi màu",
          "distance": "0.2km",
          "travelTime": "3 phút đi bộ"
        },
        {
          "name": "Đại Nội Huế",
          "description": "Quần thể di tích cung đình nhà Nguyễn, nơi tham quan không thể bỏ qua khi đến Huế",
          "distance": "1km",
          "travelTime": "15 phút đi bộ"
        }
      ],
      "recommendedFood": [
        {
          "name": "Bún bò Huế Bà Đào",
          "description": "Bún bò truyền thống với nước dùng đậm đà và thịt bò mềm",
          "restaurant": "Quầy bún bò Bà Đào - Khu ẩm thực chợ Đông Ba",
          "price": "35000-45000 VND/tô"
        },
        {
          "name": "Bánh khoái Bà Cúc",
          "description": "Bánh khoái giòn rụm với nhân tôm thịt và nước chấm đặc biệt",
          "restaurant": "Quầy bánh khoái Bà Cúc - Lối vào chính chợ Đông Ba",
          "price": "20000-30000 VND/cái"
        }
      ]
    }
  ]
} 