{
  "places": [
    {
      "id": "thanh-co-quang-tri",
      "name": "Thành cổ Quảng Trị",
      "location": "Quảng Trị",
      "image": "assets/images/places/checkin-thanh-co-quang-tri.jpg",
      "description": "Di tích lịch sử cấp quốc gia đặc biệt, chứng tích của 81 ngày đêm chiến đấu anh dũng bảo vệ thành cổ năm 1972, biểu tượng của tinh thần chiến đấu kiên cường và bất khuất của quân và dân ta",
      "customSection": {
        "title": "81 Ngày Đêm Chiến Đấu Bảo Vệ Thành Cổ",
        "content": "<div class=\"custom-section-item\">\n<div class=\"folk-song-description\">\n<h4>Cuộc Chiến Bảo Vệ Thành Cổ</h4>\nTrong 81 ngày đêm từ ngày 28/6 đến 16/9/1972, quân và dân ta đã anh dũng chiến đấu bảo vệ thành cổ Quảng Trị. Đây là một trong những trận chiến ác liệt nhất của cuộc kháng chiến chống Mỹ, với sự hy sinh anh dũng của hàng nghìn chiến sĩ để bảo vệ từng tấc đất của Tổ quốc.\n\n<h4>Tinh Thần Chiến Đấu Kiên Cường</h4>\nTrong điều kiện khốc liệt, với hơn 328.000 quả bom đạn của địch trút xuống mỗi ngày, các chiến sĩ vẫn kiên cường bám trụ, chiến đấu. Họ đã biến thành cổ thành một pháo đài vững chắc, một biểu tượng của ý chí và tinh thần bất khuất của dân tộc.\n\n<h4>Chiến Thắng Lịch Sử</h4>\nSau 81 ngày đêm chiến đấu, quân và dân ta đã giành thắng lợi, giải phóng hoàn toàn thành cổ Quảng Trị. Chiến thắng này không chỉ có ý nghĩa quân sự mà còn là thắng lợi về tinh thần, khẳng định ý chí độc lập, tự do của dân tộc.\n\n<h4>Di Tích Lịch Sử</h4>\nNgày nay, thành cổ Quảng Trị là di tích lịch sử cấp quốc gia đặc biệt, nơi ghi dấu chiến công hiển hách của quân và dân ta. Mỗi viên gạch, mỗi bức tường còn lưu giữ dấu tích của những trận đánh ác liệt, là chứng nhân lịch sử của một thời kỳ hào hùng.</div>\n</div>"
      },
      "detailedDescription": "Thành cổ Quảng Trị là một công trình kiến trúc quân sự được xây dựng từ thời Nguyễn (1809-1818), có hình vuông với chu vi 2.160m, cao 4m. Trong cuộc kháng chiến chống Mỹ, đặc biệt là 81 ngày đêm năm 1972, thành cổ trở thành biểu tượng của tinh thần chiến đấu kiên cường của quân và dân ta. Mỗi ngày có hơn 328.000 quả bom đạn của địch trút xuống, nhưng các chiến sĩ vẫn anh dũng bám trụ, chiến đấu bảo vệ từng tấc đất. Ngày nay, di tích thành cổ không chỉ là chứng tích lịch sử mà còn là nơi giáo dục truyền thống yêu nước cho các thế hệ mai sau.",
      "howToGet": "Thành cổ nằm ở trung tâm thành phố Quảng Trị, cách Huế khoảng 60km về phía Bắc. Có thể đi bằng xe khách hoặc tàu từ Huế hoặc Đông Hà.",
      "bestTimeToVisit": "Có thể tham quan quanh năm, nhưng thời điểm đẹp nhất là từ tháng 3 đến tháng 8 khi thời tiết khô ráo. Đặc biệt vào dịp kỷ niệm giải phóng thành cổ (16/9) có nhiều hoạt động tưởng niệm ý nghĩa.",
      "attractions": {
        "historical": [
          {
            "name": "Thành cổ",
            "description": "Công trình kiến trúc quân sự thời Nguyễn, chứng tích của 81 ngày đêm chiến đấu anh dũng",
            "image": "assets/images/places/checkin_thanh-co-quang-tri.jpg"
          },
          {
            "name": "Bảo tàng Thành cổ",
            "description": "Nơi trưng bày hiện vật và tư liệu về trận chiến 81 ngày đêm",
            "image": "assets/images/places/bao-tang-thanh-co.jpg"
          }
        ],
        "cultural": [
          {
            "name": "Đền tưởng niệm",
            "description": "Nơi tưởng nhớ các anh hùng liệt sĩ đã hy sinh trong chiến đấu",
            "image": "assets/images/places/den-tuong-niem-thanh-co.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Cơm hến Quảng Trị",
          "description": "Món ăn dân dã đặc trưng của vùng đất Quảng Trị",
          "image": "assets/images/foods/com-hen.jpg"
        },
        {
          "name": "Bánh ít lá gai",
          "description": "Bánh truyền thống với nhân đậu xanh và vỏ bánh màu đen từ lá gai",
          "image": "assets/images/foods/banh-it-la-gai.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Sông Thạch Hãn",
          "description": "Dòng sông lịch sử gắn liền với chiến tích bảo vệ thành cổ",
          "distance": "0.5km",
          "travelTime": "10 phút đi bộ"
        },
        {
          "name": "Nghĩa trang liệt sĩ Trường Sơn",
          "description": "Nơi yên nghỉ của hàng vạn liệt sĩ",
          "distance": "30km",
          "travelTime": "45 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cơm hến",
          "description": "Món cơm trộn với hến, rau thơm và gia vị đặc trưng",
          "restaurant": "Quán cơm hến Bà Hoà - Gần thành cổ",
          "price": "25000-35000 VND/phần"
        },
        {
          "name": "Bánh ít lá gai",
          "description": "Bánh truyền thống thơm ngon, đặc sản địa phương",
          "restaurant": "Tiệm bánh Thanh Tâm - Chợ Quảng Trị",
          "price": "5000-10000 VND/cái"
        }
      ]
    },
    {
      "id": "chua-huong-ha-noi",
      "name": "Chùa Hương",
      "location": "Hà Nội",
      "image": "assets/images/places/checkin-chua-huong-ha-noi.jpg",
      "description": "Danh thắng tâm linh nổi tiếng với quần thể hang động mang đậm màu sắc tín ngưỡng dân gian và đạo Phật, nơi hội tụ giữa đức tin tâm linh và vẻ đẹp kỳ vĩ của tạo hóa",
      "detailedDescription": "Chùa Hương hay còn gọi là chùa Hương Tích là một quần thể hang động mang đậm màu sắc tín ngưỡng dân gian – đạo Phật với nền văn hoá nông nghiệp và phảng phất nét văn hoá phồn thực. Theo truyền thuyết, vào thế kỷ đầu tiên, vùng 'Linh sơn phúc địa' này đã có công chúa Diệu Thiện (tục gọi là Chúa Ba), ứng thân của Bồ Tát Quán Thế Âm, đã vào tu hành 9 năm đắc đạo thành Phật đi cứu độ chúng sinh. Vào tháng 3 năm Canh Dần (1770), Chúa Tĩnh Đô Vương Trịnh Sâm đã vào động Hương Tích thắp hương vãn cảnh và đề lên vách đá cửa động năm chữ 'Nam Thiên Đệ Nhất Động', đưa vị thế động Hương Tích trở thành một di tích lớn. Từ thời Vua Lê Thánh Tông niên hiệu Quang Thuận (1460 – 1469) khai phá ra vùng đất Hương Sơn đến nay, đã trải qua 13 đời Sư tổ. Ngày nay, lễ hội Chùa Hương đã trở thành một lễ hội lớn thu hút hàng triệu lượt du khách về thăm quan chiêm bái, với thời gian diễn ra lâu nhất và có lượng du khách về trẩy hội đông nhất.",
      "howToGet": "Từ trung tâm Hà Nội, bạn có thể đi xe khách hoặc xe máy đến Mỹ Đức (khoảng 70km). Sau đó đi thuyền và leo núi để thăm quan các điểm trong quần thể.",
      "bestTimeToVisit": "Thời điểm lý tưởng để thăm Chùa Hương là từ tháng Giêng đến tháng Ba âm lịch (mùa lễ hội), đặc biệt là sau ngày mùng 6 tháng Giêng - ngày khai hội chính thức. Thời điểm này khí trời mát mẻ, cây cỏ xanh tươi, trăm hoa đua nở.",
      "attractions": {
        "religious": [
          {
            "name": "Động Hương Tích",
            "description": "Động được Chúa Trịnh Sâm phong tặng là 'Nam Thiên Đệ Nhất Động', nơi thờ Phật Bà Quán Thế Âm và là chỗ dựa tinh thần của lòng dân",
            "image": "assets/images/places/checkin-chua-huong-ha-noi.jpg"
          },
          {
            "name": "Đền Trình (Ngũ Nhạc Linh Từ)",
            "description": "Nơi làm lễ khai sơn của làng Yến Vỹ, thờ sơn thần và vị thần tướng có công đánh giặc Ân dưới cờ Đức Thánh Phù Đổng",
            "image": "assets/images/places/den-trinh.jpg"
          }
        ],
        "natural": [
          {
            "name": "Suối Yến",
            "description": "Dòng suối uốn lượn giữa núi non, nơi du khách đi thuyền ngắm cảnh, chiêm ngưỡng vẻ đẹp hoang sơ của thiên nhiên",
            "image": "assets/images/places/suoi-yen.jpg"
          },
          {
            "name": "Quần thể hang động",
            "description": "Hệ thống hang động tự nhiên mang đậm dấu ấn văn hóa nông nghiệp và phồn thực, với những hình ảnh như ao bèo, con trâu, đàn lợn, nong tằm, né kén",
            "image": "assets/images/places/dong-huong-tich.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Bánh chưng rau sắn",
          "description": "Đặc sản truyền thống của vùng Hương Sơn, được làm từ gạo nếp và rau sắn rừng",
          "image": "assets/images/foods/banh-chung-rau-san.jpg"
        },
        {
          "name": "Chè lam Hương Sơn",
          "description": "Món chè đặc trưng của vùng núi, được làm từ gạo nếp và mật mía",
          "image": "assets/images/foods/che-lam.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Khu di tích Ngã Ba Đồng Lộc",
          "description": "Di tích lịch sử cách mạng ghi dấu sự hy sinh của các nữ thanh niên xung phong",
          "distance": "15km",
          "travelTime": "30 phút đi xe máy"
        },
        {
          "name": "Làng cổ Đường Lâm",
          "description": "Làng cổ với kiến trúc truyền thống đặc trưng của vùng đồng bằng Bắc Bộ",
          "distance": "25km",
          "travelTime": "45 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Bánh chưng rau sắn",
          "description": "Món ăn truyền thống với hương vị đặc trưng của rau sắn rừng",
          "restaurant": "Quán ăn Hương Sơn - Gần bến đò Suối Yến",
          "price": "25000-35000 VND/cái"
        },
        {
          "name": "Cơm chay Hương Sơn",
          "description": "Bữa cơm chay thanh tịnh với các món từ rau củ địa phương",
          "restaurant": "Nhà hàng chay Thiền Tâm - Đường vào chùa Hương",
          "price": "50000-80000 VND/suất"
        }
      ]
    },
    {
      "id": "lang-bac-ha-noi",
      "name": "Lăng Chủ tịch Hồ Chí Minh",
      "location": "Hà Nội",
      "image": "assets/images/places/checkin-lang-bac-ha-noi.jpg",
      "description": "Công trình lịch sử quan trọng tưởng nhớ Chủ tịch Hồ Chí Minh, một biểu tượng thiêng liêng của dân tộc Việt Nam và là điểm đến không thể bỏ qua khi đến thủ đô Hà Nội",
      "customSection": {
        "title": "Chủ tịch Hồ Chí Minh - Người Cha già của Dân tộc",
        "content": "<div class=\"custom-section-item\">\n<div class=\"folk-song-description\">\n<h4>Thời niên thiếu và hành trình cứu nước</h4>\nChủ tịch Hồ Chí Minh (1890-1969), tên khai sinh là Nguyễn Sinh Cung, sau đổi thành Nguyễn Tất Thành và lấy tên Nguyễn Ái Quốc khi hoạt động cách mạng. Người sinh ra tại làng Kim Liên, huyện Nam Đàn, tỉnh Nghệ An trong một gia đình nhà nho yêu nước. Năm 1911, Người rời Bến cảng Nhà Rồng ra đi tìm đường cứu nước, trải qua 30 năm bôn ba khắp năm châu để tìm con đường giải phóng dân tộc.\n\n<h4>Sự nghiệp cách mạng</h4>\nNăm 1941, Người về nước trực tiếp lãnh đạo cách mạng Việt Nam. Ngày 2/9/1945, Người đọc bản Tuyên ngôn Độc lập khai sinh nước Việt Nam Dân chủ Cộng hòa. Trong suốt cuộc đời hoạt động cách mạng, Người luôn sống giản dị, cần kiệm và hết lòng vì nước, vì dân. Tư tưởng Hồ Chí Minh về độc lập dân tộc gắn liền với chủ nghĩa xã hội đã trở thành kim chỉ nam cho cách mạng Việt Nam.\n\n<h4>Di chúc và tình yêu thương vô bờ</h4>\nTrước khi đi xa, Người để lại bản Di chúc lịch sử với những lời căn dặn sâu sắc về xây dựng Đảng, chăm lo đời sống nhân dân và giáo dục thế hệ trẻ. Người mất ngày 2/9/1969, đúng vào ngày Quốc khánh - ngày vui lớn nhất của dân tộc. Theo Di chúc, thi hài Người được giữ gìn trong Lăng, nơi nhân dân cả nước có thể đến viếng và tưởng nhớ công ơn người cha già của dân tộc.\n\n<h4>Tấm gương đạo đức cách mạng</h4>\nCuộc đời và sự nghiệp của Chủ tịch Hồ Chí Minh là tấm gương sáng về đạo đức cách mạng: cần, kiệm, liêm, chính, chí công vô tư. Người sống giản dị trong căn nhà sàn đơn sơ, yêu thương chăm sóc thiếu nhi như người cha, người bác. Tư tưởng và tấm gương đạo đức của Người mãi mãi là di sản vô giá của dân tộc Việt Nam.</div>\n</div>"
      },
      "detailedDescription": "Lăng Chủ tịch Hồ Chí Minh là công trình kiến trúc đặc biệt nằm tại Quảng trường Ba Đình lịch sử, nơi lưu giữ thi hài của Chủ tịch Hồ Chí Minh. Công trình được khởi công xây dựng ngày 2/9/1973, hoàn thành ngày 29/8/1975, với sự giúp đỡ của các chuyên gia Liên Xô. Lăng được xây dựng bằng đá granite xám, có kiến trúc hình khối chữ nhật đơn giản nhưng trang nghiêm, uy nghi. Phía trước Lăng là Quảng trường Ba Đình rộng lớn, nơi Chủ tịch Hồ Chí Minh đã đọc bản Tuyên ngôn Độc lập khai sinh nước Việt Nam Dân chủ Cộng hòa vào ngày 2/9/1945. Hàng năm, Lăng đón tiếp hàng triệu lượt khách trong và ngoài nước đến viếng và tưởng nhớ vị lãnh tụ kính yêu của dân tộc Việt Nam.",
      "howToGet": "Lăng Bác nằm ở trung tâm Hà Nội, có thể đi bằng nhiều phương tiện công cộng hoặc taxi.",
      "bestTimeToVisit": "Lăng mở cửa vào buổi sáng từ 7h30-10h30 các ngày trong tuần trừ thứ 2 và thứ 6. Nên đến sớm để tránh phải xếp hàng lâu.",
      "attractions": {
        "historical": [
          {
            "name": "Lăng Chủ tịch",
            "description": "Nơi lưu giữ thi hài Bác Hồ, được xây dựng từ năm 1973, là công trình kiến trúc độc đáo với đá granite xám và các họa tiết trang trí tinh tế",
            "image": "assets/images/places/checkin-lang-bac-ha-noi.jpg"
          },
          {
            "name": "Quảng trường Ba Đình",
            "description": "Nơi diễn ra sự kiện lịch sử trọng đại - Chủ tịch Hồ Chí Minh đọc bản Tuyên ngôn Độc lập năm 1945",
            "image": "assets/images/places/quang-truong-ba-dinh.jpg"
          }
        ],
        "cultural": [
          {
            "name": "Nhà sàn Bác Hồ",
            "description": "Nơi Bác Hồ sống và làm việc từ năm 1958 đến 1969, được bảo tồn nguyên vẹn với kiến trúc đơn giản, gần gũi",
            "image": "assets/images/places/nha-san-bac-ho.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Phở Bát Đàn",
          "description": "Phở truyền thống Hà Nội với nước dùng đậm đà và thịt bò mềm",
          "image": "assets/images/foods/pho-bat-dan.jpg"
        },
        {
          "name": "Cà phê Giảng",
          "description": "Cà phê trứng nổi tiếng với công thức độc đáo từ những năm 1940",
          "image": "assets/images/foods/ca-phe-giang.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Bảo tàng Hồ Chí Minh",
          "description": "Nơi lưu giữ và trưng bày các hiện vật, tư liệu về cuộc đời và sự nghiệp của Chủ tịch Hồ Chí Minh",
          "distance": "0.2km",
          "travelTime": "5 phút đi bộ"
        },
        {
          "name": "Văn Miếu - Quốc Tử Giám",
          "description": "Trường đại học đầu tiên của Việt Nam, di tích lịch sử văn hóa quan trọng",
          "distance": "2km",
          "travelTime": "10 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Phở Bát Đàn",
          "description": "Phở bò truyền thống Hà Nội với nước dùng đặc biệt",
          "restaurant": "Phở Bát Đàn - 49 Bát Đàn",
          "price": "45000-60000 VND/bát"
        },
        {
          "name": "Cà phê trứng",
          "description": "Thức uống đặc trưng của Hà Nội",
          "restaurant": "Cà phê Giảng - 39 Nguyễn Hữu Huân",
          "price": "35000-45000 VND/ly"
        }
      ]
    },
    {
      "id": "chua-dia-tang-phi-lai",
      "name": "Chùa Địa Tạng Phi Lai",
      "location": "Hà Nam",
      "image": "assets/images/places/checkin-chua-dia-tang-phi-lai-ha-nam.jpg",
      "description": "Ngôi chùa cổ với kiến trúc độc đáo, một trong những trung tâm Phật giáo quan trọng của vùng đồng bằng Bắc Bộ, nơi hội tụ giữa tâm linh và nghệ thuật kiến trúc truyền thống",
      "detailedDescription": "Chùa Địa Tạng Phi Lai là một trong những ngôi chùa cổ nổi tiếng tại Hà Nam, được xây dựng từ thời nhà Lý với kiến trúc độc đáo và không gian thanh tịnh. Chùa nằm trên một ngọn núi thuộc dãy núi Phi Lai, từ đây có thể ngắm nhìn toàn cảnh vùng đồng bằng xung quanh. Công trình chùa được xây dựng theo kiến trúc chữ Công, với nhiều lớp mái uốn cong tinh tế, các đầu đao cong vút, tạo nên vẻ đẹp uy nghiêm nhưng không kém phần thanh thoát. Trong chùa còn lưu giữ nhiều tượng Phật cổ quý giá và các hiện vật lịch sử có giá trị. Hàng năm, chùa tổ chức nhiều lễ hội truyền thống, thu hút đông đảo Phật tử và du khách thập phương đến tham quan, chiêm bái.",
      "howToGet": "Từ Hà Nội, bạn có thể đi xe khách hoặc xe máy theo quốc lộ 1A về Hà Nam (khoảng 60km).",
      "bestTimeToVisit": "Có thể thăm chùa quanh năm, nhưng đẹp nhất là vào mùa xuân (tháng 1-3) khi thời tiết mát mẻ.",
      "attractions": {
        "religious": [
          {
            "name": "Chùa Địa Tạng",
            "description": "Ngôi chùa cổ với nhiều tượng Phật và di tích lịch sử, nổi bật với kiến trúc chữ Công độc đáo và các chi tiết chạm khắc tinh xảo",
            "image": "assets/images/places/checkin-chua-dia-tang-phi-lai-ha-nam.jpg"
          },
          {
            "name": "Tháp cổ",
            "description": "Tháp cổ thời Lý với kiến trúc độc đáo, nơi lưu giữ xá lợi Phật",
            "image": "assets/images/places/thap-co-dia-tang.jpg"
          }
        ],
        "natural": [
          {
            "name": "Núi Phi Lai",
            "description": "Dãy núi đá vôi hùng vĩ với nhiều hang động tự nhiên và cảnh quan đẹp",
            "image": "assets/images/places/nui-phi-lai.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Cơm cháy Ninh Bình",
          "description": "Món ăn đặc sản của vùng, được làm từ gạo địa phương với cách chế biến độc đáo",
          "image": "assets/images/foods/com-chay.jpg"
        },
        {
          "name": "Chè sen Hà Nam",
          "description": "Món tráng miệng truyền thống với hạt sen tươi và đường phèn",
          "image": "assets/images/foods/che-sen.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Khu di tích Đền Trúc",
          "description": "Di tích lịch sử văn hóa gắn với truyền thuyết và tín ngưỡng dân gian",
          "distance": "10km",
          "travelTime": "20 phút đi xe máy"
        },
        {
          "name": "Làng nghề gốm Bồ Bát",
          "description": "Làng nghề truyền thống với những sản phẩm gốm độc đáo",
          "distance": "15km",
          "travelTime": "30 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cơm cháy chà bông",
          "description": "Món ăn đặc trưng của vùng với cơm cháy giòn và chà bông thơm ngon",
          "restaurant": "Quán Cơm cháy Phi Lai - Gần chân núi",
          "price": "50000-70000 VND/phần"
        },
        {
          "name": "Chè sen long nhãn",
          "description": "Món tráng miệng thanh mát với hạt sen và long nhãn",
          "restaurant": "Quán chè Bà Cả - Đường vào chùa",
          "price": "25000-35000 VND/bát"
        }
      ]
    },
    {
      "id": "chua-dau-ha-noi",
      "name": "Chùa Dâu",
      "location": "Hà Nội",
      "image": "assets/images/places/checkin-chua-dau-ha-noi.jpg",
      "description": "Ngôi chùa cổ nhất miền Bắc, một trong tứ pháp linh thiêng của Phật giáo Việt Nam, nơi lưu giữ những giá trị văn hóa và kiến trúc độc đáo từ thời kỳ đầu Phật giáo du nhập",
      "detailedDescription": "Chùa Dâu, còn gọi là chùa Pháp Vân, là ngôi chùa cổ nhất miền Bắc Việt Nam, được xây dựng từ thế kỷ II. Đây là một trong tứ pháp - bốn ngôi chùa lớn thờ Tứ pháp (Pháp Vân, Pháp Vũ, Pháp Lôi, Pháp Điện), đại diện cho bốn hiện tượng tự nhiên: mây, mưa, sấm, chớp. Chùa mang đậm dấu ấn kiến trúc Phật giáo cổ với nhiều lớp mái chồng, các chi tiết chạm khắc tinh xảo và hệ thống tượng Phật độc đáo. Trong chùa còn lưu giữ nhiều hiện vật quý như tượng Tứ Pháp, chuông đồng cổ và các bia đá ghi chép lịch sử. Hàng năm, chùa tổ chức lễ hội truyền thống vào tháng Ba âm lịch, thu hút hàng nghìn người dân và du khách tham dự.",
      "howToGet": "Chùa nằm ở huyện Thuận Thành, Bắc Ninh, cách Hà Nội khoảng 30km. Có thể đi bằng xe máy hoặc ô tô theo quốc lộ 1A.",
      "bestTimeToVisit": "Thời điểm tốt nhất để thăm chùa là vào mùa xuân, đặc biệt là trong dịp lễ hội chùa Dâu (tháng 3-4 âm lịch).",
      "attractions": {
        "religious": [
          {
            "name": "Chùa Dâu",
            "description": "Ngôi chùa cổ với kiến trúc độc đáo và nhiều di tích lịch sử, nổi bật với tượng Tứ Pháp và hệ thống tượng Phật cổ",
            "image": "assets/images/places/checkin-chua-dau-ha-noi.jpg"
          },
          {
            "name": "Tháp Hòa Phong",
            "description": "Tháp cổ thời Lý với kiến trúc độc đáo, nơi lưu giữ xá lợi và các di vật Phật giáo quý giá",
            "image": "assets/images/places/thap-hoa-phong.jpg"
          }
        ],
        "cultural": [
          {
            "name": "Bảo tàng Phật giáo",
            "description": "Nơi trưng bày các hiện vật, tư liệu về lịch sử Phật giáo Việt Nam",
            "image": "assets/images/places/bao-tang-phat-giao.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Bánh phu thê",
          "description": "Bánh truyền thống của vùng Bắc Ninh, được làm từ gạo nếp và đậu xanh",
          "image": "assets/images/foods/banh-phu-the.jpg"
        },
        {
          "name": "Bánh tẻ",
          "description": "Món bánh dân gian đặc trưng của vùng đồng bằng Bắc Bộ",
          "image": "assets/images/foods/banh-te.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Đình Đình Bảng",
          "description": "Di tích kiến trúc nghệ thuật cấp quốc gia với những họa tiết chạm khắc tinh xảo",
          "distance": "5km",
          "travelTime": "15 phút đi xe máy"
        },
        {
          "name": "Làng quan họ Viêm Xá",
          "description": "Làng quan họ cổ với những làn điệu dân ca truyền thống",
          "distance": "8km",
          "travelTime": "20 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Bánh phu thê",
          "description": "Bánh truyền thống với nhân đậu xanh thơm ngon",
          "restaurant": "Cửa hàng bánh phu thê Bà Tới - Gần chùa",
          "price": "50000-100000 VND/hộp"
        },
        {
          "name": "Cơm chay",
          "description": "Bữa cơm chay thanh tịnh tại chùa",
          "restaurant": "Nhà hàng chay Tâm Phúc - Khuôn viên chùa",
          "price": "40000-60000 VND/suất"
        }
      ]
    },
    {
      "id": "nha-tho-do-nam-dinh",
      "name": "Nhà thờ Đổ Nam Định",
      "location": "Nam Định",
      "image": "assets/images/places/checkin-nha-tho-do-nam-dinh.jpg",
      "description": "Công trình kiến trúc Gothic độc đáo, một di tích lịch sử văn hóa đặc biệt của Nam Định, nơi ghi dấu những thăng trầm của lịch sử và là điểm check-in nổi tiếng với vẻ đẹp hoang tàn nhưng lãng mạn",
      "customSection": {
        "title": "Lịch sử Nhà thờ Đổ Nam Định",
        "content": "<div class=\"folk-song-container\">\n<div class=\"folk-song-description\">\nNhà thờ Đổ Nam Định, còn được gọi là nhà thờ Trái tim Chúa hay nhà thờ Hải Lý, là một công trình kiến trúc Gothic độc đáo nằm trên bãi biển Xương Điền, xã Hải Lý, huyện Hải Hậu, cách thành phố Nam Định khoảng 40km.\n\nĐược xây dựng vào năm 1943 bởi một kiến trúc sư người Pháp, nhà thờ ban đầu là một phần của quần thể gồm nhiều công trình nhà thờ lớn nhỏ trong khu vực. Tuy nhiên, đến năm 1996, do sự xâm thực của biển vào đất liền, dải đất ven biển bị ảnh hưởng nghiêm trọng, dẫn đến tình trạng đổ nát của công trình.\n\nNgày nay, dù đã bị tàn phá bởi thời gian và thiên nhiên, nhưng những mảng tường đổ nát và khung cảnh hoang tàn lại tạo nên một vẻ đẹp đặc biệt, thu hút nhiều du khách trong và ngoài nước đến tham quan và chiêm ngưỡng. Nhà thờ Đổ đã trở thành một biểu tượng của sự giao thoa văn hóa Đông - Tây và là điểm đến yêu thích của giới trẻ và các nhiếp ảnh gia.</div>\n</div>"
      },
      "detailedDescription": "Nhà thờ Đổ Nam Định là một công trình kiến trúc Gothic độc đáo, được xây dựng từ thời Pháp thuộc vào cuối thế kỷ XIX. Công trình mang đậm phong cách kiến trúc Gothic châu Âu với những đường nét cao vút, các cửa sổ hình vòm và những họa tiết trang trí tinh xảo. Dù đã bị tàn phá nặng nề trong chiến tranh, nhưng những mảng tường đổ nát và khung cảnh hoang tàn lại tạo nên một vẻ đẹp đặc biệt, thu hút nhiều người đến tham quan và chụp ảnh. Nhà thờ không chỉ là một di tích lịch sử mà còn là biểu tượng của sự giao thoa văn hóa Đông - Tây và là điểm đến yêu thích của giới trẻ và các nhiếp ảnh gia.",
      "howToGet": "Từ Hà Nội đi xe khách hoặc tàu hỏa đến Nam Định (khoảng 90km). Nhà thờ nằm ở trung tâm thành phố Nam Định.",
      "bestTimeToVisit": "Có thể tham quan quanh năm, đẹp nhất vào buổi sáng sớm hoặc chiều tà khi ánh nắng tạo nên những góc chụp ảnh đẹp.",
      "attractions": {
        "historical": [
          {
            "name": "Nhà thờ Đổ",
            "description": "Công trình kiến trúc Gothic cổ với những mảng tường đổ nát tạo nên vẻ đẹp hoang sơ, là điểm chụp ảnh lý tưởng với kiến trúc độc đáo",
            "image": "assets/images/places/checkin-nha-tho-do-nam-dinh.jpg"
          },
          {
            "name": "Khu vực tháp chuông",
            "description": "Phần còn sót lại của tháp chuông cổ với kiến trúc Gothic đặc trưng",
            "image": "assets/images/places/thap-chuong-nha-tho-do.jpg"
          }
        ],
        "architectural": [
          {
            "name": "Cổng chính",
            "description": "Cổng vòm Gothic với những họa tiết chạm khắc tinh xảo còn sót lại",
            "image": "assets/images/places/cong-nha-tho-do.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Phở bò Nam Định",
          "description": "Món phở truyền thống nổi tiếng của Nam Định với nước dùng đặc biệt",
          "image": "assets/images/foods/pho-nam-dinh.jpg"
        },
        {
          "name": "Bún đũa",
          "description": "Món ăn đặc trưng của Nam Định với sợi bún dài và nước dùng thơm ngon",
          "image": "assets/images/foods/bun-dua.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Chợ Rồng",
          "description": "Khu chợ truyền thống lớn nhất Nam Định, nơi bán nhiều đặc sản địa phương",
          "distance": "1km",
          "travelTime": "5 phút đi xe máy"
        },
        {
          "name": "Đền Trần",
          "description": "Di tích lịch sử văn hóa thờ các vua nhà Trần",
          "distance": "3km",
          "travelTime": "10 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Phở bò Nam Định",
          "description": "Phở truyền thống với thịt bò mềm và nước dùng đặc trưng",
          "restaurant": "Phở Bò Việt - Gần nhà thờ",
          "price": "35000-50000 VND/bát"
        },
        {
          "name": "Bún đũa Nam Định",
          "description": "Món bún đặc sản với nước dùng thơm ngon",
          "restaurant": "Quán Bún Đũa Cô Loan - Phố Trần Hưng Đạo",
          "price": "30000-40000 VND/bát"
        }
      ]
    },
    {
      "id": "hung-yen",
      "name": "Hưng Yên",
      "location": "Hưng Yên",
      "image": "assets/images/places/checkin-hung-yen.jpg",
      "description": "Tỉnh Hưng Yên nằm ở đồng bằng sông Hồng, nổi tiếng với Phố Hiến cổ kính - từng được mệnh danh là 'Tiểu Quảng Châu', và đặc sản nhãn lồng thơm ngọt đệ nhất. Đây là vùng đất giàu truyền thống văn hóa với nhiều di tích lịch sử và làng nghề truyền thống.",
      "detailedDescription": "Hưng Yên là tỉnh có vị trí địa lý quan trọng ở đồng bằng sông Hồng, từ lâu đã nổi tiếng với Phố Hiến cổ - một trong những thương cảng sầm uất nhất Đàng Ngoài thế kỷ XVII-XVIII. Tỉnh này không chỉ được biết đến với đặc sản nhãn lồng 'đệ nhất' mà còn lưu giữ nhiều giá trị văn hóa, lịch sử quý báu qua các di tích như đền Mẫu, chùa Chuông, đền Trần, và văn miếu Xích Đằng. Các làng nghề truyền thống như làm tương Bần, dệt lụa vẫn được duy trì và phát triển đến ngày nay.",
      "howToGet": "Từ Hà Nội đến Hưng Yên (khoảng 60-70km): Đi ô tô/xe máy theo đường cao tốc Hà Nội - Hải Phòng (CT.04) hoặc QL5, sau đó rẽ vào đường 39 đến TP Hưng Yên. Xe khách khởi hành từ bến Giáp Bát, Mỹ Đình, Yên Nghĩa, giá vé 60.000-80.000đ/lượt.",
      "bestTimeToVisit": "Quanh năm đều thích hợp, đặc biệt mùa nhãn chín (tháng 7-8 Âm lịch) để thưởng thức đặc sản nhãn lồng tươi ngon nhất.",
      "customSection": {
        "title": "Giới thiệu về Phố Hiến",
        "content": "Phố Hiến là một đô thị cổ nổi tiếng, nằm tại thành phố Hưng Yên, ven sông Hồng. Vào thế kỷ 16–17, nơi đây từng là một thương cảng quốc tế sầm uất, chỉ sau kinh thành Thăng Long, với câu nói nổi tiếng:\n\n\"Thứ nhất kinh kỳ, thứ nhì Phố Hiến.\"\n\nPhố Hiến từng là nơi giao thương nhộn nhịp, đón tiếp thương nhân từ Trung Quốc, Nhật Bản, Hà Lan… Không chỉ phát triển về kinh tế, nơi đây còn là trung tâm văn hóa – tôn giáo đa dạng với hơn 60 di tích lịch sử được bảo tồn, như: đền Mẫu, chùa Chuông, Văn Miếu Xích Đằng...\n\nNgày nay, Phố Hiến vẫn lưu giữ vẻ cổ kính, trầm mặc của một thời vang bóng, là điểm đến hấp dẫn cho những ai yêu thích khám phá lịch sử, văn hóa và kiến trúc truyền thống Việt Nam."
      },
      "attractions": {
        "historical": [
          {
            "name": "Phố Hiến",
            "description": "Khu phố cổ với nhiều công trình kiến trúc và di tích lịch sử, minh chứng cho sự phồn thịnh của một thương cảng xưa",
            "image": "assets/images/places/checkin-hung-yen.jpg"
          },
          {
            "name": "Văn miếu Xích Đằng",
            "description": "Công trình kiến trúc cổ thờ Khổng Tử và các bậc hiền triết",
            "image": "assets/images/places/van-mieu-xich-dang.jpg"
          }
        ],
        "cultural": [
          {
            "name": "Chùa Chuông",
            "description": "Ngôi chùa cổ với kiến trúc độc đáo và nhiều di vật quý",
            "image": "assets/images/places/chua-chuong.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Nhãn lồng Hưng Yên",
          "description": "Đặc sản nổi tiếng với vị ngọt thanh, thơm và múi to",
          "image": "assets/images/foods/nhan-long.jpg"
        },
        {
          "name": "Tương Bần",
          "description": "Loại tương truyền thống được làm theo bí quyết riêng của làng nghề Bần",
          "image": "assets/images/foods/tuong-ban.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Làng nghề tương Bần",
          "description": "Làng nghề truyền thống nổi tiếng với nghề làm tương đen thơm ngon",
          "distance": "7km",
          "travelTime": "15 phút đi xe máy"
        },
        {
          "name": "Vườn nhãn Hưng Yên",
          "description": "Vườn nhãn lồng nổi tiếng với những cây nhãn cổ thụ hàng trăm năm tuổi",
          "distance": "3km",
          "travelTime": "10 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Nhãn lồng Hưng Yên",
          "description": "Được mệnh danh là 'đệ nhất nhãn', nhãn lồng Hưng Yên nổi bật bởi cùi dày, hạt nhỏ, vị ngọt thơm đặc biệt. Mùa nhãn rơi vào khoảng tháng 7-8 Âm lịch",
          "restaurant": "Vườn nhãn các huyện Hưng Yên",
          "price": "50000-80000 VND/kg"
        },
        {
          "name": "Cá mòi kho",
          "description": "Món cá kho nổi tiếng vùng sông Hồng, thịt cá thơm béo, mềm rục, ăn với cơm trắng rất ngon",
          "restaurant": "Các quán ăn địa phương",
          "price": "60000-80000 VND/phần"
        },
        {
          "name": "Bún thang lươn",
          "description": "Biến tấu độc đáo từ bún thang Hà Nội, dùng lươn đồng chế biến cầu kỳ, tạo nên hương vị riêng biệt",
          "restaurant": "Quán bún thang cô Hương",
          "price": "45000-60000 VND/tô"
        },
        {
          "name": "Tương Bần",
          "description": "Đặc sản nổi tiếng lâu đời, tương có vị ngọt mặn hài hòa, dùng chấm rau luộc, thịt luộc, rất 'bắt vị'",
          "restaurant": "Làng nghề tương Bần",
          "price": "100000-150000 VND/kg"
        },
        {
          "name": "Chè sen long nhãn",
          "description": "Món chè ngọt mát với hạt sen tươi và nhãn lồng Hưng Yên, đặc biệt thơm ngon vào mùa hè",
          "restaurant": "Các quán chè truyền thống",
          "price": "25000-35000 VND/tô"
        }
      ]
    },
    {
      "id": "bac-ninh",
      "name": "Thành phố Bắc Ninh",
      "location": "Bắc Ninh",
      "image": "assets/images/places/checkin-bac-ninh.jpg",
      "description": "Kinh đô quan họ với nhiều di sản văn hóa phi vật thể độc đáo, nơi hội tụ của những làn điệu dân ca truyền thống và là cái nôi của văn hóa dân gian Bắc Bộ, được ca ngợi trong MV 'Bắc Bling' của Hòa Minzy",
      "detailedDescription": "Bắc Ninh, vùng đất được mệnh danh là kinh đô quan họ, là nơi sinh thành và phát triển của dân ca quan họ - di sản văn hóa phi vật thể được UNESCO công nhận. Thành phố không chỉ nổi tiếng với những làn điệu quan họ ngọt ngào mà còn là nơi lưu giữ nhiều di tích lịch sử văn hóa quan trọng như đền Đô, chùa Phật Tích, đình Đình Bảng. Bắc Ninh còn là quê hương của nhiều làng nghề truyền thống như tranh dân gian Đông Hồ, gốm Phù Lãng, tơ tằm Hồ. Đặc biệt, Bắc Ninh đã trở thành nổi tiếng hơn khi được ca ngợi trong MV 'Bắc Bling' của ca sĩ Hòa Minzy, giúp quảng bá vẻ đẹp văn hóa và con người nơi đây đến với giới trẻ cả nước. Vào mùa xuân, Bắc Ninh trở thành điểm đến hấp dẫn với nhiều lễ hội truyền thống, trong đó nổi bật nhất là lễ hội quan họ, nơi du khách có thể thưởng thức những làn điệu quan họ đặc sắc và tìm hiểu về nét văn hóa độc đáo của vùng đất này.",
      "howToGet": "Từ Hà Nội đi xe buýt hoặc xe khách theo quốc lộ 1 (khoảng 30km). Có thể đi xe buýt số 18 từ bến xe Gia Lâm hoặc tàu điện đô thị Metro Nhổn - ga Hà Nội.",
      "bestTimeToVisit": "Thời điểm lý tưởng để thăm Bắc Ninh là vào mùa xuân, đặc biệt là dịp lễ hội quan họ (tháng 2-3 âm lịch). Thời tiết mát mẻ và có nhiều hoạt động văn hóa truyền thống. Mùa thu (tháng 9-11) cũng rất đẹp với khí hậu dễ chịu.",
      "attractions": {
        "cultural": [
          {
            "name": "Làng quan họ Lim",
            "description": "Nơi bảo tồn và phát triển nghệ thuật dân ca quan họ, được Hòa Minzy ca ngợi trong MV 'Bắc Bling', với những liền anh, liền chị nổi tiếng và các hoạt động văn hóa đặc sắc",
            "image": "assets/images/places/lang-quan-ho-lim.jpg"
          },
          {
            "name": "Làng tranh Đông Hồ",
            "description": "Làng nghề truyền thống nổi tiếng với nghề làm tranh dân gian bằng giấy dó và màu tự nhiên, một trong những điểm check-in hot sau MV 'Bắc Bling'",
            "image": "assets/images/places/lang-tranh-dong-ho.jpg"
          },
          {
            "name": "Đình Đình Bảng",
            "description": "Di tích kiến trúc nghệ thuật cấp quốc gia với những họa tiết chạm khắc tinh xảo, thể hiện nghệ thuật điêu khắc Việt Nam thời phong kiến",
            "image": "assets/images/places/dinh-dinh-bang.jpg"
          }
        ],
        "historical": [
          {
            "name": "Đền Đô",
            "description": "Di tích lịch sử quan trọng thờ các vua nhà Lý, với kiến trúc độc đáo và nhiều hiện vật quý, là nơi thể hiện lịch sử hào hùng của đất Kinh Bắc",
            "image": "assets/images/places/den-do.jpg"
          },
          {
            "name": "Chùa Dâu",
            "description": "Ngôi chùa cổ nhất miền Bắc, một trong tứ pháp thiêng liêng của Phật giáo Việt Nam với lịch sử hơn 2000 năm",
            "image": "assets/images/places/chua-dau.jpg"
          }
        ],
        "entertainment": [
          {
            "name": "Bối cảnh MV Bắc Bling",
            "description": "Các địa điểm quay MV 'Bắc Bling' của Hòa Minzy, bao gồm làng quan họ Lim, đình Đình Bảng và các khu vực văn hóa đặc trưng",
            "image": "assets/images/places/mv-bac-bling-locations.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Tương Đình Tổ",
          "description": "Đặc sản nổi tiếng của Bắc Ninh, loại tương đen thơm ngon được làm theo công thức truyền thống từ làng nghề Đình Tổ",
          "image": "assets/images/foods/tuong-dinh-to.jpg"
        },
        {
          "name": "Rượu làng Vân",
          "description": "Đặc sản rượu truyền thống của Bắc Ninh, được chưng cất theo phương pháp cổ truyền với hương vị đặc trưng",
          "image": "assets/images/foods/ruou-lang-van.jpg"
        },
        {
          "name": "Bánh phu thê",
          "description": "Bánh truyền thống của Bắc Ninh, biểu tượng cho tình nghĩa vợ chồng, với vị ngọt thanh và nhân đậu xanh thơm ngon",
          "image": "assets/images/foods/banh-phu-the.jpg"
        },
        {
          "name": "Bánh gai Tứ Kỳ",
          "description": "Đặc sản nổi tiếng làm từ lá gai, với màu đen đặc trưng và hương vị độc đáo",
          "image": "assets/images/foods/banh-gai.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Chùa Phật Tích",
          "description": "Ngôi chùa cổ trên núi Phật Tích với tượng phật cổ và cảnh quan đẹp",
          "distance": "15km",
          "travelTime": "30 phút đi xe máy"
        },
        {
          "name": "Làng gốm Phù Lãng",
          "description": "Làng nghề gốm truyền thống với những sản phẩm gốm độc đáo",
          "distance": "20km",
          "travelTime": "40 phút đi xe máy"
        },
        {
          "name": "Làng Vân",
          "description": "Làng nghề làm rượu truyền thống nổi tiếng với rượu làng Vân",
          "distance": "12km",
          "travelTime": "25 phút đi xe máy"
        },
        {
          "name": "Làng Đình Tổ",
          "description": "Làng nghề làm tương truyền thống với đặc sản tương Đình Tổ nổi tiếng",
          "distance": "8km",
          "travelTime": "20 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Nem làng Bùi",
          "description": "Món ăn nên thử với nem cuốn thơm ngon, đặc trưng của làng nghề Bùi",
          "restaurant": "Quán nem làng Bùi - Làng Bùi, Quế Võ",
          "price": "50000-80000 VND/phần"
        },
        {
          "name": "Bánh phu thê",
          "description": "Bánh truyền thống với nhân đậu xanh thơm ngon",
          "restaurant": "Tiệm bánh Bà Tới - Phố Văn",
          "price": "50000-100000 VND/hộp"
        },
        {
          "name": "Tương Đình Tổ",
          "description": "Đặc sản tương đen thơm ngon, có thể mua làm quà",
          "restaurant": "Làng nghề Đình Tổ - Thuận Thành",
          "price": "80000-150000 VND/chai"
        },
        {
          "name": "Bún thang Bắc Ninh",
          "description": "Món bún đặc trưng với nhiều loại rau thơm và nước dùng đậm đà",
          "restaurant": "Quán Bún thang cô Hương - Phố Huyền Quang",
          "price": "35000-50000 VND/bát"
        },
        {
          "name": "Rượu làng Vân",
          "description": "Rượu truyền thống với độ cồn vừa phải, thích hợp làm quà tặng",
          "restaurant": "Cơ sở sản xuất làng Vân - Tiên Du",
          "price": "200000-400000 VND/chai"
        }
      ]
    },
    {
      "id": "bac-giang",
      "name": "Thành phố Bắc Giang",
      "location": "Bắc Giang",
      "image": "assets/images/places/checkin-bac-giang.jpg",
      "description": "Vùng đất của vải thiều và di tích lịch sử, nơi hội tụ giữa nông nghiệp đặc sản và văn hóa truyền thống, với những thắng cảnh thiên nhiên tuyệt đẹp của vùng Đông Bắc",
      "detailedDescription": "Bắc Giang là vùng đất nổi tiếng với vải thiều Lục Ngạn - một trong những đặc sản nổi tiếng nhất Việt Nam. Không chỉ có vải thiều, Bắc Giang còn là nơi có nhiều di tích lịch sử văn hóa quan trọng như chùa Vĩnh Nghiêm - một trong những trung tâm Phật giáo lớn thời Trần, đền thờ Hoàng Vân - di tích gắn liền với cuộc khởi nghĩa Yên Thế. Cảnh quan thiên nhiên nơi đây đặc biệt đẹp với những dãy núi và thung lũng xanh tươi, đặc biệt là khu vực Tây Yên Tử với những cánh rừng nguyên sinh và các ngôi chùa cổ. Vào mùa vải (tháng 5-7), Bắc Giang trở thành điểm đến hấp dẫn với những vườn vải bạt ngàn và không khí nhộn nhịp của mùa thu hoạch.",
      "howToGet": "Từ Hà Nội đi xe khách hoặc xe máy theo quốc lộ 1A (khoảng 50km).",
      "bestTimeToVisit": "Thời điểm đẹp nhất là mùa vải (tháng 5-7) để thưởng thức vải thiều tươi ngon và tham quan vườn vải. Mùa xuân (tháng 1-3) cũng là thời điểm lý tưởng với nhiều lễ hội truyền thống.",
      "attractions": {
        "natural": [
          {
            "name": "Vườn vải Lục Ngạn",
            "description": "Vùng trồng vải nổi tiếng của cả nước, với những đồi vải bạt ngàn và truyền thống canh tác lâu đời",
            "image": "assets/images/places/vuon-vai-luc-ngan.jpg"
          },
          {
            "name": "Khu du lịch Tây Yên Tử",
            "description": "Khu vực núi non hùng vĩ với rừng nguyên sinh và các di tích Phật giáo",
            "image": "assets/images/places/tay-yen-tu.jpg"
          }
        ],
        "historical": [
          {
            "name": "Chùa Vĩnh Nghiêm",
            "description": "Trung tâm Phật giáo lớn thời Trần với kiến trúc độc đáo và nhiều di vật quý",
            "image": "assets/images/places/chua-vinh-nghiem.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Vải thiều Lục Ngạn",
          "description": "Đặc sản nổi tiếng với vị ngọt thanh, thơm và giòn",
          "image": "assets/images/foods/vai-thieu.jpg"
        },
        {
          "name": "Bánh đa Kế",
          "description": "Bánh đa truyền thống với hương vị đặc trưng của làng nghề Kế",
          "image": "assets/images/foods/banh-da-ke.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Khu di tích Yên Thế",
          "description": "Di tích lịch sử gắn liền với cuộc khởi nghĩa Yên Thế của nghĩa quân Hoàng Hoa Thám",
          "distance": "30km",
          "travelTime": "45 phút đi xe máy"
        },
        {
          "name": "Suối Mỡ",
          "description": "Khu du lịch sinh thái với thác nước và không gian xanh mát",
          "distance": "15km",
          "travelTime": "25 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cơm gà Bắc Giang",
          "description": "Món cơm gà đặc trưng với gà thả vườn và gạo địa phương",
          "restaurant": "Quán cơm gà Hương - Phố Hoàng Văn Thụ",
          "price": "45000-70000 VND/phần"
        },
        {
          "name": "Bánh đa Kế",
          "description": "Bánh đa truyền thống được làm thủ công",
          "restaurant": "Cửa hàng đặc sản Bắc Giang - Chợ trung tâm",
          "price": "20000-30000 VND/gói"
        }
      ]
    },
    {
      "id": "lang-son",
      "name": "Thành phố Lạng Sơn",
      "location": "Lạng Sơn",
      "image": "assets/images/places/checkin-lang-son.jpg",
      "description": "Thành phố biên giới với nhiều danh thắng, nơi giao thoa văn hóa Việt - Hoa độc đáo, với những hang động kỳ thú và di tích lịch sử quan trọng của vùng biên cương Tổ quốc",
      "detailedDescription": "Lạng Sơn là thành phố biên giới nằm ở cửa ngõ phía Bắc của Tổ quốc, nơi hội tụ những nét văn hóa độc đáo của người Việt, Tày, Nùng và ảnh hưởng văn hóa Trung Hoa. Thành phố nổi tiếng với quần thể hang động Tam Thanh - Nhị Thanh, núi Tô Thị gắn với truyền thuyết về tình mẫu tử, và đền Kỳ Cùng - trung tâm tâm linh quan trọng của vùng. Chợ Đông Kinh sầm uất là điểm đến không thể bỏ qua, nơi tập trung nhiều mặt hàng đặc sắc và ẩm thực đa dạng. Thành phố còn lưu giữ nhiều di tích lịch sử quan trọng như thành nhà Mạc, cửa khẩu Hữu Nghị - điểm giao thương quốc tế sôi động. Cảnh quan thiên nhiên nơi đây đặc biệt đẹp với những dãy núi đá vôi hùng vĩ và thung lũng xanh tươi.",
      "howToGet": "Từ Hà Nội đi xe khách hoặc tàu hỏa (khoảng 150km). Có nhiều chuyến xe khách và tàu chạy hàng ngày từ Hà Nội đến Lạng Sơn.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là mùa thu (tháng 9-11) khi thời tiết mát mẻ, trong trẻo hoặc mùa xuân (tháng 2-4) để tham dự các lễ hội truyền thống.",
      "attractions": {
        "natural": [
          {
            "name": "Núi Tô Thị",
            "description": "Danh thắng gắn với truyền thuyết về tình mẫu tử, điểm ngắm cảnh lý tưởng của thành phố",
            "image": "assets/images/places/nui-to-thi.jpg"
          },
          {
            "name": "Động Tam Thanh",
            "description": "Hang động tự nhiên với nhiều nhũ đá độc đáo và truyền thuyết lịch sử",
            "image": "assets/images/places/dong-tam-thanh.jpg"
          }
        ],
        "cultural": [
          {
            "name": "Chợ Đông Kinh",
            "description": "Khu chợ truyền thống sầm uất với nhiều mặt hàng đặc trưng vùng biên giới",
            "image": "assets/images/places/cho-dong-kinh.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Vịt quay Lạng Sơn",
          "description": "Món ăn đặc sản nổi tiếng với cách chế biến độc đáo và hương vị thơm ngon",
          "image": "assets/images/foods/vit-quay-lang-son.jpg"
        },
        {
          "name": "Phở chua Lạng Sơn",
          "description": "Món phở đặc trưng của vùng với vị chua thanh và nước dùng đặc biệt",
          "image": "assets/images/foods/pho-chua.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Cửa khẩu Hữu Nghị",
          "description": "Cửa khẩu quốc tế quan trọng giữa Việt Nam và Trung Quốc",
          "distance": "20km",
          "travelTime": "30 phút đi xe máy"
        },
        {
          "name": "Thành nhà Mạc",
          "description": "Di tích lịch sử thời nhà Mạc với kiến trúc cổ",
          "distance": "5km",
          "travelTime": "15 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Vịt quay Lạng Sơn",
          "description": "Vịt quay truyền thống với da giòn và thịt mềm",
          "restaurant": "Nhà hàng Vịt quay Kỳ Cùng - Phố Kỳ Lừa",
          "price": "250000-300000 VND/con"
        },
        {
          "name": "Phở chua",
          "description": "Phở đặc sản với vị chua đặc trưng",
          "restaurant": "Quán phở chua Bà Hằng - Phố Tam Thanh",
          "price": "35000-45000 VND/bát"
        }
      ]
    },
    {
      "id": "con-dao",
      "name": "Côn Đảo",
      "location": "Bà Rịa - Vũng Tàu",
      "image": "assets/images/places/checkin_con-dao-hcm.png",
      "description": "Quần đảo thiên đường với vẻ đẹp hoang sơ và lịch sử anh hùng, nơi hội tụ giữa những bãi biển tuyệt đẹp và di tích lịch sử đầy ý nghĩa của dân tộc",
      "customSection": {
        "title": "Võ Thị Sáu - Nữ Anh Hùng Tuổi 19",
        "content": "Võ Thị Sáu (1933-1952) là một trong những biểu tượng anh hùng của Côn Đảo và cách mạng Việt Nam. Sinh ra tại huyện Đất Đỏ, tỉnh Bà Rịa - Vũng Tàu, chị tham gia cách mạng từ khi mới 14 tuổi. Năm 1950, ở tuổi 17, chị bị thực dân Pháp bắt và kết án tử hình vì hai lần ném lựu đạn vào đồn địch. Tại nhà tù Côn Đảo, dù bị tra tấn dã man, chị vẫn giữ khí tiết cách mạng, không khuất phục. Đêm trước khi hy sinh, chị đã hát vang những bài ca cách mạng, truyền lửa đấu tranh cho đồng đội. Ngày 23/1/1952, chị hy sinh anh dũng tại pháp trường Côn Đảo, để lại hình ảnh một nữ anh hùng trẻ tuổi kiên cường. Ngày nay, mộ chị tại Nghĩa trang Hàng Dương luôn tấp nập người đến viếng, với những bông hoa tươi và nén nhang thơm, tưởng nhớ người con gái anh hùng đã hiến dâng tuổi xuân cho Tổ quốc."
      },
      "detailedDescription": "Côn Đảo là quần đảo gồm 16 hòn đảo lớn nhỏ nằm ở phía Nam Việt Nam, thuộc tỉnh Bà Rịa - Vũng Tàu. Nơi đây không chỉ nổi tiếng với vẻ đẹp thiên nhiên hoang sơ, những bãi biển trong xanh mà còn là vùng đất thiêng gắn liền với lịch sử đấu tranh anh dũng của dân tộc. Côn Đảo từng là nhà tù khét tiếng thời Pháp thuộc và Mỹ - Diệm, nơi giam giữ hàng nghìn chiến sĩ cách mạng và người yêu nước. Ngày nay, Côn Đảo đã trở thành điểm du lịch hấp dẫn với hệ sinh thái biển đa dạng, rừng nguyên sinh còn nguyên vẹn và những bãi biển đẹp như Đầm Trầu, An Hải. Du khách đến đây không chỉ được tận hưởng không gian biển xanh, cát trắng mà còn được tìm hiểu về lịch sử hào hùng và chiêm bái những anh hùng liệt sĩ đã hy sinh cho Tổ quốc.",
      "howToGet": "Từ TP.HCM có thể đi máy bay (45 phút bay) hoặc đi tàu cao tốc từ Vũng Tàu (2.5 giờ). Từ Hà Nội có chuyến bay trực tiếp đến Côn Đảo.",
      "bestTimeToVisit": "Thời điểm lý tưởng là từ tháng 11 đến tháng 4 năm sau khi thời tiết mát mẻ, ít mưa bão. Tránh mùa mưa từ tháng 5-10.",
      "attractions": {
        "historical": [
          {
            "name": "Nhà tù Côn Đảo",
            "description": "Di tích lịch sử quan trọng, nơi giam giữ các chiến sĩ cách mạng với những câu chuyện đau thương nhưng anh dũng",
            "image": "assets/images/places/nha-tu-con-dao.jpg"
          },
          {
            "name": "Nghĩa trang Hàng Dương",
            "description": "Nơi an nghỉ của hàng nghìn liệt sĩ, trong đó có mộ Võ Thị Sáu - biểu tượng của lòng yêu nước",
            "image": "assets/images/places/nghia-trang-hang-duong.jpg"
          }
        ],
        "natural": [
          {
            "name": "Biển An Hải",
            "description": "Bãi biển tuyệt đẹp với cát trắng mịn, nước biển trong xanh và cảnh quan thiên nhiên hoang sơ",
            "image": "assets/images/places/bien-an-hai.jpg"
          }
        ],
        "cultural": [
          {
            "name": "Miếu bà Phi Yến",
            "description": "Ngôi miếu linh thiêng thờ bà Phi Yến, nơi tâm linh quan trọng của người dân địa phương",
            "image": "assets/images/places/mieu-ba-phi-yen.jpg"
          },
          {
            "name": "Miếu cậu cải",
            "description": "Công trình tâm linh độc đáo với kiến trúc truyền thống và ý nghĩa văn hóa sâu sắc",
            "image": "assets/images/places/mieu-cau-cai.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Mứt bàng",
          "description": "Đặc sản địa phương được làm từ quả bàng, có vị ngọt thanh đặc trưng của Côn Đảo",
          "image": "assets/images/foods/mut-bang.jpg"
        },
        {
          "name": "Kem dừa",
          "description": "Đặc sản địa phương với vị ngọt mát, được làm từ dừa tươi của đảo",
          "image": "assets/images/foods/kem-dua.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Hòn Bà",
          "description": "Hòn đảo nhỏ với đình thờ bà và cảnh quan thiên nhiên tuyệt đẹp",
          "distance": "3km",
          "travelTime": "15 phút đi cano"
        },
        {
          "name": "Hòn Cau",
          "description": "Điểm lặn ngắm san hô lý tưởng với hệ sinh thái biển phong phú",
          "distance": "5km",
          "travelTime": "20 phút đi cano"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cua mặt trăng",
          "description": "Món ăn đặc sản nổi tiếng với thịt cua ngọt thơm, tươi sống",
          "restaurant": "Các quán gần chợ đêm Côn Đảo",
          "price": "400000-600000 VND/kg"
        },
        {
          "name": "Cá mú đỏ",
          "description": "Cá tươi ngon được chế biến thành lẩu với nước dùng đậm đà",
          "restaurant": "Quán lẩu Tri Kỷ",
          "price": "300000-500000 VND/kg"
        },
        {
          "name": "Bún riêu",
          "description": "Bún riêu truyền thống với nước dùng đậm đà và cua đồng thơm ngon",
          "restaurant": "Quán bà hai khiêm",
          "price": "50000-70000 VND/bát"
        }
      ]
    },
    {
      "id": "cho-ky-lua-lang-son",
      "name": "Chợ Kỳ Lừa",
      "location": "Lạng Sơn",
      "image": "assets/images/places/checkin-cho-ky-lua-lang-son.jpg",
      "description": "Khu chợ truyền thống nổi tiếng của vùng biên giới, trung tâm thương mại sầm uất bậc nhất của Lạng Sơn, nơi hội tụ văn hóa ẩm thực và mua sắm độc đáo của vùng Đông Bắc",
      "detailedDescription": "Chợ Kỳ Lừa là một trong những khu chợ lớn nhất và nổi tiếng nhất tại Lạng Sơn, có lịch sử hình thành từ thế kỷ XIX. Đây là trung tâm thương mại sầm uất, nơi tập trung đa dạng các mặt hàng từ đặc sản địa phương đến hàng hóa nhập khẩu từ Trung Quốc. Chợ được chia thành nhiều khu vực chuyên biệt như khu bán đồ khô, khu hàng thời trang, khu ẩm thực với những món ăn đặc trưng của vùng biên giới. Đặc biệt, tại đây du khách có thể tìm thấy những sản phẩm độc đáo như vịt quay Lạng Sơn, hoa quả theo mùa, các loại thảo dược và đồ lưu niệm mang đậm bản sắc vùng Đông Bắc.",
      "customSection": {
        "title": "Kỳ Lừa là gì?",
        "content": "<div class=\"folk-song-container\">\n<div class=\"folk-song-verse\">\n\"Đồng Đăng có phố Kỳ Lừa<br/>Có nàng Tô Thị, có chùa Tam Thanh\"\n</div>\n<div class=\"folk-song-description\">\nĐây là câu ca dao nổi tiếng về vùng đất Lạng Sơn, trong đó Phố Kỳ Lừa - nơi có chợ Kỳ Lừa sầm uất - được nhắc đến như một biểu tượng văn hóa, thương mại của vùng biên ải. Câu ca dao không chỉ đơn thuần là sự miêu tả địa danh mà còn thể hiện sự gắn kết giữa thương mại (Phố Kỳ Lừa), văn hóa tâm linh (chùa Tam Thanh) và truyền thuyết dân gian (tượng Tô Thị) của vùng đất này. Phố Kỳ Lừa từ xưa đã là trung tâm giao thương sầm uất, nơi hội tụ các nền văn hóa, là cửa ngõ thông thương quan trọng giữa Việt Nam và Trung Quốc."
      },
      "howToGet": "Chợ nằm ở trung tâm thành phố Lạng Sơn, dễ dàng di chuyển bằng xe máy hoặc taxi. Từ bến xe Lạng Sơn đi khoảng 2km.",
      "bestTimeToVisit": "Chợ họp từ sáng sớm đến chiều tối, nhưng sầm uất nhất là vào buổi sáng từ 6h-11h. Nên đến sớm để mua được hàng tươi ngon và tránh đông đúc.",
      "attractions": {
        "shopping": [
          {
            "name": "Khu chợ truyền thống",
            "description": "Nơi tập trung nhiều mặt hàng đặc sản và hàng hóa đa dạng, với kiến trúc đặc trưng của chợ vùng biên",
            "image": "assets/images/places/checkin-cho-ky-lua-lang-son.jpg"
          },
          {
            "name": "Khu ẩm thực",
            "description": "Khu vực tập trung các quầy ăn uống với nhiều món đặc sản Lạng Sơn",
            "image": "assets/images/places/khu-am-thuc-ky-lua.jpg"
          }
        ],
        "cultural": [
          {
            "name": "Phố đi bộ Kỳ Lừa",
            "description": "Khu phố đi bộ sầm uất vào buổi tối với nhiều hoạt động văn hóa",
            "image": "assets/images/places/pho-di-bo-ky-lua.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Vịt quay Kỳ Lừa",
          "description": "Vịt quay theo công thức đặc biệt của người Lạng Sơn, da giòn, thịt mềm",
          "image": "assets/images/foods/vit-quay-ky-lua.jpg"
        },
        {
          "name": "Khau nhục",
          "description": "Món thịt heo kho đặc trưng của người Tày, Nùng",
          "image": "assets/images/foods/khau-nhuc.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Đền Kỳ Cùng",
          "description": "Ngôi đền linh thiêng thờ thành hoàng bản địa",
          "distance": "0.5km",
          "travelTime": "7 phút đi bộ"
        },
        {
          "name": "Công viên Chi Lăng",
          "description": "Không gian xanh rộng rãi, địa điểm vui chơi giải trí",
          "distance": "1km",
          "travelTime": "15 phút đi bộ"
        }
      ],
      "recommendedFood": [
        {
          "name": "Phở chua Lạng Sơn",
          "description": "Món phở đặc trưng với vị chua thanh đặc biệt",
          "restaurant": "Quán phở chua Kỳ Lừa - Trong chợ",
          "price": "35000-45000 VND/bát"
        },
        {
          "name": "Vịt quay Kỳ Lừa",
          "description": "Vịt quay truyền thống với da giòn rụm",
          "restaurant": "Quán vịt quay Bà Mai - Khu ẩm thực chợ",
          "price": "250000-300000 VND/con"
        }
      ]
    },
    {
      "id": "chua-tam-thanh-lang-son",
      "name": "Chùa Tam Thanh",
      "location": "Lạng Sơn",
      "image": "assets/images/places/checkin-chua-tam-thanh-lang-son.jpg",
      "description": "Ngôi chùa cổ trong lòng núi đá, một trong những danh thắng nổi tiếng nhất của Lạng Sơn, nơi hội tụ giữa tâm linh và vẻ đẹp thiên nhiên kỳ thú",
      "detailedDescription": "Chùa Tam Thanh là một quần thể hang động tự nhiên được kiến tạo thành chùa, nằm trong lòng núi đá vôi có tuổi đời hàng triệu năm. Đây là một trong những điểm du lịch tâm linh nổi tiếng của Lạng Sơn, kết hợp hoàn hảo giữa cảnh quan thiên nhiên và kiến trúc tôn giáo. Chùa được xây dựng từ thời nhà Mạc (thế kỷ XVI) và được trùng tu nhiều lần qua các triều đại. Bên trong hang động có nhiều nhũ đá với những hình thù kỳ thú, các bức tượng Phật được tạc tinh xảo và những bức tranh phật giáo cổ quý giá. Đặc biệt, từ chùa có thể ngắm toàn cảnh thành phố Lạng Sơn và dãy núi đá vôi hùng vĩ xung quanh.",
      "howToGet": "Từ trung tâm thành phố Lạng Sơn đi khoảng 2km theo đường Tam Thanh. Có thể đi bộ, xe máy hoặc taxi, có bãi đỗ xe rộng rãi tại chân núi.",
      "bestTimeToVisit": "Có thể thăm quan quanh năm, đẹp nhất vào mùa xuân và thu khi thời tiết mát mẻ. Nên đến sớm buổi sáng để tránh đông người và ngắm cảnh bình minh.",
      "attractions": {
        "religious": [
          {
            "name": "Hang động chùa",
            "description": "Hang động tự nhiên được tạo thành chùa với nhiều tượng Phật cổ và các bức tranh phật giáo quý giá",
            "image": "assets/images/places/checkin-chua-tam-thanh-lang-son.jpg"
          },
          {
            "name": "Điện thờ chính",
            "description": "Nơi thờ Phật trang nghiêm với kiến trúc độc đáo trong lòng núi",
            "image": "assets/images/places/dien-tho-tam-thanh.jpg"
          }
        ],
        "natural": [
          {
            "name": "Thung lũng Tam Thanh",
            "description": "Cảnh quan thiên nhiên tuyệt đẹp với những dãy núi đá vôi và thảm thực vật phong phú",
            "image": "assets/images/places/thung-lung-tam-thanh.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Cơm chay Tam Thanh",
          "description": "Món ăn chay thanh tịnh được chế biến từ rau củ địa phương",
          "image": "assets/images/foods/com-chay-tam-thanh.jpg"
        },
        {
          "name": "Trà núi Tam Thanh",
          "description": "Loại trà đặc biệt được trồng trên núi đá vôi Tam Thanh",
          "image": "assets/images/foods/tra-nui.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Động Nhị Thanh",
          "description": "Hang động tự nhiên với nhiều nhũ đá đẹp, cách Tam Thanh không xa",
          "distance": "0.5km",
          "travelTime": "10 phút đi bộ"
        },
        {
          "name": "Núi Tô Thị",
          "description": "Danh thắng gắn với truyền thuyết về tình mẫu tử",
          "distance": "1.5km",
          "travelTime": "20 phút đi bộ"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cơm chay Tam Thanh",
          "description": "Set cơm chay với các món từ rau củ địa phương",
          "restaurant": "Nhà hàng chay Tâm Thiện - Khuôn viên chùa",
          "price": "50000-80000 VND/suất"
        },
        {
          "name": "Chè hạt sen",
          "description": "Món tráng miệng thanh mát từ hạt sen và đường phèn",
          "restaurant": "Quán chè Bà Phương - Gần cổng chùa",
          "price": "20000-30000 VND/bát"
        }
      ]
    },
    {
      "id": "dong-tam-tanh-lang-son",
      "name": "Động Tam Thánh",
      "location": "Lạng Sơn",
      "image": "assets/images/places/checkin-dong-tam-tanh-lang-son.jpg",
      "description": "Hang động tự nhiên với kiến trúc độc đáo, một phần của quần thể di tích Nhị Thanh - Tam Thanh, nơi hội tụ vẻ đẹp của tạo hóa và dấu ấn văn hóa lịch sử",
      "detailedDescription": "Động Tam Thánh là một hang động tự nhiên kỳ vĩ thuộc quần thể di tích Nhị Thanh - Tam Thanh, được hình thành từ hàng triệu năm trước. Bên trong động có nhiều nhũ đá với hình thù độc đáo, tạo nên những khung cảnh huyền ảo như những bức tranh thiên nhiên tuyệt đẹp. Động được chia thành nhiều ngách với các tầng cao thấp khác nhau, mỗi khu vực đều mang những nét đặc trưng riêng. Đặc biệt, ánh sáng tự nhiên xuyên qua các khe đá tạo nên những hiệu ứng ánh sáng kỳ thú. Nơi đây còn lưu giữ nhiều dấu tích văn hóa lịch sử qua các thời kỳ, là điểm đến hấp dẫn cho những ai yêu thích khám phá và tìm hiểu về địa chất học.",
      "howToGet": "Từ trung tâm thành phố Lạng Sơn đi khoảng 2.5km theo đường Tam Thanh. Có thể đi bộ, xe máy hoặc taxi. Từ chùa Tam Thanh đi bộ khoảng 10 phút.",
      "bestTimeToVisit": "Có thể thăm quan quanh năm, nhưng đẹp nhất vào mùa xuân và thu khi thời tiết mát mẻ. Nên đến vào buổi sáng sớm để tận hưởng không khí trong lành và ánh sáng đẹp nhất.",
      "attractions": {
        "natural": [
          {
            "name": "Hang động tự nhiên",
            "description": "Hang động với nhiều nhũ đá và kiến trúc tự nhiên độc đáo, tạo nên những hình thù kỳ thú như rồng, phượng, hoa, nấm",
            "image": "assets/images/places/checkin-dong-tam-tanh-lang-son.jpg"
          },
          {
            "name": "Thạch nhũ",
            "description": "Hệ thống măng đá, nhũ đá với nhiều hình thù độc đáo được hình thành qua hàng triệu năm",
            "image": "assets/images/places/thach-nhu-tam-thanh.jpg"
          }
        ],
        "historical": [
          {
            "name": "Bia ký cổ",
            "description": "Những văn bia cổ ghi lại lịch sử phát triển của hang động qua các thời kỳ",
            "image": "assets/images/places/bia-ky-tam-thanh.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Nước suối Tam Thanh",
          "description": "Nước suối trong lành từ các mạch nước ngầm trong núi đá vôi",
          "image": "assets/images/foods/nuoc-suoi-tam-thanh.jpg"
        },
        {
          "name": "Rau rừng Tam Thanh",
          "description": "Các loại rau rừng đặc trưng mọc trong khu vực núi đá vôi",
          "image": "assets/images/foods/rau-rung.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Chùa Tam Thanh",
          "description": "Ngôi chùa cổ nằm trong hang động tự nhiên",
          "distance": "0.5km",
          "travelTime": "10 phút đi bộ"
        },
        {
          "name": "Đỉnh núi Tam Thanh",
          "description": "Điểm ngắm cảnh toàn thành phố Lạng Sơn",
          "distance": "1km",
          "travelTime": "30 phút leo núi"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cơm hộp leo núi",
          "description": "Suất cơm đầy đủ dinh dưỡng cho chuyến khám phá hang động",
          "restaurant": "Quán cơm Đông Tây - Chân núi Tam Thanh",
          "price": "40000-60000 VND/suất"
        },
        {
          "name": "Trà thảo mộc",
          "description": "Đồ uống từ các loại thảo mộc địa phương",
          "restaurant": "Quán nước Hang Động - Lối vào động",
          "price": "15000-25000 VND/ly"
        }
      ]
    },
    {
      "id": "uong-bi-quang-ninh",
      "name": "Thành phố Uông Bí",
      "location": "Quảng Ninh",
      "image": "assets/images/places/checkin-thanh-pho-uong-bi-quang-ninh.jpg",
      "description": "Thành phố công nghiệp với nhiều di tích tâm linh, nơi hội tụ giữa phát triển hiện đại và giá trị văn hóa truyền thống, đặc biệt nổi tiếng với quần thể di tích và danh thắng Yên Tử",
      "detailedDescription": "Uông Bí là thành phố công nghiệp năng động của tỉnh Quảng Ninh, nhưng đồng thời cũng là một trung tâm văn hóa tâm linh quan trọng của cả nước. Nổi bật nhất là quần thể di tích và danh thắng Yên Tử - nơi khởi nguồn của thiền phái Trúc Lâm Yên Tử do vua Trần Nhân Tông sáng lập. Quần thể này bao gồm hệ thống chùa, am, tháp cổ nằm dọc theo dãy núi Yên Tử, trong đó có nhiều công trình kiến trúc độc đáo như chùa Đồng trên đỉnh núi, chùa Hoa Yên, tháp Huệ Quang. Ngoài giá trị tâm linh, Yên Tử còn sở hữu cảnh quan thiên nhiên tuyệt đẹp với những cánh rừng nguyên sinh và thảm thực vật phong phú. Thành phố cũng là điểm đến hấp dẫn với nhiều lễ hội truyền thống, đặc biệt là lễ hội Yên Tử kéo dài suốt mùa xuân.",
      "howToGet": "Từ Hà Nội đi xe khách hoặc tàu hỏa đến Uông Bí (khoảng 130km). Có nhiều chuyến xe khách chạy thường xuyên từ bến xe Mỹ Đình và Giáp Bát.",
      "bestTimeToVisit": "Thời điểm tốt nhất để thăm Uông Bí là từ tháng 1 đến tháng 3 (mùa lễ hội Yên Tử), hoặc mùa thu (tháng 9-11) khi thời tiết mát mẻ, thuận lợi cho việc leo núi và chiêm bái.",
      "attractions": {
        "religious": [
          {
            "name": "Quần thể Yên Tử",
            "description": "Trung tâm Phật giáo với nhiều chùa chiền và cảnh quan đẹp, nơi khởi nguồn của thiền phái Trúc Lâm",
            "image": "assets/images/places/checkin-thanh-pho-uong-bi-quang-ninh.jpg"
          },
          {
            "name": "Chùa Đồng",
            "description": "Ngôi chùa bằng đồng trên đỉnh Yên Tử, công trình độc đáo ở độ cao 1068m",
            "image": "assets/images/places/chua-dong.jpg"
          }
        ],
        "natural": [
          {
            "name": "Rừng quốc gia Yên Tử",
            "description": "Khu rừng nguyên sinh với hệ động thực vật phong phú và những cảnh quan hùng vĩ",
            "image": "assets/images/places/rung-yen-tu.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Chè dưỡng sinh Yên Tử",
          "description": "Loại chè đặc biệt được làm từ các loại thảo mộc trên núi Yên Tử",
          "image": "assets/images/foods/che-yen-tu.jpg"
        },
        {
          "name": "Bánh chưng gấc",
          "description": "Đặc sản truyền thống của vùng với màu đỏ tự nhiên từ quả gấc",
          "image": "assets/images/foods/banh-chung-gac.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Vịnh Hạ Long",
          "description": "Di sản thiên nhiên thế giới với những hòn đảo đá vôi kỳ thú",
          "distance": "50km",
          "travelTime": "1 giờ đi ô tô"
        },
        {
          "name": "Chùa Ba Vàng",
          "description": "Quần thể chùa lớn với kiến trúc độc đáo",
          "distance": "5km",
          "travelTime": "15 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cơm chay Yên Tử",
          "description": "Set cơm chay truyền thống của vùng núi Yên Tử",
          "restaurant": "Nhà hàng chay Tâm Đức - Khu du lịch Yên Tử",
          "price": "80000-120000 VND/suất"
        },
        {
          "name": "Nước giải khát thảo mộc",
          "description": "Đồ uống từ các loại thảo mộc núi Yên Tử",
          "restaurant": "Quán nước Thiền Trà - Đường lên Yên Tử",
          "price": "20000-35000 VND/ly"
        }
      ]
    },
    {
      "id": "bach-dang-giang-hai-phong",
      "name": "Di tích Bạch Đằng Giang",
      "location": "Hải Phòng",
      "image": "assets/images/places/checkin-di-tich-bach-dang-giang-hai-phong.jpg",
      "description": "Di tích lịch sử của ba lần chiến thắng giặc ngoại xâm, minh chứng cho trí tuệ và lòng dũng cảm của dân tộc Việt Nam trong việc bảo vệ chủ quyền đất nước",
      "detailedDescription": "Bạch Đằng Giang là di tích lịch sử quốc gia đặc biệt, nơi ghi dấu ba lần chiến thắng vẻ vang của dân tộc Việt Nam trước giặc ngoại xâm: năm 938 (Ngô Quyền đánh thắng quân Nam Hán), năm 981 (Lê Hoàn đánh bại quân Tống) và năm 1288 (Trần Hưng Đạo đại phá quân Nguyên Mông). Đặc biệt, chiến thắng Bạch Đằng năm 938 với trận đánh cọc ngầm nổi tiếng của Ngô Quyền đã mở ra thời kỳ độc lập tự chủ của dân tộc. Di tích còn lưu giữ hệ thống cọc gỗ cổ dưới lòng sông, các di vật khảo cổ quý giá và đền thờ các vị anh hùng dân tộc. Khu di tích không chỉ có giá trị về mặt lịch sử mà còn là một công trình kiến trúc nghệ thuật độc đáo, kết hợp hài hòa giữa cảnh quan thiên nhiên và các công trình tâm linh.",
      "howToGet": "Từ trung tâm Hải Phòng đi khoảng 15km theo hướng Quảng Ninh. Có thể đi bằng xe máy, ô tô hoặc taxi, có bãi đỗ xe rộng rãi tại khu di tích.",
      "bestTimeToVisit": "Có thể thăm quan quanh năm, tốt nhất vào mùa khô (tháng 10-4). Đặc biệt nên đến vào dịp lễ hội Bạch Đằng (tháng 8 âm lịch) để tham gia các hoạt động văn hóa truyền thống.",
      "attractions": {
        "historical": [
          {
            "name": "Bãi cọc Bạch Đằng",
            "description": "Di tích lịch sử với hệ thống cọc gỗ cổ dưới lòng sông, minh chứng cho chiến thuật thủy chiến độc đáo của người Việt",
            "image": "assets/images/places/checkin-di-tich-bach-dang-giang-hai-phong.jpg"
          },
          {
            "name": "Đền thờ Ngô Quyền",
            "description": "Công trình kiến trúc tâm linh thờ vị vua đầu tiên của thời kỳ độc lập tự chủ",
            "image": "assets/images/places/den-ngo-quyen.jpg"
          }
        ],
        "cultural": [
          {
            "name": "Bảo tàng Bạch Đằng",
            "description": "Nơi trưng bày các hiện vật lịch sử và tư liệu về các trận thủy chiến",
            "image": "assets/images/places/bao-tang-bach-dang.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Bánh đa cua Hải Phòng",
          "description": "Món ăn đặc trưng của vùng với bánh đa đỏ và thịt cua biển",
          "image": "assets/images/foods/banh-da-cua.jpg"
        },
        {
          "name": "Hải sản Bạch Đằng",
          "description": "Các món hải sản tươi sống đánh bắt từ vùng cửa sông",
          "image": "assets/images/foods/hai-san-bach-dang.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Cảng Hải Phòng",
          "description": "Cảng biển lớn nhất miền Bắc với hoạt động thương mại sôi động",
          "distance": "10km",
          "travelTime": "20 phút đi ô tô"
        },
        {
          "name": "Đảo Cát Bà",
          "description": "Quần đảo du lịch nổi tiếng với bãi biển đẹp và rừng quốc gia",
          "distance": "30km",
          "travelTime": "45 phút đi ô tô và phà"
        }
      ],
      "recommendedFood": [
        {
          "name": "Bánh đa cua đặc biệt",
          "description": "Bánh đa cua truyền thống với nước dùng đậm đà và cua biển tươi",
          "restaurant": "Quán Bánh đa cua Bà Cúc - Gần di tích",
          "price": "35000-50000 VND/bát"
        },
        {
          "name": "Cháo hàu Bạch Đằng",
          "description": "Cháo nấu với hàu tươi và gia vị đặc trưng",
          "restaurant": "Quán Cháo hàu Bình - Bến sông Bạch Đằng",
          "price": "40000-60000 VND/bát"
        }
      ]
    },
    {
      "id": "bao-tang-quang-ninh",
      "name": "Bảo tàng Quảng Ninh",
      "location": "Quảng Ninh",
      "image": "assets/images/places/checkin-bao-tang-quang-ninh.jpg",
      "description": "Công trình kiến trúc hiện đại lưu giữ di sản văn hóa, một biểu tượng mới của thành phố Hạ Long với thiết kế độc đáo lấy cảm hứng từ than đá và vịnh Hạ Long",
      "detailedDescription": "Bảo tàng Quảng Ninh là công trình kiến trúc độc đáo với thiết kế hiện đại, nằm bên bờ vịnh Hạ Long thơ mộng. Được khánh thành năm 2013, bảo tàng có tổng diện tích trưng bày hơn 12.000m2, với kiến trúc độc đáo mô phỏng những khối than đen bóng - đặc trưng của vùng mỏ Quảng Ninh. Bên trong trưng bày hơn 5000 hiện vật quý về lịch sử, văn hóa và thiên nhiên của vùng đất Quảng Ninh, được tổ chức theo các chủ đề: Thiên nhiên Quảng Ninh, Lịch sử văn hóa, Con người Quảng Ninh và Kinh tế - Xã hội. Đặc biệt, bảo tàng sử dụng công nghệ trưng bày hiện đại với các màn hình tương tác, mô hình 3D và hệ thống âm thanh, ánh sáng tiên tiến, tạo trải nghiệm thú vị cho người tham quan.",
      "howToGet": "Bảo tàng nằm ở trung tâm thành phố Hạ Long, dễ dàng di chuyển bằng taxi hoặc xe máy. Từ cầu Bãi Cháy đi khoảng 2km theo đường Trần Quốc Nghiễn.",
      "bestTimeToVisit": "Mở cửa từ 8h00-17h00 các ngày trong tuần, nghỉ thứ Hai. Nên đến vào buổi sáng để tránh đông người và có đủ thời gian tham quan kỹ các khu trưng bày.",
      "attractions": {
        "cultural": [
          {
            "name": "Khu trưng bày chính",
            "description": "Nơi trưng bày các hiện vật về lịch sử và văn hóa Quảng Ninh, với không gian hiện đại và công nghệ tương tác",
            "image": "assets/images/places/checkin-bao-tang-quang-ninh.jpg"
          },
          {
            "name": "Phòng trưng bày than đá",
            "description": "Khu vực giới thiệu lịch sử khai thác than và phát triển công nghiệp mỏ của Quảng Ninh",
            "image": "assets/images/places/trung-bay-than.jpg"
          }
        ],
        "architectural": [
          {
            "name": "Kiến trúc bảo tàng",
            "description": "Công trình kiến trúc độc đáo với thiết kế lấy cảm hứng từ than đá và vịnh Hạ Long",
            "image": "assets/images/places/kien-truc-bao-tang.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Chả mực Hạ Long",
          "description": "Đặc sản nổi tiếng được chế biến từ mực tươi vịnh Hạ Long",
          "image": "assets/images/foods/cha-muc.jpg"
        },
        {
          "name": "Sá sùng",
          "description": "Đặc sản biển quý hiếm của vùng biển Quảng Ninh",
          "image": "assets/images/foods/sa-sung.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Vịnh Hạ Long",
          "description": "Di sản thiên nhiên thế giới với hàng nghìn hòn đảo đá vôi",
          "distance": "1km",
          "travelTime": "5 phút đi bộ"
        },
        {
          "name": "Quảng trường 30/10",
          "description": "Quảng trường lớn nhất Quảng Ninh với nhiều hoạt động văn hóa",
          "distance": "0.5km",
          "travelTime": "3 phút đi bộ"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cơm chả mực",
          "description": "Cơm với chả mực Hạ Long truyền thống",
          "restaurant": "Nhà hàng Hương Biển - Gần bảo tàng",
          "price": "70000-100000 VND/suất"
        },
        {
          "name": "Bún hải sản",
          "description": "Bún với các loại hải sản tươi sống",
          "restaurant": "Quán Bún cá Hạ Long - Đường Trần Quốc Nghiễn",
          "price": "40000-60000 VND/bát"
        }
      ]
    },
    {
      "id": "deo-da-trang-son-la",
      "name": "Đèo Đá Trắng",
      "location": "Sơn La",
      "image": "assets/images/places/checkin-deo-da-trang-son-la.jpg",
      "description": "Cung đường đèo uốn lượn với cảnh quan hùng vĩ, một trong những cung đường đẹp nhất Tây Bắc, nơi mây trời và núi non hòa quyện tạo nên khung cảnh tuyệt đẹp như dải lụa trắng vắt ngang trời",
      "detailedDescription": "Đèo Đá Trắng là một trong những cung đường đèo đẹp nhất miền Bắc, nằm trên quốc lộ 6 đoạn qua tỉnh Sơn La. Với độ cao trên 1000m so với mực nước biển, đèo có chiều dài khoảng 12km với những khúc cua uốn lượn như dải lụa trắng vắt ngang sườn núi. Từ đỉnh đèo, du khách có thể ngắm nhìn toàn cảnh thung lũng Sơn La với những thửa ruộng bậc thang tầng tầng lớp lớp và những bản làng của đồng bào dân tộc thiểu số nằm ẩn hiện trong sương mù. Vào những ngày đẹp trời, mây trắng bao phủ tạo nên khung cảnh huyền ảo như chốn bồng lai. Đèo không chỉ nổi tiếng về cảnh đẹp mà còn là thử thách hấp dẫn cho những người yêu thích phượt xe máy.",
      "howToGet": "Đèo nằm trên quốc lộ 6, đoạn qua tỉnh Sơn La, cách trung tâm thành phố Sơn La khoảng 30km. Có thể đi bằng xe máy hoặc ô tô từ Hà Nội theo quốc lộ 6.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là mùa thu (tháng 9-11) khi thời tiết mát mẻ, bầu trời trong xanh. Nên đến vào sáng sớm hoặc chiều tà để ngắm bình minh hoặc hoàng hôn và tránh sương mù dày đặc.",
      "attractions": {
        "natural": [
          {
            "name": "Đèo Đá Trắng",
            "description": "Cung đường đèo với cảnh quan thiên nhiên tuyệt đẹp, nổi tiếng với những khúc cua tay áo và tầm nhìn panorama",
            "image": "assets/images/places/checkin-deo-da-trang-son-la.jpg"
          },
          {
            "name": "Đỉnh đèo",
            "description": "Điểm cao nhất của đèo với tầm nhìn bao quát toàn bộ thung lũng và dãy núi Tây Bắc",
            "image": "assets/images/places/dinh-deo.jpg"
          }
        ],
        "cultural": [
          {
            "name": "Bản làng dân tộc",
            "description": "Những bản làng của đồng bào dân tộc Thái, Mông nằm dọc theo sườn núi",
            "image": "assets/images/places/ban-lang-dan-toc.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Cơm lam",
          "description": "Đặc sản cơm nếp nấu trong ống tre của người Thái",
          "image": "assets/images/foods/com-lam.jpg"
        },
        {
          "name": "Thịt trâu gác bếp",
          "description": "Món thịt trâu hun khói truyền thống của vùng núi Tây Bắc",
          "image": "assets/images/foods/thit-trau-gac-bep.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Thác Dải Yếm",
          "description": "Thác nước tự nhiên với độ cao 100m, tạo nên cảnh quan đẹp",
          "distance": "15km",
          "travelTime": "30 phút đi xe máy"
        },
        {
          "name": "Rừng thông bản Áng",
          "description": "Khu rừng thông xanh mát với không khí trong lành",
          "distance": "10km",
          "travelTime": "20 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cơm lam thịt nướng",
          "description": "Set cơm lam với thịt nướng và rau rừng",
          "restaurant": "Quán Cơm Tây Bắc - Chân đèo",
          "price": "80000-120000 VND/suất"
        },
        {
          "name": "Lẩu cá hồi",
          "description": "Lẩu cá hồi tươi từ các trại nuôi địa phương",
          "restaurant": "Nhà hàng Đèo Cao - Gần đỉnh đèo",
          "price": "250000-350000 VND/nồi"
        }
      ]
    },
    {
      "id": "cho-son-la",
      "name": "Chợ Sơn La",
      "location": "Sơn La",
      "image": "assets/images/places/checkin-cho-son-la.jpg",
      "description": "Khu chợ truyền thống của người dân Tây Bắc, nơi hội tụ văn hóa và ẩm thực đặc sắc của các dân tộc vùng cao, là trung tâm giao thương sầm uất nhất của thành phố Sơn La",
      "detailedDescription": "Chợ Sơn La là trung tâm thương mại lớn nhất của thành phố, nơi hội tụ văn hóa và đời sống của các dân tộc Thái, Mông, Mường, Dao. Chợ được chia thành nhiều khu vực chuyên biệt: khu bán đồ thổ cẩm với những tấm vải thổ cẩm rực rỡ sắc màu, khu nông sản với các đặc sản địa phương như mận tam hoa, xoài tròn, cà phê Sơn La, khu ẩm thực với những món ăn đặc trưng của vùng cao. Đặc biệt vào những phiên chợ phiên, đồng bào các dân tộc từ các bản làng xa xôi đổ về đây trao đổi hàng hóa, tạo nên không khí nhộn nhịp và đầy màu sắc văn hóa. Chợ không chỉ là nơi mua bán mà còn là điểm hẹn văn hóa, nơi du khách có thể tìm hiểu về đời sống và phong tục tập quán của đồng bào các dân tộc Tây Bắc.",
      "howToGet": "Chợ nằm ở trung tâm thành phố Sơn La, dễ dàng di chuyển bằng các phương tiện công cộng. Từ bến xe Sơn La đi khoảng 1km theo đường Tô Hiệu.",
      "bestTimeToVisit": "Chợ họp sớm nhất vào buổi sáng từ 5h00, đặc biệt nhộn nhịp vào các ngày phiên (mùng 5, 10, 15, 20, 25, 30 âm lịch). Nên đến sớm để mua được hàng tươi ngon và trải nghiệm không khí chợ sáng vùng cao.",
      "attractions": {
        "cultural": [
          {
            "name": "Khu chợ truyền thống",
            "description": "Nơi giao thương của người dân các dân tộc Tây Bắc, với nhiều gian hàng đặc sản và thổ cẩm truyền thống",
            "image": "assets/images/places/checkin-cho-son-la.jpg"
          },
          {
            "name": "Khu ẩm thực dân tộc",
            "description": "Khu vực tập trung các món ăn đặc trưng của đồng bào dân tộc vùng cao",
            "image": "assets/images/places/am-thuc-dan-toc.jpg"
          }
        ],
        "shopping": [
          {
            "name": "Khu thổ cẩm",
            "description": "Nơi bày bán các sản phẩm thổ cẩm, trang phục truyền thống của các dân tộc",
            "image": "assets/images/places/khu-tho-cam.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Xôi nếp nương",
          "description": "Xôi được nấu từ gạo nếp nương thơm ngon của vùng cao",
          "image": "assets/images/foods/xoi-nep-nuong.jpg"
        },
        {
          "name": "Cá nướng suối",
          "description": "Cá suối tươi nướng với gia vị đặc trưng của người Thái",
          "image": "assets/images/foods/ca-nuong-suoi.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Bảo tàng Sơn La",
          "description": "Nơi trưng bày các hiện vật văn hóa các dân tộc Tây Bắc",
          "distance": "0.5km",
          "travelTime": "7 phút đi bộ"
        },
        {
          "name": "Quảng trường Tây Bắc",
          "description": "Không gian công cộng rộng lớn, nơi tổ chức các sự kiện văn hóa",
          "distance": "0.3km",
          "travelTime": "5 phút đi bộ"
        }
      ],
      "recommendedFood": [
        {
          "name": "Phở chua Sơn La",
          "description": "Món phở đặc trưng với vị chua thanh của chanh và các loại rau thơm",
          "restaurant": "Quán phở chua Bà Đức - Trong chợ",
          "price": "35000-45000 VND/bát"
        },
        {
          "name": "Lợn cắp nách",
          "description": "Thịt lợn đen nướng theo cách truyền thống của người Thái",
          "restaurant": "Quán ăn dân tộc Tây Bắc - Khu ẩm thực chợ",
          "price": "150000-200000 VND/suất"
        }
      ]
    },
    {
      "id": "nha-tu-son-la",
      "name": "Nhà tù Sơn La",
      "location": "Sơn La",
      "image": "assets/images/places/checkin-nha-tu-son-la.jpg",
      "description": "Di tích lịch sử cách mạng cấp quốc gia đặc biệt, chứng tích của tinh thần đấu tranh kiên cường và bất khuất của các chiến sĩ cách mạng trong thời kỳ đấu tranh giành độc lập",
      "detailedDescription": "Nhà tù Sơn La là một trong những nhà tù kiên cố nhất Đông Dương thời Pháp thuộc, được xây dựng từ năm 1908 đến 1910. Nơi đây đã giam giữ nhiều chiến sĩ cách mạng tiêu biểu như Tô Hiệu, Trường Chinh, Nguyễn Lương Bằng. Di tích bao gồm khu nhà giam chính với 4 dãy nhà xây bằng đá, tường dày 60cm, các xà lim biệt giam, khu nhà tra tấn, và khu tưởng niệm các chiến sĩ đã hy sinh. Đặc biệt, trong điều kiện giam cầm khắc nghiệt, các chiến sĩ cách mạng vẫn tổ chức được các hoạt động học tập, tuyên truyền và đấu tranh. Nhiều hiện vật, tài liệu quý giá về phong trào cách mạng được lưu giữ và trưng bày tại đây, giúp người tham quan hiểu rõ hơn về một giai đoạn lịch sử đấu tranh hào hùng của dân tộc.",
      "howToGet": "Di tích nằm ở trung tâm thành phố Sơn La, cách chợ Sơn La khoảng 1km theo đường Tô Hiệu. Có thể đi bộ hoặc xe máy từ trung tâm thành phố.",
      "bestTimeToVisit": "Có thể tham quan quanh năm, mở cửa cả ngày từ 7h00-17h00. Nên đến vào buổi sáng sớm hoặc chiều mát để tránh nắng nóng. Đặc biệt vào các dịp lễ lớn, di tích thường tổ chức các hoạt động tưởng niệm ý nghĩa.",
      "attractions": {
        "historical": [
          {
            "name": "Nhà tù lịch sử",
            "description": "Di tích lịch sử cách mạng với kiến trúc thời Pháp thuộc, nơi ghi dấu tinh thần đấu tranh kiên cường của các chiến sĩ cách mạng",
            "image": "assets/images/places/checkin-nha-tu-son-la.jpg"
          },
          {
            "name": "Khu tưởng niệm",
            "description": "Nơi tưởng nhớ các chiến sĩ cách mạng đã hy sinh, với bia tưởng niệm và khu vườn tưởng niệm",
            "image": "assets/images/places/khu-tuong-niem.jpg"
          }
        ],
        "cultural": [
          {
            "name": "Bảo tàng nhà tù",
            "description": "Trưng bày các hiện vật, tài liệu về hoạt động cách mạng và cuộc sống của các chiến sĩ trong tù",
            "image": "assets/images/places/bao-tang-nha-tu.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Chè sơn tra",
          "description": "Món chè đặc trưng được làm từ quả sơn tra (táo mèo) của vùng núi Tây Bắc",
          "image": "assets/images/foods/che-son-tra.jpg"
        },
        {
          "name": "Bánh chưng đen",
          "description": "Đặc sản bánh chưng làm từ gạo nếp cẩm của người Thái đen",
          "image": "assets/images/foods/banh-chung-den.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Bảo tàng Sơn La",
          "description": "Nơi lưu giữ và trưng bày các hiện vật văn hóa, lịch sử của tỉnh",
          "distance": "0.5km",
          "travelTime": "7 phút đi bộ"
        },
        {
          "name": "Công viên Tô Hiệu",
          "description": "Công viên tưởng niệm anh hùng Tô Hiệu với không gian xanh mát",
          "distance": "0.3km",
          "travelTime": "5 phút đi bộ"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cơm lam Pa Khoang",
          "description": "Cơm lam truyền thống với thịt nướng và rau rừng",
          "restaurant": "Quán cơm Tây Bắc - Gần di tích",
          "price": "50000-70000 VND/suất"
        },
        {
          "name": "Canh cá suối nấu măng",
          "description": "Món canh đặc trưng của người Thái với cá suối tươi",
          "restaurant": "Nhà hàng Sơn La Xưa - Đường Tô Hiệu",
          "price": "80000-120000 VND/bát"
        }
      ]
    },
    {
      "id": "ba-vi-ha-noi",
      "name": "Huyện Ba Vì",
      "location": "Hà Nội",
      "image": "assets/images/places/checkin-huyen-ba-vi-ha-noi.jpg",
      "description": "Vùng đất với cảnh quan thiên nhiên đẹp và nhiều di tích lịch sử, nổi tiếng với núi Ba Vì hùng vĩ và không khí trong lành, là điểm đến lý tưởng cho du lịch sinh thái và tâm linh",
      "detailedDescription": "Ba Vì là huyện ngoại thành Hà Nội, nổi tiếng với dãy núi Ba Vì và Vườn quốc gia Ba Vì rộng hơn 7.377 ha. Đỉnh núi cao nhất đạt 1.296m so với mực nước biển, tạo nên một khí hậu mát mẻ quanh năm. Vườn quốc gia Ba Vì là nơi bảo tồn đa dạng sinh học với hơn 1.200 loài thực vật và nhiều loài động vật quý hiếm. Ngoài giá trị về sinh thái, Ba Vì còn là vùng đất giàu truyền thống văn hóa với nhiều di tích lịch sử như đền Thượng, đền Trung, đền Hạ thờ Chủ tịch Hồ Chí Minh và các vị thần núi Ba Vì. Khu vực này cũng nổi tiếng với các trang trại chăn nuôi bò sữa, các khu resort nghỉ dưỡng và các điểm du lịch sinh thái hấp dẫn.",
      "howToGet": "Từ trung tâm Hà Nội đi khoảng 50km theo quốc lộ 32 hoặc đường Láng - Hòa Lạc. Có thể đi xe máy, ô tô riêng hoặc xe khách từ bến xe Mỹ Đình.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là mùa xuân (tháng 2-4) khi hoa rừng nở rộ và mùa thu (tháng 9-11) với khí hậu mát mẻ, trong lành. Nên đi sớm để tránh sương mù vào buổi chiều.",
      "attractions": {
        "natural": [
          {
            "name": "Núi Ba Vì",
            "description": "Dãy núi với ba đỉnh cao và hệ sinh thái đa dạng, là biểu tượng của vùng đất Ba Vì",
            "image": "assets/images/places/checkin-huyen-ba-vi-ha-noi.jpg"
          },
          {
            "name": "Thác Đa",
            "description": "Thác nước tự nhiên cao 50m với cảnh quan hoang sơ tuyệt đẹp",
            "image": "assets/images/places/thac-da.jpg"
          }
        ],
        "religious": [
          {
            "name": "Đền Thượng",
            "description": "Ngôi đền linh thiêng trên đỉnh núi Ba Vì, thờ Sơn Tinh - Thần Núi Tản Viên",
            "image": "assets/images/places/den-thuong.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Sữa chua Ba Vì",
          "description": "Sữa chua được làm từ sữa bò tươi của vùng Ba Vì nổi tiếng",
          "image": "assets/images/foods/sua-chua-ba-vi.jpg"
        },
        {
          "name": "Gà đồi Ba Vì",
          "description": "Gà thả đồi được nuôi tự nhiên với hương vị đặc trưng",
          "image": "assets/images/foods/ga-doi.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Khu du lịch sinh thái Ao Vua",
          "description": "Khu du lịch với nhiều hoạt động giải trí và nghỉ dưỡng",
          "distance": "5km",
          "travelTime": "15 phút đi xe máy"
        },
        {
          "name": "Trang trại bò sữa Ba Vì",
          "description": "Nơi tham quan và thưởng thức các sản phẩm từ sữa tươi",
          "distance": "3km",
          "travelTime": "10 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Lẩu gà đồi",
          "description": "Lẩu gà thả đồi nấu với nấm và rau rừng",
          "restaurant": "Nhà hàng Rừng Xanh - Chân núi Ba Vì",
          "price": "300000-400000 VND/nồi"
        },
        {
          "name": "Cơm lam sườn nướng",
          "description": "Cơm lam với sườn nướng và các loại rau rừng",
          "restaurant": "Quán Núi Rừng - Đường lên núi Ba Vì",
          "price": "100000-150000 VND/suất"
        }
      ]
    },
    {
      "id": "wat-phnom-phnompenh",
      "name": "Chùa Wat Phnom",
      "location": "Phnom Penh, Campuchia",
      "image": "assets/images/places/checkin-chua-wat-phnom-phnompenh-campuchia.jpg",
      "description": "Ngôi chùa cổ biểu tượng của thủ đô Phnom Penh, điểm đến tâm linh quan trọng và là minh chứng cho sự giao thoa văn hóa Khmer-Phật giáo qua nhiều thế kỷ",
      "detailedDescription": "Chùa Wat Phnom là một trong những ngôi chùa cổ nhất và là biểu tượng của thủ đô Phnom Penh, được xây dựng vào năm 1373 bởi bà Daun Penh. Theo truyền thuyết, bà đã tìm thấy bốn pho tượng Phật trong một thân cây gỗ trôi dạt vào bờ sông Mekong và cho xây dựng ngôi chùa này trên đỉnh đồi nhân tạo cao 27m để thờ phụng. Quần thể chùa bao gồm ngôi chùa chính với kiến trúc Khmer truyền thống, các tượng Phật trang nghiêm, những bức bích họa kể về cuộc đời Đức Phật và các vị thần trong Hindu giáo. Xung quanh chùa là khu vườn được quy hoạch đẹp với nhiều cây cổ thụ, tượng đài và đền thờ nhỏ. Đặc biệt, chùa còn là nơi diễn ra nhiều lễ hội quan trọng trong năm, thu hút đông đảo Phật tử và du khách đến chiêm bái và tham quan.",
      "howToGet": "Từ Việt Nam có thể đi máy bay đến Phnom Penh (khoảng 1 giờ bay từ TP.HCM), sau đó di chuyển bằng taxi hoặc tuk tuk đến chùa. Chùa nằm ở giao lộ đường Norodom và Street 96.",
      "bestTimeToVisit": "Thời điểm thích hợp để thăm chùa là từ tháng 11 đến tháng 4 năm sau, khi thời tiết mát mẻ và ít mưa. Nên đến vào buổi sáng sớm hoặc chiều tà để tránh nắng nóng và đông đúc.",
      "attractions": {
        "religious": [
          {
            "name": "Chùa Wat Phnom",
            "description": "Ngôi chùa cổ trên đồi với kiến trúc Khmer truyền thống, nổi bật với mái chùa nhiều tầng và những họa tiết chạm khắc tinh xảo",
            "image": "assets/images/places/checkin-chua-wat-phnom-phnompenh-campuchia.jpg"
          },
          {
            "name": "Tượng Phật lớn",
            "description": "Tượng Phật trang nghiêm trong khuôn viên chùa, được trang trí với những họa tiết và màu sắc đặc trưng của Phật giáo Campuchia",
            "image": "assets/images/places/tuong-phat-wat-phnom.jpg"
          }
        ],
        "cultural": [
          {
            "name": "Bảo tàng lịch sử",
            "description": "Trưng bày các hiện vật về lịch sử chùa và Phật giáo Campuchia, với bộ sưu tập phong phú về nghệ thuật và văn hóa Khmer",
            "image": "assets/images/places/bao-tang-wat-phnom.jpg"
          },
          {
            "name": "Vườn tượng",
            "description": "Khu vườn với nhiều tượng điêu khắc kể về truyền thuyết và lịch sử của ngôi chùa",
            "image": "assets/images/places/vuon-tuong-wat-phnom.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Amok",
          "description": "Món cá đặc trưng của Campuchia, được nấu trong lá chuối với nước cốt dừa và các loại gia vị đặc biệt",
          "image": "assets/images/foods/amok.jpg"
        },
        {
          "name": "Num Banh Chok",
          "description": "Bún cà ri xanh kiểu Khmer, được làm từ bột gạo tươi và nước cốt cà ri với các loại rau thơm địa phương",
          "image": "assets/images/foods/num-banh-chok.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Chợ Trung tâm",
          "description": "Khu chợ truyền thống sầm uất với kiến trúc Art Deco độc đáo từ thời Pháp thuộc",
          "distance": "1km",
          "travelTime": "15 phút đi bộ"
        },
        {
          "name": "Cung điện Hoàng gia",
          "description": "Công trình kiến trúc hoàng gia tráng lệ với những mái ngói vàng và vườn cảnh đẹp",
          "distance": "2km",
          "travelTime": "20 phút đi bộ hoặc 5 phút đi tuk tuk"
        }
      ],
      "recommendedFood": [
        {
          "name": "Lok Lak",
          "description": "Món bò xào truyền thống Campuchia với sốt tiêu Kampot đặc biệt",
          "restaurant": "Romdeng Restaurant - Gần chùa Wat Phnom",
          "price": "5-8 USD/phần"
        },
        {
          "name": "Bánh mì Campuchia",
          "description": "Bánh mì kẹp thịt kiểu Khmer với patê và rau thơm đặc trưng",
          "restaurant": "Các quầy bánh mì xung quanh chùa",
          "price": "1-2 USD/ổ"
        }
      ]
    },
    {
      "id": "binh-dinh",
      "name": "Thành phố Quy Nhơn",
      "location": "Bình Định",
      "image": "assets/images/places/checkin-binh-dinh.jpg",
      "description": "Thành phố biển với nhiều di tích lịch sử, nơi hội tụ giữa văn hóa Chăm cổ đại và nét đẹp hiện đại, được mệnh danh là một trong những thành phố đáng sống nhất Việt Nam",
      "detailedDescription": "Quy Nhơn là thành phố biển xinh đẹp của tỉnh Bình Định, nổi tiếng với những bãi biển hoang sơ, tháp Chăm cổ kính và ẩm thực đặc sắc. Thành phố không chỉ là quê hương của nhiều danh nhân văn hóa như Hàn Mặc Tử, Xuân Diệu, mà còn là vùng đất có truyền thống võ thuật lâu đời với các môn phái nổi tiếng. Quy Nhơn sở hữu đường bờ biển dài với nhiều bãi tắm đẹp như Quy Nhơn, Ghềnh Ráng, Eo Gió, cùng hệ thống tháp Chăm Pa cổ kính như tháp Đôi, tháp Bánh Ít. Thành phố cũng nổi tiếng với ẩm thực phong phú, đặc biệt là các món hải sản tươi sống và đặc sản như bánh xèo tôm nhảy, bún chả cá. Trong những năm gần đây, Quy Nhơn đang phát triển mạnh mẽ về du lịch nhưng vẫn giữ được nét thanh bình và giá trị văn hóa truyền thống.",
      "howToGet": "Có thể đến Quy Nhơn bằng máy bay (sân bay Phù Cát, cách trung tâm 30km), tàu hỏa (ga Quy Nhơn) hoặc xe khách từ các tỉnh thành lớn. Từ sân bay có xe buýt và taxi đưa về trung tâm thành phố.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là từ tháng 3 đến tháng 9, khi thời tiết ít mưa và biển lặng sóng. Nên tránh mùa mưa bão từ tháng 10 đến tháng 12. Buổi sáng sớm và chiều tà là thời điểm lý tưởng để tham quan các điểm du lịch và tắm biển.",
      "attractions": {
        "historical": [
          {
            "name": "Tháp Chăm",
            "description": "Quần thể tháp Chăm cổ với kiến trúc độc đáo, minh chứng cho nền văn minh Chăm Pa rực rỡ một thời",
            "image": "assets/images/places/checkin-binh-dinh.jpg"
          },
          {
            "name": "Nhà thờ Nhạn",
            "description": "Công trình kiến trúc độc đáo thời Pháp, nổi bật với tháp chuông hình chim nhạn bay lên",
            "image": "assets/images/places/nha-tho-nhan.jpg"
          }
        ],
        "natural": [
          {
            "name": "Bãi biển Quy Nhơn",
            "description": "Bãi biển đẹp với cát trắng mịn, nước trong xanh và hàng dương rợp bóng",
            "image": "assets/images/places/bai-bien-quy-nhon.jpg"
          },
          {
            "name": "Kỳ Co",
            "description": "Bãi biển hoang sơ với nước biển xanh ngọc, được ví như 'Maldives của Việt Nam'",
            "image": "assets/images/places/ky-co.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Bánh xèo tôm nhảy",
          "description": "Món bánh xèo đặc trưng của Quy Nhơn, được làm với tôm nhảy tươi ngon và nước chấm chua ngọt đặc biệt",
          "image": "assets/images/foods/banh-xeo-tom-nhay.jpg"
        },
        {
          "name": "Bún chả cá",
          "description": "Bún với chả cá tươi ngon được làm từ cá thu tươi, nước dùng ngọt thanh đặc trưng",
          "image": "assets/images/foods/bun-cha-ca.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Ghềnh Ráng",
          "description": "Thắng cảnh đẹp với bãi đá và biển, nơi có bãi tắm Hoàng Hậu và mộ thi sĩ Hàn Mặc Tử",
          "distance": "5km",
          "travelTime": "15 phút đi xe máy"
        },
        {
          "name": "Eo Gió",
          "description": "Vách đá nhìn ra biển tuyệt đẹp, điểm ngắm bình minh và hoàng hôn nổi tiếng",
          "distance": "20km",
          "travelTime": "40 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Bánh hỏi lòng heo",
          "description": "Món ăn truyền thống Bình Định với bánh hỏi mềm mịn và lòng heo được chế biến công phu",
          "restaurant": "Quán Bà Tám - Đường Nguyễn Huệ",
          "price": "30000-50000 VND/phần"
        },
        {
          "name": "Gỏi cá mai",
          "description": "Đặc sản gỏi cá tươi với cá mai được chế biến theo công thức đặc biệt của người Quy Nhơn",
          "restaurant": "Quán Bé Mặn - Khu ẩm thực biển",
          "price": "60000-100000 VND/phần"
        }
      ]
    },
    {
      "id": "quy-nhon-binh-dinh",
      "name": "Bãi biển Quy Nhơn",
      "location": "Bình Định",
      "image": "assets/images/places/checkin-quy-nhon-binh-dinh.jpg",
      "description": "Bãi biển đẹp với cát trắng mịn và nước trong xanh, một trong những bãi biển đô thị đẹp nhất Việt Nam với đường bờ biển cong hình lưỡi liềm ôm trọn thành phố",
      "detailedDescription": "Bãi biển Quy Nhơn nổi tiếng với cát trắng mịn, nước biển trong xanh và không gian yên bình. Trải dài hơn 5km dọc theo đường An Dương Vương và Xuân Diệu, bãi biển có hình cong như lưỡi liềm ôm trọn thành phố. Đặc biệt, bãi biển có độ dốc thoai thoải, sóng nhẹ, rất thích hợp cho việc tắm biển và các hoạt động thể thao dưới nước. Dọc bãi biển là con đường ven biển rợp bóng dừa, nơi lý tưởng để đi dạo, ngắm bình minh và hoàng hôn. Vào buổi sáng sớm, bãi biển nhộn nhịp với các hoạt động thể dục thể thao của người dân địa phương, còn buổi chiều tối là thời điểm lý tưởng để thưởng thức hải sản tươi sống tại các nhà hàng ven biển.",
      "howToGet": "Bãi biển nằm ngay trung tâm thành phố Quy Nhơn, dễ dàng di chuyển bằng mọi phương tiện. Từ sân bay Phù Cát về trung tâm khoảng 30km, từ ga Quy Nhơn chỉ cách 2km.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là từ tháng 3 đến tháng 8, khi thời tiết nắng đẹp và biển lặng. Nên đến sớm buổi sáng (5h-7h) để ngắm bình minh và tránh nắng nóng, hoặc chiều tà (16h-18h) để thưởng thức hoàng hôn.",
      "attractions": {
        "natural": [
          {
            "name": "Bãi biển trung tâm",
            "description": "Bãi biển đẹp với cát trắng mịn, nước trong xanh, được bao quanh bởi hàng dừa xanh mát và đường đi bộ ven biển hiện đại",
            "image": "assets/images/places/checkin-quy-nhon-binh-dinh.jpg"
          },
          {
            "name": "Kỳ Co",
            "description": "Bãi biển hoang sơ với nước trong như ngọc, được ví như 'Maldives của Việt Nam', nổi tiếng với những mỏm đá độc đáo và hang động tự nhiên",
            "image": "assets/images/places/ky-co.jpg"
          }
        ],
        "entertainment": [
          {
            "name": "Công viên biển",
            "description": "Khu vui chơi giải trí ven biển với nhiều hoạt động thú vị như thể thao biển, khu vui chơi trẻ em và các show diễn nghệ thuật",
            "image": "assets/images/places/cong-vien-bien.jpg"
          },
          {
            "name": "Phố đi bộ ven biển",
            "description": "Tuyến phố đi bộ sầm uất với nhiều hoạt động văn hóa, nghệ thuật và ẩm thực đường phố",
            "image": "assets/images/places/pho-di-bo-quy-nhon.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Hải sản tươi sống",
          "description": "Các loại hải sản tươi ngon từ biển như tôm hùm, cua, ghẹ, mực, sò điệp được chế biến theo phong cách đặc trưng Quy Nhơn",
          "image": "assets/images/foods/hai-san-quy-nhon.jpg"
        },
        {
          "name": "Bánh căn",
          "description": "Món bánh truyền thống Quy Nhơn được làm từ bột gạo, trứng, ăn kèm với nước mắm pha đặc biệt và rau sống",
          "image": "assets/images/foods/banh-can.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Ghềnh Ráng",
          "description": "Thắng cảnh đẹp với bãi đá và biển, nơi có bãi tắm Hoàng Hậu và khu tưởng niệm thi sĩ Hàn Mặc Tử",
          "distance": "3km",
          "travelTime": "10 phút đi xe máy"
        },
        {
          "name": "Tháp Đôi",
          "description": "Di tích tháp Chăm cổ với kiến trúc độc đáo, là biểu tượng văn hóa của Quy Nhơn",
          "distance": "2km",
          "travelTime": "7 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cá nướng",
          "description": "Cá biển tươi nướng than hồng với gia vị đặc trưng của người Quy Nhơn, ăn kèm với rau sống và bánh tráng",
          "restaurant": "Quán Năm Bảy - Khu ẩm thực ven biển",
          "price": "150000-200000 VND/kg"
        },
        {
          "name": "Bánh căn sốt cá",
          "description": "Bánh căn nóng hổi với sốt cá đặc biệt, được làm từ cá tươi và gia vị địa phương",
          "restaurant": "Quán Út Lý - Đường Xuân Diệu",
          "price": "30000-40000 VND/phần"
        }
      ]
    },
    {
      "id": "quang-ngai",
      "name": "Thành phố Quảng Ngãi",
      "location": "Quảng Ngãi",
      "image": "assets/images/places/checkin-quang-ngai.jpg",
      "description": "Vùng đất với nhiều di tích lịch sử và danh thắng, nơi ghi dấu những trang sử hào hùng của dân tộc và sở hữu những cảnh quan thiên nhiên tuyệt đẹp cùng nền ẩm thực đặc sắc",
      "detailedDescription": "Quảng Ngãi là vùng đất giàu truyền thống lịch sử và văn hóa, nổi tiếng với di tích Sơn Mỹ - chứng tích của một thời kỳ lịch sử đau thương, đảo Lý Sơn - 'Vương quốc tỏi' với những cảnh quan tuyệt đẹp và nhiều di tích văn hóa Sa Huỳnh cổ. Thành phố không chỉ thu hút du khách bởi những di tích lịch sử như thành cổ Châu Sa, mộ Hoàng đế Quang Trung, mà còn bởi vẻ đẹp của những bãi biển hoang sơ như Sa Huỳnh, Mỹ Khê. Đặc biệt, Quảng Ngãi còn nổi tiếng với nền ẩm thực phong phú, đặc trưng với các món ăn như mì Quảng, bánh bèo, ram bắp và nhiều đặc sản từ biển đảo Lý Sơn.",
      "howToGet": "Có thể đến Quảng Ngãi bằng tàu hỏa (ga Quảng Ngãi nằm trên tuyến đường sắt Bắc-Nam) hoặc xe khách theo quốc lộ 1A. Từ sân bay Chu Lai cách thành phố khoảng 40km.",
      "bestTimeToVisit": "Thời điểm thích hợp để thăm Quảng Ngãi là từ tháng 1 đến tháng 8, khi thời tiết khô ráo và ít mưa. Tránh mùa mưa bão từ tháng 9 đến tháng 12. Đặc biệt nên đến vào mùa hè để tham gia lễ hội đảo Lý Sơn.",
      "attractions": {
        "historical": [
          {
            "name": "Di tích Sơn Mỹ",
            "description": "Di tích lịch sử quan trọng của cuộc kháng chiến, nơi ghi dấu một trang sử đau thương và bài học về hòa bình cho nhân loại",
            "image": "assets/images/places/checkin-quang-ngai.jpg"
          },
          {
            "name": "Thành cổ Châu Sa",
            "description": "Di tích lịch sử thời Champa với kiến trúc độc đáo, là minh chứng cho nền văn minh Chăm cổ xưa",
            "image": "assets/images/places/thanh-co-chau-sa.jpg"
          }
        ],
        "natural": [
          {
            "name": "Đảo Lý Sơn",
            "description": "Hòn đảo với cảnh quan thiên nhiên tuyệt đẹp, nổi tiếng với các cánh đồng tỏi, những vách núi đá dựng đứng và biển xanh trong vắt",
            "image": "assets/images/places/dao-ly-son.jpg"
          },
          {
            "name": "Bãi biển Mỹ Khê",
            "description": "Bãi biển hoang sơ với cát trắng mịn, nước trong xanh và hàng dừa rợp bóng",
            "image": "assets/images/places/bai-bien-my-khe.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Mì Quảng",
          "description": "Món mì đặc trưng của miền Trung với sợi mì vàng, thịt gà hoặc tôm, đậu phộng rang và rau sống, được chế biến theo công thức truyền thống",
          "image": "assets/images/foods/mi-quang.jpg"
        },
        {
          "name": "Bánh bèo",
          "description": "Món bánh truyền thống Quảng Ngãi với bột gạo tinh khiết, nhân tôm thịt băm nhuyễn và nước mắm chua ngọt đặc biệt",
          "image": "assets/images/foods/banh-beo.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Đảo Lý Sơn",
          "description": "Đảo với nhiều danh thắng và đặc sản tỏi, nổi tiếng với Cổng Tò Vò, Hang Câu và các di tích lịch sử",
          "distance": "30km",
          "travelTime": "1 giờ đi tàu cao tốc"
        },
        {
          "name": "Núi Ấn - Sông Trà",
          "description": "Khu bảo tồn thiên nhiên với hệ sinh thái đa dạng, thác nước và cảnh quan núi rừng hùng vĩ",
          "distance": "25km",
          "travelTime": "45 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Mì Quảng gà",
          "description": "Mì Quảng với thịt gà ta thơm ngon, được chế biến theo công thức gia truyền",
          "restaurant": "Quán Mì Quảng Bà Mua - Đường Phan Đình Phùng",
          "price": "25000-35000 VND/tô"
        },
        {
          "name": "Bánh bèo chén",
          "description": "Bánh bèo với nhân tôm thịt thơm ngon, nước mắm pha chế đặc biệt",
          "restaurant": "Quán Bánh bèo Bà Bảy - Chợ Quảng Ngãi",
          "price": "20000-30000 VND/10 chén"
        }
      ]
    },
    {
      "id": "quang-nam",
      "name": "Phố cổ Hội An",
      "location": "Quảng Nam",
      "image": "assets/images/places/checkin-quang-nam.jpg",
      "description": "Di sản văn hóa thế giới với kiến trúc cổ độc đáo, nơi giao thoa văn hóa Đông - Tây qua nhiều thế kỷ, được mệnh danh là một trong những thành phố cổ đẹp nhất Đông Nam Á",
      "detailedDescription": "Hội An là đô thị cổ nằm ở tỉnh Quảng Nam, được UNESCO công nhận là Di sản Văn hóa Thế giới năm 1999. Thành phố này từng là thương cảng quốc tế sầm uất từ thế kỷ 16-17, nơi giao thương của thương nhân Nhật Bản, Trung Quốc, Bồ Đào Nha và Hà Lan. Ngày nay, Hội An vẫn giữ nguyên vẹn hơn 1.000 di tích kiến trúc cổ bao gồm nhà cổ, hội quán, đình, chùa, miếu, giếng cổ, và đặc biệt là chùa Cầu - biểu tượng của phố cổ. Mỗi tối, phố cổ lung linh trong ánh đèn lồng đủ màu sắc, tạo nên khung cảnh lãng mạn và cổ kính. Hội An không chỉ nổi tiếng với kiến trúc mà còn với nghề may đo truyền thống, ẩm thực đặc sắc như cao lầu, mì Quảng, và các hoạt động văn hóa nghệ thuật truyền thống.",
      "howToGet": "Từ sân bay Đà Nẵng đi taxi hoặc xe khách khoảng 30km đến Hội An. Có thể đi xe buýt từ bến xe Đà Nẵng hoặc thuê xe máy để khám phá thành phố. Từ ga Đà Nẵng cũng có nhiều xe khách chạy thẳng đến Hội An.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là từ tháng 2 đến tháng 4, khi thời tiết mát mẻ và ít mưa. Nên đến vào buổi chiều tối để tận hưởng không khí lãng mạn của phố cổ với đèn lồng và các hoạt động văn hóa. Đặc biệt vào đêm rằm hàng tháng, phố cổ tổ chức nhiều hoạt động truyền thống đặc sắc.",
      "attractions": {
        "cultural": [
          {
            "name": "Phố cổ Hội An",
            "description": "Khu phố cổ với kiến trúc truyền thống và đèn lồng rực rỡ, nơi bảo tồn nguyên vẹn những giá trị văn hóa, kiến trúc của một thương cảng cổ",
            "image": "assets/images/places/checkin-quang-nam.jpg"
          },
          {
            "name": "Chùa Cầu",
            "description": "Cây cầu cổ biểu tượng của Hội An, được xây dựng từ thế kỷ 17 bởi thương nhân Nhật Bản, kết hợp kiến trúc Nhật - Việt độc đáo",
            "image": "assets/images/places/chua-cau.jpg"
          }
        ],
        "historical": [
          {
            "name": "Nhà cổ Phùng Hưng",
            "description": "Ngôi nhà cổ với kiến trúc truyền thống, được bảo tồn nguyên vẹn với các chi tiết chạm khắc tinh xảo và nội thất cổ quý giá",
            "image": "assets/images/places/nha-co-phung-hung.jpg"
          },
          {
            "name": "Hội quán Phúc Kiến",
            "description": "Công trình kiến trúc đặc sắc của người Hoa với nghệ thuật chạm khắc và trang trí độc đáo",
            "image": "assets/images/places/hoi-quan-phuc-kien.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Cao lầu",
          "description": "Món mì đặc trưng của Hội An với sợi mì vàng được làm từ nước giếng cổ Bá Lễ, thịt xá xíu, rau sống và nước dùng đặc biệt",
          "image": "assets/images/foods/cao-lau.jpg"
        },
        {
          "name": "Bánh mì Phượng",
          "description": "Bánh mì nổi tiếng nhất Hội An, được Anthony Bourdain ca ngợi, với nhân đặc biệt và nước sốt bí truyền",
          "image": "assets/images/foods/banh-mi-phuong.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Làng gốm Thanh Hà",
          "description": "Làng nghề gốm truyền thống với lịch sử hơn 500 năm, nơi du khách có thể trải nghiệm làm gốm",
          "distance": "3km",
          "travelTime": "10 phút đi xe máy"
        },
        {
          "name": "Bãi biển An Bàng",
          "description": "Bãi biển đẹp gần phố cổ với cát trắng mịn, được CNN bình chọn là một trong những bãi biển đẹp nhất châu Á",
          "distance": "5km",
          "travelTime": "15 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cao lầu",
          "description": "Mì đặc sản chỉ có ở Hội An với sợi mì vàng đặc biệt và nước dùng độc đáo",
          "restaurant": "Quán Cao Lầu Thanh - Chợ Hội An",
          "price": "30000-45000 VND/tô"
        },
        {
          "name": "Bánh mì Phượng",
          "description": "Bánh mì nổi tiếng thế giới với công thức đặc biệt và nhiều loại nhân khác nhau",
          "restaurant": "Bánh Mì Phượng - 2B Phan Châu Trinh",
          "price": "20000-35000 VND/ổ"
        }
      ]
    },
    {
      "id": "hai-van-quan",
      "name": "Hải Vân Quan",
      "location": "Đà Nẵng - Thừa Thiên Huế",
      "image": "assets/images/places/checkin-hai-van-quan.jpg",
      "description": "Cửa ải lịch sử trên đèo Hải Vân, nơi được mệnh danh là 'thiên hạ đệ nhất hùng quan', điểm giao thoa giữa hai miền khí hậu và là ranh giới tự nhiên tuyệt đẹp giữa Đà Nẵng và Thừa Thiên Huế",
      "detailedDescription": "Hải Vân Quan là cửa ải cổ nằm trên đỉnh đèo Hải Vân ở độ cao 496m so với mực nước biển, là ranh giới tự nhiên giữa Đà Nẵng và Thừa Thiên Huế. Được xây dựng từ thế kỷ thứ XI và được tu sửa nhiều lần qua các triều đại, cổng thành này mang đậm dấu ấn kiến trúc thời Nguyễn với ba chữ 'Hải Vân Quan' được khắc trên cổng. Từ đây có thể ngắm toàn cảnh vịnh Đà Nẵng, bán đảo Sơn Trà một bên và vịnh Lăng Cô thơ mộng bên kia. Đèo Hải Vân được mệnh danh là 'đệ nhất thiên hạ hùng quan' bởi vẻ đẹp hùng vĩ và vị trí chiến lược quan trọng. Nơi đây còn lưu giữ nhiều di tích quân sự từ thời Pháp và Mỹ, tạo nên một điểm du lịch độc đáo kết hợp giữa lịch sử, văn hóa và cảnh quan thiên nhiên.",
      "howToGet": "Từ Đà Nẵng đi xe máy hoặc ô tô khoảng 30km theo quốc lộ 1A về phía Bắc. Có thể thuê xe máy hoặc tham gia tour du lịch từ Đà Nẵng hoặc Huế. Nên chọn phương tiện phù hợp vì đèo có nhiều khúc cua gắt.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là từ tháng 3 đến tháng 8, khi thời tiết nắng đẹp và ít sương mù. Nên đến vào sáng sớm để ngắm bình minh và tránh sương mù buổi chiều. Tránh đi vào mùa mưa (tháng 9-12) vì đường trơn trượt và hay có sương mù dày đặc.",
      "attractions": {
        "historical": [
          {
            "name": "Cửa ải Hải Vân",
            "description": "Di tích lịch sử với kiến trúc cổ và cảnh quan tuyệt đẹp, nơi còn lưu dấu tích của nhiều triều đại và là chứng nhân lịch sử quan trọng",
            "image": "assets/images/places/checkin-hai-van-quan.jpg"
          },
          {
            "name": "Pháo đài cổ",
            "description": "Công trình quân sự thời Pháp thuộc với hệ thống pháo đài, hầm trú ẩn và các công sự quân sự còn nguyên vẹn",
            "image": "assets/images/places/phao-dai-hai-van.jpg"
          }
        ],
        "natural": [
          {
            "name": "Đỉnh đèo Hải Vân",
            "description": "Điểm ngắm cảnh tuyệt đẹp với tầm nhìn bao quát vịnh Đà Nẵng và vịnh Lăng Cô, nơi giao thoa của hai miền khí hậu",
            "image": "assets/images/places/dinh-deo-hai-van.jpg"
          },
          {
            "name": "Rừng nguyên sinh",
            "description": "Khu rừng nguyên sinh với hệ sinh thái đa dạng và nhiều loài thực vật quý hiếm",
            "image": "assets/images/places/rung-hai-van.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Mì Quảng",
          "description": "Món mì đặc trưng miền Trung với sợi mì vàng, thịt gà, tôm, trứng và nước dùng đặc biệt, ăn kèm bánh tráng và rau sống",
          "image": "assets/images/foods/mi-quang.jpg"
        },
        {
          "name": "Bánh tráng cuốn thịt heo",
          "description": "Món ăn đặc sản Đà Nẵng với thịt heo nướng, rau sống và bánh tráng, chấm với nước mắm pha đặc biệt",
          "image": "assets/images/foods/banh-trang-cuon-thit-heo.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Bãi biển Lăng Cô",
          "description": "Bãi biển đẹp phía Bắc đèo với cát trắng mịn, nước trong xanh và cảnh quan hoang sơ",
          "distance": "15km",
          "travelTime": "25 phút đi xe máy"
        },
        {
          "name": "Bán đảo Sơn Trà",
          "description": "Khu bảo tồn thiên nhiên với rừng nguyên sinh, bãi biển đẹp và chùa Linh Ứng nổi tiếng",
          "distance": "20km",
          "travelTime": "40 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Mì Quảng gà",
          "description": "Mì Quảng với thịt gà ta và nước dùng đặc trưng của vùng Quảng Nam",
          "restaurant": "Quán Mì Quảng Bà Vị - Chân đèo Hải Vân",
          "price": "25000-35000 VND/tô"
        },
        {
          "name": "Bánh mì que",
          "description": "Bánh mì que nướng đặc sản với patê và ớt cay nồng, món ăn vặt được yêu thích",
          "restaurant": "Xe bánh mì que dì Hoa - Khu vực Hải Vân Quan",
          "price": "5000-10000 VND/cái"
        }
      ]
    },
    {
      "id": "quang-binh",
      "name": "Động Phong Nha",
      "location": "Quảng Bình",
      "image": "assets/images/places/checkin-quang-binh.jpg",
      "description": "Di sản thiên nhiên thế giới với hệ thống hang động kỳ vĩ",
      "detailedDescription": "Vườn quốc gia Phong Nha - Kẻ Bàng là di sản thiên nhiên thế giới với hệ thống hang động đá vôi lớn nhất thế giới. Nơi đây có cảnh quan thiên nhiên tuyệt đẹp và đa dạng sinh học phong phú.",
      "howToGet": "Từ Đồng Hới đi xe khách khoảng 50km đến Phong Nha. Có thể bay đến sân bay Đồng Hới từ Hà Nội hoặc TP.HCM.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là từ tháng 3 đến tháng 8, khi thời tiết thuận lợi cho việc khám phá hang động.",
      "attractions": {
        "natural": [
          {
            "name": "Động Phong Nha",
            "description": "Hang động với hệ thống sông ngầm và thạch nhũ tuyệt đẹp",
            "image": "assets/images/places/checkin-quang-binh.jpg"
          },
          {
            "name": "Động Thiên Đường",
            "description": "Hang động đẹp nhất thế giới",
            "image": "assets/images/places/dong-thien-duong.jpg"
          }
        ],
        "adventure": [
          {
            "name": "Sông Chày",
            "description": "Điểm chèo thuyền kayak và zipline",
            "image": "assets/images/places/song-chay.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Cháo canh",
          "description": "Món ăn đặc trưng Quảng Bình",
          "image": "assets/images/foods/chao-canh.jpg"
        },
        {
          "name": "Bánh lọc",
          "description": "Bánh gói lá chuối",
          "image": "assets/images/foods/banh-loc.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Bãi biển Nhật Lệ",
          "description": "Bãi biển đẹp của Đồng Hới",
          "distance": "45km",
          "image": "assets/images/places/bai-bien-nhat-le.jpg"
        },
        {
          "name": "Suối nước Moọc",
          "description": "Khu du lịch sinh thái",
          "distance": "10km",
          "image": "assets/images/places/suoi-nuoc-mooc.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cháo canh Quảng Bình",
          "description": "Món ăn truyền thống",
          "price": "25000-35000 VND/tô",
          "where": "Các quán ăn địa phương"
        },
        {
          "name": "Bánh lọc gói lá chuối",
          "description": "Bánh đặc sản",
          "price": "5000-10000 VND/cái",
          "where": "Chợ và các quán ăn vặt"
        }
      ]
    },
    {
      "id": "cho-rong-ninh-binh",
      "name": "Chợ Rồng Ninh Bình",
      "location": "Ninh Bình",
      "image": "assets/images/places/checkin-cho-rong-ninh-binh.jpg",
      "description": "Khu chợ truyền thống sầm uất",
      "detailedDescription": "Chợ Rồng là khu chợ truyền thống lớn nhất Ninh Bình, nơi tập trung buôn bán nhiều mặt hàng đặc sản địa phương. Chợ không chỉ là nơi giao thương mà còn là điểm gặp gỡ văn hóa của người dân địa phương.",
      "howToGet": "Chợ nằm ở trung tâm thành phố Ninh Bình, dễ dàng di chuyển bằng các phương tiện công cộng.",
      "bestTimeToVisit": "Chợ họp sớm nhất vào buổi sáng, đặc biệt nhộn nhịp vào các ngày cuối tuần.",
      "attractions": {
        "cultural": [
          {
            "name": "Khu chợ truyền thống",
            "description": "Nơi buôn bán sầm uất với nhiều đặc sản địa phương",
            "image": "assets/images/places/checkin-cho-rong-ninh-binh.jpg"
          },
          {
            "name": "Khu ẩm thực",
            "description": "Nơi thưởng thức các món ăn đặc sản",
            "image": "assets/images/places/khu-am-thuc-cho-rong.jpg"
          }
        ],
        "shopping": [
          {
            "name": "Khu bán đồ thủ công",
            "description": "Nơi bán các sản phẩm thủ công mỹ nghệ",
            "image": "assets/images/places/khu-thu-cong-cho-rong.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Cơm cháy Ninh Bình",
          "description": "Món ăn đặc sản nổi tiếng",
          "image": "assets/images/foods/com-chay.jpg"
        },
        {
          "name": "Nem chua Ninh Bình",
          "description": "Đặc sản nem chua truyền thống",
          "image": "assets/images/foods/nem-chua.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Tam Cốc - Bích Động",
          "description": "Danh thắng được mệnh danh là Hạ Long trên cạn",
          "distance": "7km",
          "image": "assets/images/places/tam-coc.jpg"
        },
        {
          "name": "Tràng An",
          "description": "Di sản văn hóa và thiên nhiên thế giới",
          "distance": "5km",
          "image": "assets/images/places/trang-an.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cơm cháy chà bông",
          "description": "Món ăn vặt đặc trưng",
          "price": "30000-50000 VND/phần",
          "where": "Các quầy ăn trong chợ"
        },
        {
          "name": "Nem chua Ninh Bình",
          "description": "Đặc sản nổi tiếng",
          "price": "100000-150000 VND/kg",
          "where": "Các cửa hàng đặc sản trong chợ"
        }
      ]
    },
    {
      "id": "mui-dien-phu-yen",
      "name": "Mũi Điện",
      "location": "Phú Yên",
      "image": "assets/images/places/checkin-mui-dien-phu-yen.png",
      "description": "Điểm cực Đông của Tổ quốc, nơi đón bình minh đầu tiên",
      "detailedDescription": "Mũi Điện (hay còn gọi là Mũi Đại Lãnh) thuộc địa phận xã Hòa Tâm, huyện Đông Hòa, tỉnh Phú Yên. Đây là một trong những điểm cực Đông của Tổ quốc, nơi đón ánh bình minh đầu tiên trên đất liền Việt Nam. Mũi Điện mang vẻ đẹp hoang sơ với biển xanh - cát trắng - núi đá, và Bãi Môn dưới chân mũi. Nơi đây có sự kết hợp hài hòa giữa rừng, núi, biển và trời. Mũi Điện từng là nơi quan trọng trong hành trình mở cõi về phía Nam, gần đó là Vịnh Vũng Rô - di tích lịch sử gắn liền với Đường mòn Hồ Chí Minh trên biển.",
      "howToGet": "Mũi Điện cách trung tâm TP Tuy Hòa khoảng 35-40km về phía Đông Nam.\n\nHướng dẫn đường đi:\n1. Từ trung tâm Tuy Hòa → chạy theo QL1A hướng Nam (về phía huyện Đông Hòa)\n2. Rẽ trái tại ngã ba Hòa Hiệp Trung\n3. Đi theo đường DT29 (hướng về Vũng Rô – Mũi Điện)\n4. Chạy qua đèo Cả\n5. Qua cảng Vũng Rô\n6. Tới chân hải đăng Mũi Điện\n7. Gửi xe ở bãi, đi bộ leo khoảng 15-20 phút lên đỉnh\n\nThông tin thêm:\n- Tổng thời gian di chuyển: 1-1.5 giờ\n- Thuê xe máy tại Tuy Hòa: 120.000-150.000đ/ngày\n- Tour trọn gói: 300.000-500.000đ/người (xe đưa đón, hướng dẫn viên)\n\nLưu ý:\n- Nên đi sáng sớm để ngắm bình minh\n- Mang giày thể thao\n- Mang theo nước uống và kem chống nắng",
      "bestTimeToVisit": "Thời điểm đẹp nhất là từ tháng 3 đến tháng 8, đặc biệt là lúc bình minh.",
      "attractions": {
        "natural": [
          {
            "name": "Hải đăng Mũi Điện",
            "description": "Ngọn hải đăng lâu đời xây từ năm 1890, là điểm nhấn mang tính biểu tượng. Du khách có thể leo lên hải đăng để ngắm toàn cảnh",
            "image": "assets/images/places/checkin-mui-dien-phu-yen.png"
          },
          {
            "name": "Bãi Môn",
            "description": "Bãi biển hoang sơ dưới chân mũi với cát trắng và nước biển trong xanh, lý tưởng để tắm biển và cắm trại",
            "image": "assets/images/places/bai-bien-mui-dien.jpg"
          },
          {
            "name": "Cột mốc điểm cực Đông",
            "description": "Điểm đánh dấu cực Đông đất liền Việt Nam, nơi chụp hình kỷ niệm không thể bỏ qua",
            "image": "assets/images/places/cot-moc-cuc-dong.jpg"
          }
        ],
        "historical": [
          {
            "name": "Hải đăng cổ từ 1890",
            "description": "Công trình kiến trúc thời Pháp với lịch sử hơn 130 năm, biểu tượng của Mũi Điện",
            "image": "assets/images/places/hai-dang-co.jpg"
          },
          {
            "name": "Vịnh Vũng Rô",
            "description": "Di tích lịch sử gắn liền với Đường mòn Hồ Chí Minh trên biển, nơi có cảng cá và tàu thuyền cập bến",
            "image": "assets/images/places/vinh-vung-ro.jpg"
          }
        ],
        "entertainment": [
          {
            "name": "Ngắm bình minh",
            "description": "Trải nghiệm đón ánh bình minh đầu tiên trên đất liền Việt Nam, tuyệt đẹp vào sáng sớm",
            "image": "assets/images/places/binh-minh-mui-dien.jpg"
          },
          {
            "name": "Cắm trại qua đêm",
            "description": "Cắm trại trên bãi biển để trải nghiệm không gian hoang sơ và ngắm sao đêm",
            "image": "assets/images/places/cam-trai-mui-dien.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Hải sản tươi sống",
          "description": "Tôm hùm, cá mú, mực nướng, sò huyết, sò điệp, ốc hương hấp sả tại Bãi Môn và cảng Vũng Rô",
          "image": "assets/images/foods/hai-san-tuoi-song.jpg"
        },
        {
          "name": "Cơm gà Phú Yên",
          "description": "Đặc sản nổi tiếng với gà thơm ngon và cơm dẻo, có thể ăn ở Tuy Hòa",
          "image": "assets/images/foods/com-ga-phu-yen.jpg"
        },
        {
          "name": "Bánh canh hẹ",
          "description": "Món đặc trưng Phú Yên với nước dùng ngọt, nhiều hẹ và chả cá",
          "image": "assets/images/foods/banh-canh-he.jpg"
        },
        {
          "name": "Bánh xèo mực",
          "description": "Mực nhỏ tươi nguyên con cho vào bánh xèo, ăn với rau sống",
          "image": "assets/images/foods/banh-xeo-muc.jpg"
        },
        {
          "name": "Chả dông",
          "description": "Đặc sản ít nơi có, làm từ thịt con dông (giống kỳ nhông) - đặc sản của vùng đất cát",
          "image": "assets/images/foods/cha-dong.jpg"
        },
        {
          "name": "Mực một nắng",
          "description": "Đặc sản hải sản Phú Yên được phơi khô một nắng",
          "image": "assets/images/foods/muc-mot-nang.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Gành Đá Đĩa",
          "description": "Thắng cảnh với những khối đá hình lục giác",
          "distance": "20km",
          "image": "assets/images/places/ganh-da-dia.jpg"
        },
        {
          "name": "Bãi Xép",
          "description": "Bãi biển hoang sơ nổi tiếng",
          "distance": "15km",
          "image": "assets/images/places/bai-xep.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Hải sản tươi sống",
          "description": "Tôm hùm, cá mú, mực nướng tươi ngon từ biển",
          "restaurant": "Các quán hải sản tại Bãi Môn và cảng Vũng Rô",
          "price": "200000-500000 VND/phần"
        },
        {
          "name": "Cơm gà Thiên Hương",
          "description": "Cơm gà Phú Yên nổi tiếng tại Tuy Hòa",
          "restaurant": "Cơm Gà Thiên Hương và Cơm Gà Tuyết Nhung",
          "price": "40000-60000 VND/phần"
        },
        {
          "name": "Bánh canh hẹ Bà Dưỡng",
          "description": "Món đặc trưng với nước dùng ngọt và nhiều hẹ",
          "restaurant": "Bánh canh hẹ Bà Dưỡng và Bánh canh hẹ Nhiên ở Tuy Hòa",
          "price": "25000-35000 VND/tô"
        },
        {
          "name": "Bánh xèo mực",
          "description": "Bánh xèo với mực tươi nguyên con, ăn kèm rau sống",
          "restaurant": "Các quán ven biển và chợ địa phương gần Vũng Rô",
          "price": "30000-50000 VND/phần"
        },
        {
          "name": "Chả dông",
          "description": "Đặc sản hiếm, ăn kèm bún và rau sống với nước mắm chua ngọt",
          "restaurant": "Các quán ăn địa phương chuyên về đặc sản",
          "price": "80000-120000 VND/phần"
        },
        {
          "name": "Lẩu cá mú/cá bớp",
          "description": "Lẩu hải sản tươi ngon cho nhóm đông người",
          "restaurant": "Các quán ven biển gần cảng Vũng Rô",
          "price": "300000-500000 VND/nồi"
        },
        {
          "name": "Nước dừa ven biển",
          "description": "Nước dừa tươi mát giải khát",
          "restaurant": "Các chỗ dừng chân dọc đường đến Mũi Điện",
          "price": "15000-25000 VND/quả"
        },
        {
          "name": "Mực một nắng nướng",
          "description": "Đặc sản mực khô nướng thơm ngon",
          "restaurant": "Các quán hải sản ven biển",
          "price": "150000-200000 VND/phần"
        }
      ]
    },
    {
      "id": "co-do-hue",
      "name": "Cố đô Huế",
      "location": "Thừa Thiên Huế",
      "image": "assets/images/places/checkin-co-do-hue.jpg",
      "description": "Di sản văn hóa thế giới UNESCO, kinh đô cuối cùng của triều đại phong kiến Việt Nam, nơi lưu giữ những giá trị văn hóa, kiến trúc và nghệ thuật độc đáo của dân tộc qua hơn 400 năm lịch sử",
      "detailedDescription": "Cố đô Huế là quần thể di tích rộng lớn bao gồm Kinh thành Huế, các lăng tẩm vua chúa và nhiều công trình kiến trúc độc đáo khác. Được UNESCO công nhận là Di sản Văn hóa Thế giới năm 1993, Huế là minh chứng sống động cho sự phát triển của kiến trúc cung đình và nghệ thuật Việt Nam thời Nguyễn (1802-1945). Kinh thành Huế được xây dựng theo mô hình 'Kinh đô kép' với Hoàng thành và Tử cấm thành bên trong, được bao bọc bởi hệ thống thành quách, hào nước kiên cố. Ngoài ra, quần thể còn bao gồm các lăng tẩm của các vị vua triều Nguyễn, mỗi lăng là một công trình nghệ thuật độc đáo với kiến trúc hài hòa giữa cảnh quan thiên nhiên và nhân tạo. Đặc biệt, Huế còn nổi tiếng với ẩm thực cung đình tinh tế, nghệ thuật ca Huế truyền thống và những khu vườn ngự uyển tuyệt đẹp.",
      "howToGet": "Có thể đến Huế bằng máy bay (sân bay Phú Bài), tàu hỏa (ga Huế) hoặc xe khách. Từ sân bay về trung tâm khoảng 15km, có thể đi taxi hoặc xe buýt. Trong nội thành, có thể thuê xe đạp hoặc xe máy để tham quan các điểm di tích.",
      "bestTimeToVisit": "Thời điểm lý tưởng nhất là từ tháng 1 đến tháng 4, khi thời tiết mát mẻ và ít mưa. Tháng 4 đến tháng 6 thường nóng nhưng là dịp diễn ra Festival Huế. Nên tránh mùa mưa (tháng 10-12). Buổi sáng sớm hoặc chiều tối là thời điểm đẹp nhất để chụp ảnh các di tích.",
      "attractions": {
        "historical": [
          {
            "name": "Đại Nội - Hoàng thành Huế",
            "description": "Trung tâm chính trị của triều Nguyễn với kiến trúc độc đáo, bao gồm Ngọ Môn, điện Thái Hòa, Tử Cấm Thành và các công trình quan trọng khác",
            "image": "assets/images/places/dai-noi-hue.jpg"
          },
          {
            "name": "Lăng Tự Đức",
            "description": "Công trình kiến trúc tuyệt đẹp, là nơi an nghỉ của vị vua thi sĩ, được thiết kế như một khu vườn thơ mộng với hồ nước, đình tạ và các công trình nghệ thuật",
            "image": "assets/images/places/lang-tu-duc.jpg"
          }
        ],
        "religious": [
          {
            "name": "Chùa Thiên Mụ",
            "description": "Ngôi chùa cổ nhất Huế với tháp Phước Duyên bảy tầng nổi tiếng, biểu tượng văn hóa và tâm linh của cố đô, nơi hội tụ giữa kiến trúc tôn giáo và cảnh quan thiên nhiên tuyệt đẹp bên dòng sông Hương thơ mộng",
            "image": "assets/images/places/checkin-chua-thien-mu.jpg"
          },
          {
            "name": "Điện Hòn Chén",
            "description": "Đền thờ Thiên Y A Na với kiến trúc độc đáo, nơi diễn ra lễ hội tế đàn hàng năm vào tháng 7 âm lịch",
            "image": "assets/images/places/dien-hon-chen.jpg"
          }
        ],
        "cultural": [
          {
            "name": "Vườn ngự uyển",
            "description": "Khu vườn hoàng gia với kiến trúc tinh tế, nơi các vua chúa thời Nguyễn nghỉ ngơi và thưởng ngoạn",
            "image": "assets/images/places/vuon-ngu-uyen.jpg"
          },
          {
            "name": "Bảo tàng Cổ vật Cung đình Huế",
            "description": "Nơi trưng bày các hiện vật quý giá thời Nguyễn, từ đồ dùng hoàng gia đến các tác phẩm nghệ thuật độc đáo",
            "image": "assets/images/places/bao-tang-co-vat.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Cơm hến",
          "description": "Món ăn dân dã đặc trưng của Huế, được chế biến từ hến sông Hương, ăn kèm với rau sống, bánh tráng và nước mắm cay",
          "image": "assets/images/foods/com-hen.jpg"
        },
        {
          "name": "Bún bò Huế",
          "description": "Món bún nổi tiếng với nước dùng đậm đà, thịt bò, giò heo và các gia vị đặc trưng của xứ Huế",
          "image": "assets/images/foods/bun-bo-hue.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Đầm Chuồn",
          "description": "Khu đầm phá tự nhiên với làng chài truyền thống, nơi thưởng thức hải sản tươi sống và ngắm hoàng hôn đẹp",
          "distance": "15km",
          "travelTime": "30 phút đi xe máy"
        },
        {
          "name": "Biển Thuận An",
          "description": "Bãi biển đẹp với cát trắng mịn, nước trong xanh và nhiều nhà hàng hải sản nổi tiếng",
          "distance": "12km",
          "travelTime": "25 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Bún bò Huế",
          "description": "Món bún bò truyền thống với nước dùng đậm đà và gia vị đặc trưng xứ Huế",
          "restaurant": "Bún bò Bà Mỹ - 17 Huỳnh Thúc Kháng",
          "price": "40000-55000 VND/tô"
        },
        {
          "name": "Bánh khoái Huế",
          "description": "Bánh khoái giòn với nhân tôm thịt và nước chấm đặc biệt",
          "restaurant": "Bánh khoái Lạc Thiện - 6 Đinh Tiên Hoàng",
          "price": "25000-35000 VND/cái"
        }
      ]
    },
    {
      "id": "chua-thien-mu",
      "name": "Chùa Thiên Mụ",
      "location": "Thừa Thiên Huế",
      "image": "assets/images/places/checkin-chua-thien-mu.jpg",
      "description": "Ngôi chùa cổ nhất xứ Huế với tháp Phước Duyên bảy tầng nổi tiếng, biểu tượng văn hóa và tâm linh của cố đô, nơi hội tụ giữa kiến trúc tôn giáo và cảnh quan thiên nhiên tuyệt đẹp bên dòng sông Hương thơ mộng",
      "detailedDescription": "Chùa Thiên Mụ, còn gọi là chùa Linh Mụ, được xây dựng vào năm 1601 dưới triều chúa Nguyễn Hoàng. Tọa lạc trên đồi Hà Khê, bên bờ sông Hương, chùa không chỉ là một công trình kiến trúc tôn giáo độc đáo mà còn là chứng nhân lịch sử của nhiều sự kiện quan trọng. Điểm nhấn của chùa là tháp Phước Duyên bảy tầng cao 21m, được xây dựng năm 1844 dưới triều vua Thiệu Trị, mỗi tầng thờ một vị Phật khác nhau. Ngoài ra, chùa còn có nhiều công trình kiến trúc quan trọng như điện Đại Hùng, nhà Thuyết Pháp, lầu chuông, lầu trống và khu vườn cảnh với những cây cổ thụ hàng trăm năm tuổi. Đặc biệt, chùa còn lưu giữ chiếc xe Austin màu xanh gắn liền với sự kiện lịch sử năm 1963. Hàng năm, chùa tổ chức nhiều lễ hội Phật giáo quan trọng, thu hút hàng nghìn Phật tử và du khách thập phương.",
      "howToGet": "Từ trung tâm thành phố Huế đi khoảng 5km theo đường Kim Long hoặc đường Lê Duẩn. Có thể đi xe máy, taxi hoặc tham gia tour du lịch sông Hương bằng thuyền. Từ bến thuyền trung tâm đi thuyền khoảng 30 phút để đến chùa.",
      "bestTimeToVisit": "Có thể tham quan quanh năm, nhưng đẹp nhất là vào buổi sáng sớm hoặc chiều tà khi thời tiết mát mẻ. Tháng 1-2 (dịp Tết) và tháng 4 (lễ Phật Đản) là thời điểm chùa tổ chức nhiều lễ hội đặc sắc. Nên tránh giờ trưa nắng nóng và mùa mưa (tháng 10-12).",
      "attractions": {
        "religious": [
          {
            "name": "Tháp Phước Duyên",
            "description": "Tháp bảy tầng cao 21m, biểu tượng của chùa Thiên Mụ, được xây dựng năm 1844 với kiến trúc độc đáo và ý nghĩa tâm linh sâu sắc",
            "image": "assets/images/places/thap-phuoc-duyen.jpg"
          },
          {
            "name": "Điện Đại Hùng",
            "description": "Điện thờ chính của chùa với tượng Phật trang nghiêm và kiến trúc truyền thống, nơi diễn ra các nghi lễ quan trọng",
            "image": "assets/images/places/dien-dai-hung.jpg"
          }
        ],
        "historical": [
          {
            "name": "Xe Austin lịch sử",
            "description": "Chiếc xe Austin màu xanh gắn liền với sự kiện lịch sử năm 1963, được bảo quản nguyên vẹn trong khuôn viên chùa",
            "image": "assets/images/places/xe-austin.jpg"
          },
          {
            "name": "Bảo tháp Tổ",
            "description": "Nơi thờ các vị cao tăng đã từng trụ trì tại chùa, công trình mang đậm kiến trúc Phật giáo truyền thống",
            "image": "assets/images/places/bao-thap-to.jpg"
          }
        ],
        "natural": [
          {
            "name": "Vườn cảnh quan",
            "description": "Khu vườn với nhiều cây cổ thụ hàng trăm năm tuổi, tạo nên không gian thanh tịnh và mát mẻ",
            "image": "assets/images/places/vuon-canh-quan.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Chè Huế",
          "description": "Các loại chè truyền thống của Huế được chế biến tinh tế, đặc biệt là chè khoai tía và chè bột lọc",
          "image": "assets/images/foods/che-hue.jpg"
        },
        {
          "name": "Cơm chay",
          "description": "Các món ăn chay được chế biến công phu theo phong cách Phật giáo, đảm bảo dinh dưỡng và thanh tịnh",
          "image": "assets/images/foods/com-chay.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Điện Hòn Chén",
          "description": "Đền thờ cổ nằm bên bờ sông Hương, nơi diễn ra lễ hội tế đàn truyền thống",
          "distance": "3km",
          "travelTime": "10 phút đi xe máy"
        },
        {
          "name": "Lăng Tự Đức",
          "description": "Lăng tẩm của vị vua thi sĩ triều Nguyễn với kiến trúc tinh tế và cảnh quan thơ mộng",
          "distance": "5km",
          "travelTime": "15 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cơm chay Thiên Mụ",
          "description": "Bữa cơm chay thanh tịnh với các món ăn được chế biến từ rau củ tươi và đậu phụ",
          "restaurant": "Nhà hàng chay Thiên Mụ - Trong khuôn viên chùa",
          "price": "35000-50000 VND/suất"
        },
        {
          "name": "Chè khoai tía",
          "description": "Món chè truyền thống của Huế với khoai tía thơm ngon và nước cốt dừa béo ngậy",
          "restaurant": "Quán chè Hương - Đối diện cổng chùa",
          "price": "15000-25000 VND/chén"
        }
      ]
    },
    {
      "id": "lang-tu-duc",
      "name": "Lăng Tự Đức",
      "location": "Thừa Thiên Huế",
      "image": "assets/images/places/checkin-lang-tu-duc.jpg",
      "description": "Quần thể lăng tẩm đẹp nhất và lãng mạn nhất trong các lăng tẩm nhà Nguyễn, nơi an nghỉ của vị vua thi sĩ Tự Đức, là kiệt tác kiến trúc hài hòa giữa cảnh quan thiên nhiên và bàn tay con người",
      "customSection": {
        "title": "Vua Tự Đức - Vị Hoàng Đế Thi Sĩ",
        "content": "Nguyễn Phúc Hồng Nhậm (1829-1883), tức vua Tự Đức, là vị hoàng đế thứ 4 và là người trị vì lâu nhất của triều đại nhà Nguyễn. Ông nổi tiếng là một vị vua thi sĩ với hơn 4.000 bài thơ, một nhà văn hóa uyên thâm và là người có tầm nhìn nghệ thuật độc đáo. Dù trị vì trong thời kỳ đất nước gặp nhiều khó khăn trước sự xâm lược của thực dân Pháp, vua Tự Đức vẫn để lại dấu ấn sâu đậm trong lịch sử văn hóa Việt Nam. Ông nổi tiếng với đức tính khiêm nhường, thường tự xưng là 'quả nhân', và có tình yêu đặc biệt với thiên nhiên. Lăng tẩm của ông không chỉ là nơi an nghỉ mà còn là một công viên thơ ca, nơi ông thường xuyên lui tới để ngao du, sáng tác và thưởng ngoạn khi còn sống."
      },
      "detailedDescription": "Lăng Tự Đức được xây dựng từ năm 1864 đến 1867, là nơi an nghỉ của vua Tự Đức - vị vua trị vì lâu nhất triều Nguyễn (1847-1883). Quần thể lăng rộng 12 ha được thiết kế như một công viên thu nhỏ với hơn 50 công trình kiến trúc. Đặc biệt, đây là lăng tẩm duy nhất được vua sử dụng làm nơi nghỉ ngơi, làm việc và ngao du thưởng ngoạn khi còn sống. Kiến trúc lăng thể hiện sự hài hòa tuyệt đối giữa cảnh quan thiên nhiên và nhân tạo, với hồ Lưu Khiêm, đảo Tiểu Trung Châu, các điện thờ, nhà bia, và vườn thơ Xung Khiêm. Mỗi công trình đều mang tên gọi thể hiện đức tính khiêm nhường của vua Tự Đức. Nơi đây còn lưu giữ nhiều bài thơ do chính vua sáng tác, khắc trên bia đá, phản ánh tâm hồn nghệ sĩ và triết lý sống của ông.",
      "howToGet": "Từ trung tâm thành phố Huế đi khoảng 7km theo đường Lê Ngô Cát hoặc đường Nam Giao. Có thể đi xe máy, taxi hoặc tham gia tour tham quan lăng tẩm. Nên thuê hướng dẫn viên để hiểu rõ hơn về lịch sử và ý nghĩa của các công trình.",
      "bestTimeToVisit": "Thời điểm lý tưởng là từ tháng 2 đến tháng 4, khi thời tiết mát mẻ và hoa nở rộ. Nên đến vào buổi sáng sớm hoặc chiều tà để tránh nắng nóng và có ánh sáng đẹp cho việc chụp ảnh. Tránh thời điểm mưa nhiều (tháng 10-12) vì đường trơn trượt và khó tham quan.",
      "attractions": {
        "historical": [
          {
            "name": "Điện Khiêm Cung",
            "description": "Nơi vua Tự Đức làm việc và nghỉ ngơi khi còn sống, với kiến trúc tinh tế và nội thất quý giá thời Nguyễn",
            "image": "assets/images/places/dien-khiem-cung.jpg"
          },
          {
            "name": "Bia Khiêm Cung",
            "description": "Bia đá khắc bài văn do chính vua Tự Đức soạn, kể về cuộc đời và triều đại của mình với giọng văn khiêm nhường",
            "image": "assets/images/places/bia-khiem-cung.jpg"
          }
        ],
        "architectural": [
          {
            "name": "Vườn Xung Khiêm",
            "description": "Khu vườn thơ mộng với hồ nước, cầu nhỏ và đình tạ, nơi vua thường ngâm thơ và thưởng ngoạn",
            "image": "assets/images/places/vuon-xung-khiem.jpg"
          },
          {
            "name": "Lầu Hữu Phối",
            "description": "Công trình kiến trúc độc đáo dùng làm nơi thờ các phi tần của vua, thể hiện nghệ thuật kiến trúc tinh xảo thời Nguyễn",
            "image": "assets/images/places/lau-huu-phoi.jpg"
          }
        ],
        "natural": [
          {
            "name": "Hồ Lưu Khiêm",
            "description": "Hồ nước nhân tạo rộng lớn với đảo Tiểu Trung Châu ở giữa, tạo nên cảnh quan thơ mộng và yên bình",
            "image": "assets/images/places/ho-luu-khiem.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Trà sen Tự Đức",
          "description": "Trà ướp sen theo phương pháp cổ truyền của cung đình Huế, thơm ngon và tinh tế",
          "image": "assets/images/foods/tra-sen.jpg"
        },
        {
          "name": "Bánh đặc sản Huế",
          "description": "Các loại bánh truyền thống như bánh khoái, bánh bèo, bánh nậm được chế biến theo công thức cung đình",
          "image": "assets/images/foods/banh-hue.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Lăng Khải Định",
          "description": "Lăng tẩm độc đáo với kiến trúc kết hợp Đông - Tây, nổi tiếng với các họa tiết trang trí công phu",
          "distance": "4km",
          "travelTime": "15 phút đi xe máy"
        },
        {
          "name": "Chùa Thiên Mụ",
          "description": "Ngôi chùa cổ nổi tiếng với tháp Phước Duyên bảy tầng, biểu tượng của thành phố Huế",
          "distance": "5km",
          "travelTime": "20 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cơm hến",
          "description": "Món ăn dân dã đặc trưng của Huế với hến sông Hương và các gia vị đặc biệt",
          "restaurant": "Quán cơm hến Hoa Đông - Đường Nguyễn Sinh Cung",
          "price": "25000-35000 VND/phần"
        },
        {
          "name": "Chè Huế",
          "description": "Các loại chè truyền thống được chế biến tinh tế theo phong cách cung đình",
          "restaurant": "Chè Hẻm - Kiệt Đội Cung",
          "price": "15000-25000 VND/chén"
        }
      ]
    },
    {
      "id": "lang-khai-dinh",
      "name": "Lăng Khải Định",
      "location": "Thừa Thiên Huế",
      "image": "assets/images/places/checkin-lang-khai-dinh.jpg",
      "description": "Công trình kiến trúc độc đáo nhất trong các lăng tẩm nhà Nguyễn, nơi hội tụ giữa nghệ thuật Đông - Tây với những họa tiết trang trí tinh xảo và phong cách kiến trúc pha trộn độc đáo",
      "detailedDescription": "Lăng Khải Định được xây dựng từ năm 1920 đến 1931, là nơi an nghỉ của vua Khải Định - vị vua thứ 12 của triều Nguyễn. Đây là lăng tẩm duy nhất được xây dựng bằng bê tông cốt thép, với kiến trúc độc đáo kết hợp giữa phong cách Gothic, Baroque của phương Tây và nghệ thuật trang trí truyền thống của phương Đông. Lăng được xây dựng trên núi Chung Sơn với 127 bậc đá dẫn lên, gồm ba tầng chính: Tầng 1 là sân Thiên Điện, tầng 2 là điện Thiên Định, và tầng 3 là cung Ứng Lăng. Đặc biệt, nội thất của điện Thiên Định được trang trí cực kỳ công phu với các bức tranh khảm sứ, thủy tinh màu và gốm sứ quý, tạo nên một không gian nghệ thuật độc đáo. Trần điện được trang trí 9 con rồng uốn lượn tinh xảo, tượng trưng cho 9 đời vua nhà Nguyễn.",
      "howToGet": "Từ trung tâm thành phố Huế đi khoảng 10km theo đường Lê Ngô Cát hoặc đường Nam Giao. Có thể đi xe máy, taxi hoặc tham gia tour tham quan lăng tẩm. Nên thuê xe ôm hoặc taxi vì đường lên lăng khá dốc.",
      "bestTimeToVisit": "Thời điểm lý tưởng là từ tháng 2 đến tháng 4, khi thời tiết mát mẻ và trong lành. Nên đến vào buổi sáng sớm để tránh nắng nóng và đông khách. Ánh sáng buổi sáng cũng tốt nhất để ngắm các chi tiết trang trí và chụp ảnh. Tránh những ngày mưa vì đường dốc sẽ trơn trượt.",
      "attractions": {
        "architectural": [
          {
            "name": "Điện Thiên Định",
            "description": "Công trình chính của lăng với kiến trúc độc đáo, nổi tiếng với trần nhà được trang trí 9 con rồng và các bức tranh khảm sứ công phu",
            "image": "assets/images/places/dien-thien-dinh.jpg"
          },
          {
            "name": "Cung Ứng Lăng",
            "description": "Nơi đặt long vị và bài vị của vua Khải Định, được trang trí lộng lẫy với nhiều họa tiết tinh xảo",
            "image": "assets/images/places/cung-ung-lang.jpg"
          }
        ],
        "decorative": [
          {
            "name": "Tranh khảm sứ",
            "description": "Bộ sưu tập tranh khảm sứ độc đáo với hơn 2000 bức tranh được làm từ mảnh sứ và thủy tinh màu",
            "image": "assets/images/places/tranh-kham-su.jpg"
          },
          {
            "name": "Tượng đồng vua Khải Định",
            "description": "Tượng đồng của vua được đúc tại Pháp, là tác phẩm điêu khắc quý giá với độ tinh xảo cao",
            "image": "assets/images/places/tuong-khai-dinh.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Bánh bột lọc Huế",
          "description": "Bánh trong suốt nhân tôm thịt, đặc sản truyền thống của xứ Huế được gói trong lá chuối",
          "image": "assets/images/foods/banh-bot-loc.jpg"
        },
        {
          "name": "Bánh khoái Huế",
          "description": "Bánh đặc sản với vỏ giòn, nhân tôm thịt và trứng, ăn kèm rau sống và nước chấm đặc biệt",
          "image": "assets/images/foods/banh-khoai.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Lăng Tự Đức",
          "description": "Lăng tẩm lãng mạn nhất trong các lăng tẩm nhà Nguyễn, nổi tiếng với cảnh quan thơ mộng",
          "distance": "4km",
          "travelTime": "15 phút đi xe máy"
        },
        {
          "name": "Làng hương Thủy Xuân",
          "description": "Làng nghề truyền thống nổi tiếng với nghề làm hương, tạo nên những nén hương thơm nổi tiếng xứ Huế",
          "distance": "3km",
          "travelTime": "10 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Bánh bột lọc Huyền Anh",
          "description": "Bánh bột lọc truyền thống với nhân tôm thịt đậm đà, được gói trong lá chuối tươi",
          "restaurant": "Quán Huyền Anh - Đường Hùng Vương",
          "price": "30000-40000 VND/10 cái"
        },
        {
          "name": "Bánh khoái Lạc Thiện",
          "description": "Bánh khoái giòn rụm với nhân tôm thịt và trứng, nước chấm đặc biệt",
          "restaurant": "Quán Lạc Thiện - 6 Đinh Tiên Hoàng",
          "price": "25000-35000 VND/cái"
        }
      ]
    },
    {
      "id": "dai-noi-hue",
      "name": "Đại Nội Huế",
      "location": "Thừa Thiên Huế",
      "image": "assets/images/places/checkin-dai-noi-hue.jpg",
      "description": "Trung tâm quyền lực của triều Nguyễn và là quần thể di tích hoàng cung đồ sộ nhất Việt Nam, nơi lưu giữ những giá trị văn hóa, kiến trúc và lịch sử độc đáo của triều đại phong kiến cuối cùng",
      "detailedDescription": "Đại Nội Huế, hay còn gọi là Hoàng thành Huế, được xây dựng từ năm 1805 dưới triều vua Gia Long và hoàn thiện vào năm 1832 dưới triều vua Minh Mạng. Quần thể này bao gồm Kinh thành (chu vi 10km), Hoàng thành và Tử Cấm thành với hơn 100 công trình kiến trúc đặc sắc. Kinh thành được bao bọc bởi hệ thống thành lũy kiên cố với 10 cổng thành, trong đó Ngọ Môn là cổng chính phía Nam dành cho vua. Bên trong Tử Cấm thành có điện Thái Hòa - nơi vua thiết triều, Cung Diên Thọ - nơi ở của Hoàng thái hậu, Cung Trường Sanh - nơi ở của Hoàng thái hậu về hưu, và nhiều cung điện khác. Đặc biệt, kiến trúc nơi đây thể hiện rõ tư tưởng phong thủy và triết học phương Đông, với trục chính Nam-Bắc và các công trình được bố trí hài hòa, cân đối.",
      "howToGet": "Từ trung tâm thành phố Huế có thể đi bộ hoặc đi xe khoảng 10 phút. Cổng chính của Đại Nội (Ngọ Môn) nằm trên đường Lê Duẩn. Có thể thuê xe đạp hoặc tham gia tour tham quan có hướng dẫn viên để hiểu rõ hơn về lịch sử và ý nghĩa của các công trình.",
      "bestTimeToVisit": "Thời điểm lý tưởng là từ tháng 2 đến tháng 4, khi thời tiết mát mẻ và ít mưa. Nên đến sớm vào buổi sáng (7-9h) để tránh nắng nóng và đông khách. Dịp Festival Huế (thường tổ chức vào tháng 4 hoặc tháng 6) là thời điểm có nhiều hoạt động văn hóa đặc sắc.",
      "attractions": {
        "historical": [
          {
            "name": "Ngọ Môn",
            "description": "Cổng chính của Hoàng thành với kiến trúc độc đáo gồm 5 cửa và lầu Ngũ Phụng, nơi vua quan sát các lễ hội và duyệt binh",
            "image": "assets/images/places/ngo-mon.jpg"
          },
          {
            "name": "Điện Thái Hòa",
            "description": "Nơi vua thiết triều và tổ chức các nghi lễ quan trọng, nổi tiếng với 80 cột sơn son thếp vàng và kiến trúc cung đình tinh xảo",
            "image": "assets/images/places/dien-thai-hoa.jpg"
          }
        ],
        "architectural": [
          {
            "name": "Thế Miếu",
            "description": "Nơi thờ các vị vua triều Nguyễn, với kiến trúc trang nghiêm và những tấm bia đá ghi chép công trạng các vị vua",
            "image": "assets/images/places/the-mieu.jpg"
          },
          {
            "name": "Cửu Đỉnh",
            "description": "Chín đỉnh đồng lớn đúc dưới triều Minh Mạng, biểu tượng quyền lực của hoàng gia và là báu vật quốc gia",
            "image": "assets/images/places/cuu-dinh.jpg"
          }
        ],
        "cultural": [
          {
            "name": "Bảo tàng Cổ vật Hoàng cung",
            "description": "Trưng bày các hiện vật quý giá thời Nguyễn như ngọc ấn, đồ thờ cúng, trang phục hoàng gia",
            "image": "assets/images/places/bao-tang-co-vat.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Cơm hến",
          "description": "Món ăn dân dã đặc trưng của Huế, được chế biến từ hến sông Hương, ăn kèm các loại rau thơm và gia vị đặc biệt",
          "image": "assets/images/foods/com-hen.jpg"
        },
        {
          "name": "Bánh bèo Huế",
          "description": "Bánh truyền thống làm từ bột gạo, ăn kèm tôm khô, mỡ hành và nước mắm chua ngọt",
          "image": "assets/images/foods/banh-beo.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Sông Hương",
          "description": "Dòng sông thơ mộng chảy qua thành phố, nơi lý tưởng để đi thuyền ngắm cảnh và thưởng thức ca Huế",
          "distance": "0.2km",
          "travelTime": "5 phút đi bộ"
        },
        {
          "name": "Chợ Đông Ba",
          "description": "Khu chợ truyền thống lớn nhất Huế, nơi bán các đặc sản và đồ thủ công mỹ nghệ",
          "distance": "1km",
          "travelTime": "15 phút đi bộ"
        }
      ],
      "recommendedFood": [
        {
          "name": "Bún bò Huế",
          "description": "Món bún bò truyền thống với nước dùng đậm đà và gia vị đặc trưng xứ Huế",
          "restaurant": "Bún bò Mụ Rơi - 11 Trương Định",
          "price": "40000-55000 VND/tô"
        },
        {
          "name": "Bánh khoái",
          "description": "Bánh đặc sản với vỏ giòn, nhân tôm thịt và nước chấm đặc biệt",
          "restaurant": "Bánh khoái Hạnh - 11 Phó Đức Chính",
          "price": "25000-35000 VND/cái"
        }
      ]
    },
    {
      "id": "cho-dong-ba",
      "name": "Chợ Đông Ba",
      "location": "Thừa Thiên Huế",
      "image": "assets/images/places/checkin-cho-dong-ba.jpg",
      "description": "Khu chợ truyền thống lớn nhất và lâu đời nhất xứ Huế, trung tâm thương mại sầm uất với đầy đủ hàng hóa địa phương, nơi hội tụ văn hóa ẩm thực và sinh hoạt đặc trưng của người dân cố đô",
      "detailedDescription": "Chợ Đông Ba được xây dựng từ năm 1887 dưới triều vua Đồng Khánh, nằm bên bờ sông Hương thơ mộng. Chợ có lịch sử hơn 130 năm, là một trong những khu chợ lâu đời và lớn nhất miền Trung. Với diện tích hơn 16.000m², chợ có hơn 2.500 gian hàng, chia thành nhiều khu vực chuyên biệt như khu bán vải Huế, khu ẩm thực, khu đồ thủ công mỹ nghệ, và khu bán đặc sản. Đặc biệt, chợ nổi tiếng với các mặt hàng truyền thống như nón lá bài thơ, áo dài Huế, các loại mắm và đặc sản địa phương. Khu ẩm thực của chợ là nơi du khách có thể thưởng thức đầy đủ các món ăn đặc trưng của xứ Huế như bún bò, cơm hến, bánh bèo, bánh nậm. Chợ không chỉ là trung tâm mua sắm mà còn là điểm đến văn hóa, nơi du khách có thể tìm hiểu về đời sống thường nhật của người dân địa phương.",
      "howToGet": "Từ trung tâm thành phố Huế đi bộ khoảng 10-15 phút theo đường Trần Hưng Đạo. Chợ nằm ngay cạnh cầu Tràng Tiền, một trong những biểu tượng của thành phố. Có thể đi xe máy, taxi hoặc xích lô từ các điểm du lịch khác trong thành phố.",
      "bestTimeToVisit": "Chợ hoạt động từ sáng sớm đến tối. Thời điểm lý tưởng để tham quan là từ 7-9h sáng khi các hàng quán vừa bày bán và thực phẩm còn tươi ngon. Buổi chiều từ 15-17h cũng là thời điểm tốt để mua sắm khi thời tiết mát mẻ hơn. Nên tránh giờ trưa nắng nóng và những ngày mưa lớn.",
      "attractions": {
        "shopping": [
          {
            "name": "Khu vải Huế",
            "description": "Khu vực chuyên bán vải may áo dài truyền thống, lụa Huế và các loại vải địa phương với nhiều mẫu mã đẹp",
            "image": "assets/images/places/khu-vai-hue.jpg"
          },
          {
            "name": "Khu đồ lưu niệm",
            "description": "Nơi bán các sản phẩm thủ công mỹ nghệ, tranh thêu, nón lá bài thơ và các món quà lưu niệm đặc trưng Huế",
            "image": "assets/images/places/khu-do-luu-niem.jpg"
          }
        ],
        "culinary": [
          {
            "name": "Khu ẩm thực",
            "description": "Tập trung nhiều quầy bán đặc sản Huế như bún bò, cơm hến, các loại bánh truyền thống và chè Huế",
            "image": "assets/images/places/khu-am-thuc.jpg"
          },
          {
            "name": "Khu đặc sản",
            "description": "Nơi bán các loại mắm, gia vị, trái cây và đặc sản địa phương để làm quà",
            "image": "assets/images/places/khu-dac-san.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Bún bò Huế",
          "description": "Món bún bò truyền thống với nước dùng đậm đà, thịt bò, giò heo và các gia vị đặc trưng xứ Huế",
          "image": "assets/images/foods/bun-bo-hue.jpg"
        },
        {
          "name": "Bánh bèo chợ Đông Ba",
          "description": "Bánh bèo được làm tại chỗ, ăn kèm tôm khô, mỡ hành và nước mắm chua ngọt đặc biệt",
          "image": "assets/images/foods/banh-beo.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Cầu Tràng Tiền",
          "description": "Cây cầu lịch sử bắc qua sông Hương, biểu tượng của thành phố Huế, đặc biệt đẹp về đêm với hệ thống đèn LED đổi màu",
          "distance": "0.2km",
          "travelTime": "3 phút đi bộ"
        },
        {
          "name": "Đại Nội Huế",
          "description": "Quần thể di tích cung đình nhà Nguyễn, nơi tham quan không thể bỏ qua khi đến Huế",
          "distance": "1km",
          "travelTime": "15 phút đi bộ"
        }
      ],
      "recommendedFood": [
        {
          "name": "Bún bò Huế Bà Đào",
          "description": "Bún bò truyền thống với nước dùng đậm đà và thịt bò mềm",
          "restaurant": "Quầy bún bò Bà Đào - Khu ẩm thực chợ Đông Ba",
          "price": "35000-45000 VND/tô"
        },
        {
          "name": "Bánh khoái Bà Cúc",
          "description": "Bánh khoái giòn rụm với nhân tôm thịt và nước chấm đặc biệt",
          "restaurant": "Quầy bánh khoái Bà Cúc - Lối vào chính chợ Đông Ba",
          "price": "20000-30000 VND/cái"
        }
      ]
    },
    {
      "id": "cho-da-lat",
      "name": "Chợ Đà Lạt",
      "location": "Lâm Đồng",
      "image": "assets/images/places/checkin-cho-da-lat-lam-dong.jpg",
      "description": "Khu chợ truyền thống nổi tiếng của thành phố ngàn hoa, nơi hội tụ tinh hoa ẩm thực và văn hóa của vùng đất cao nguyên. Chợ không chỉ là trung tâm mua sắm sầm uất mà còn là điểm đến không thể bỏ qua để trải nghiệm không khí sinh hoạt đặc trưng của người dân địa phương.",
      "detailedDescription": "Chợ Đà Lạt là một trong những điểm đến không thể bỏ qua khi đến thành phố ngàn hoa. Được xây dựng từ thời Pháp thuộc với kiến trúc độc đáo, chợ là nơi tập trung đầy đủ các đặc sản của vùng đất cao nguyên như rau củ tươi, hoa quả, đồ len và các món ăn đặc trưng. Khu chợ không chỉ phục vụ nhu cầu mua sắm mà còn là điểm giao thoa văn hóa, nơi du khách có thể tìm hiểu về cuộc sống và phong cách sinh hoạt của người dân Đà Lạt. Vào mỗi buổi sáng sớm, chợ là nơi diễn ra các hoạt động mua bán sôi động nhất, với những người nông dân mang các sản phẩm tươi ngon từ các vườn rau và trang trại về bán.",
      "howToGet": "Chợ nằm ở trung tâm thành phố Đà Lạt, dễ dàng di chuyển bằng các phương tiện công cộng. Từ ga Đà Lạt, bạn có thể đi bộ khoảng 10 phút hoặc bắt taxi với giá khoảng 20.000 đồng.",
      "bestTimeToVisit": "Chợ họp từ sáng sớm, nhưng nhộn nhịp nhất là từ 6h-9h sáng. Đây là thời điểm lý tưởng để mua sắm rau củ quả tươi và thưởng thức bữa sáng đặc trưng của người Đà Lạt.",
      "attractions": {
        "shopping": [
          {
            "name": "Khu chợ truyền thống",
            "description": "Nơi tập trung nhiều đặc sản và hàng hóa đặc trưng Đà Lạt",
            "image": "assets/images/places/checkin-cho-da-lat-lam-dong.jpg"
          },
          {
            "name": "Khu bán hoa tươi",
            "description": "Nơi bán các loại hoa đặc trưng Đà Lạt",
            "image": "assets/images/places/cho-hoa-da-lat.jpg"
          }
        ],
        "cultural": [
          {
            "name": "Khu ẩm thực",
            "description": "Nơi thưởng thức các món ăn đặc sản Đà Lạt",
            "image": "assets/images/places/am-thuc-cho-da-lat.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Bánh tráng nướng",
          "description": "Món ăn vặt đặc trưng của Đà Lạt",
          "image": "assets/images/foods/banh-trang-nuong.jpg"
        },
        {
          "name": "Sữa đậu nành nóng",
          "description": "Đồ uống truyền thống ấm nóng",
          "image": "assets/images/foods/sua-dau-nanh.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Nhà thờ Con Gà",
          "description": "Công trình kiến trúc Pháp nổi tiếng với lối kiến trúc Gothic độc đáo, là biểu tượng của thành phố Đà Lạt",
          "distance": "500m về phía Đông",
          "travelTime": "10 phút đi bộ",
          "image": "assets/images/places/nha-tho-con-ga.jpg"
        },
        {
          "name": "Hồ Xuân Hương",
          "description": "Hồ nước ngọt trung tâm Đà Lạt, nơi lý tưởng để dạo bộ và ngắm cảnh thành phố",
          "distance": "1km về phía Tây",
          "travelTime": "15 phút đi bộ hoặc 5 phút đi xe",
          "image": "assets/images/places/ho-xuan-huong.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Bánh ướt lòng gà",
          "description": "Món ăn đặc trưng Đà Lạt với bánh ướt mềm mịn và lòng gà tươi ngon",
          "restaurant": "Quán Bánh Ướt Lòng Gà Bà Hương",
          "price": "35000-50000 VND/phần",
          "where": "Khu B, tầng 1, chợ Đà Lạt"
        },
        {
          "name": "Bánh mì xíu mại",
          "description": "Bánh mì giòn với nhân xíu mại nóng hổi, nước sốt đặc biệt",
          "restaurant": "Bánh Mì Xíu Mại Hoàng Diệu",
          "price": "20000-30000 VND/ổ",
          "where": "Khu ẩm thực sáng, lối vào chính chợ Đà Lạt"
        }
      ]
    },
    {
      "id": "chua-linh-phuoc",
      "name": "Chùa Linh Phước",
      "location": "Lâm Đồng",
      "image": "assets/images/places/checkin-chua-linh-phuoc-lam-dong.jpg",
      "description": "Ngôi chùa độc đáo với kiến trúc từ mảnh sành sứ, còn được gọi là Chùa Ve Chai với con rồng dài 49m làm từ 12.000 vỏ chai lọ",
      "customSection": {
        "title": "Giới thiệu về Chùa Linh Phước",
        "content": "<div class=\"custom-section-item\">\n<div class=\"folk-song-description\">\n<h4>Vị trí và tên gọi</h4>\nChùa Linh Phước (chữ Hán: 靈福寺) tọa lạc tại số 120 Tự Phước, thuộc địa bàn Trại Mát, cách trung tâm thành phố Đà Lạt 8 km, trên quốc lộ 20. Chùa còn được gọi là Chùa Ve Chai vì trong sân chùa có con rồng dài 49 m được làm bằng 12.000 vỏ chai lọ.\n\n<h4>Lịch sử</h4>\nChùa được khởi công xây dựng vào năm 1949, hoàn thành năm 1950. Năm 1990 thượng tọa Thích Tâm Vị cho trùng tu lại chùa và xây dựng thêm nhiều công trình mới. Chùa đã trải qua 5 đời trụ trì, từ Hòa thượng Thích Minh Thể (1951-1954) đến Thượng tọa Thích Tâm Vị (từ 1985 đến nay).\n\n<h4>Kiến trúc độc đáo</h4>\nChánh điện chùa dài 33 m, rộng 12 m có 2 hàng cột rồng khảm sành, bên trên là nhiều bức phù điêu khảm sành giới thiệu về lịch sử Phật Thích Ca và những điển tích trong các kinh Pháp hoa, kinh A di đà. Sân chùa (Hoa Long Viên) có con rồng dài 49 m, vây rồng được làm bằng 12.000 vỏ chai bia, miệng rồng che phủ tượng Phật Di Lặc.\n\n<h4>Kỷ lục và điểm nhấn</h4>\nTrước Hoa Long Viên là tòa Linh Tháp 7 tầng cao hơn 37 m, được coi là tháp chuông chùa cao nhất Việt Nam. Trong lòng tháp treo Đại Hồng Chung cao 4,3 m, miệng chuông rộng 2,33 m, nặng 8.500 kg, được đúc vào năm 1999. Ngoài ra, nơi đây còn có nhà trưng bày đá quý, sành sứ cổ và đồ gỗ mỹ nghệ.</div>\n</div>"
      },
      "detailedDescription": "Chùa Linh Phước, còn được gọi là chùa Ve Chai, nổi tiếng với lối kiến trúc độc đáo được trang trí bằng các mảnh sành sứ. Đây là một trong những ngôi chùa có kiến trúc độc đáo nhất Đà Lạt.",
      "howToGet": "Từ trung tâm Đà Lạt đi khoảng 8km theo đường Tự Phước.",
      "bestTimeToVisit": "Có thể thăm quan quanh năm, đẹp nhất vào buổi sáng sớm.",
      "attractions": {
        "religious": [
          {
            "name": "Chùa Ve Chai",
            "description": "Công trình tôn giáo với kiến trúc độc đáo từ mảnh sành sứ",
            "image": "assets/images/places/checkin-chua-linh-phuoc-lam-dong.jpg"
          },
          {
            "name": "Long Hoa Viên",
            "description": "Khu vườn với tượng rồng dài 49m",
            "image": "assets/images/places/long-hoa-vien.jpg"
          }
        ],
        "cultural": [
          {
            "name": "Bảo tàng trà",
            "description": "Nơi trưng bày văn hóa trà Đà Lạt",
            "image": "assets/images/places/bao-tang-tra.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Chè đậu đỏ",
          "description": "Món chè truyền thống của chùa",
          "image": "assets/images/foods/che-dau-do.jpg"
        },
        {
          "name": "Trà Ô Long",
          "description": "Trà đặc sản Đà Lạt",
          "image": "assets/images/foods/tra-o-long.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Ga Trại Mát",
          "description": "Nhà ga cổ của Đà Lạt",
          "distance": "1km",
          "image": "assets/images/places/ga-trai-mat.jpg"
        },
        {
          "name": "Thác Datanla",
          "description": "Thác nước đẹp gần chùa",
          "distance": "5km",
          "image": "assets/images/places/thac-datanla.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cơm chay",
          "description": "Món chay của chùa",
          "price": "30000-50000 VND/phần",
          "where": "Nhà ăn trong chùa"
        },
        {
          "name": "Bánh ít chay",
          "description": "Bánh truyền thống",
          "price": "5000-10000 VND/cái",
          "where": "Quầy bán đồ chay trong chùa"
        }
      ]
    },
    {
      "id": "dai-bao-thap-kinh-luan",
      "name": "Đại Bảo tháp Kinh Luân",
      "location": "Lâm Đồng",
      "image": "assets/images/places/checkin-kinh-luan-dat-vang-lam-dong.jpg",
      "description": "Đại Bảo tháp Kinh luân lớn nhất thế giới tại Samten Hills Dalat, biểu tượng của tình hữu nghị, hoà bình và văn hoá ngoại giao, được công nhận kỷ lục Guinness thế giới",
      "detailedDescription": "Đại Bảo tháp Kinh luân Drigung Kagyu Rinchen Khorchen Khorwe Go Gek là công trình tâm linh độc đáo tại Samten Hills Dalat. Được làm bằng đồng tinh khiết và mạ vàng 24k, tháp có chiều cao 37,22m và đường kính 16,53m. Bên trong bánh xe cầu nguyện chứa hơn một tỷ câu chú Om Mani Padme Hum được in lên giấy lụa mỏng, cùng các phẩm vật cát tường như Xá lợi của Phật và các vị Thánh tăng. Khi quay kinh luân, các chuỗi chân ngôn bên trong chuyển động sẽ tạo ra nguồn năng lượng từ trường tích cực, an lành, nguồn phúc lạc to lớn của thập phương chư Phật.",
      "howToGet": "Từ trung tâm Đà Lạt đi khoảng 5km theo hướng Suối Vàng.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là buổi sáng sớm hoặc hoàng hôn.",
      "attractions": {
        "religious": [
          {
            "name": "Đại Bảo tháp Kinh Luân",
            "description": "Công trình tâm linh độc đáo với chiều cao 37,22m, được làm từ đồng tinh khiết mạ vàng 24k, chứa hơn một tỷ câu chú Om Mani Padme Hum",
            "image": "assets/images/places/checkin-kinh-luan-dat-vang-lam-dong.jpg"
          },
          {
            "name": "Khu tâm linh Samten Hills",
            "description": "Không gian văn hóa tâm linh rộng lớn, nơi kết hợp giữa kiến trúc Phật giáo và cảnh quan thiên nhiên Đà Lạt",
            "image": "assets/images/places/samten-hills.jpg"
          }
        ],
        "cultural": [
          {
            "name": "Bảo tàng Phật giáo",
            "description": "Nơi trưng bày các hiện vật và tư liệu quý về lịch sử Phật giáo Kim cương thừa tại Việt Nam",
            "image": "assets/images/places/bao-tang-phat-giao.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Cơm chay",
          "description": "Món ăn chay thanh tịnh được chế biến từ rau củ địa phương",
          "image": "assets/images/foods/com-chay-samten.jpg"
        },
        {
          "name": "Trà Tây Tạng",
          "description": "Thức uống truyền thống của Phật giáo Kim cương thừa",
          "image": "assets/images/foods/tra-tay-tang.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Thiền viện Trúc Lâm",
          "description": "Thiền viện lớn nhất Đà Lạt với kiến trúc độc đáo và cảnh quan thanh tịnh",
          "distance": "5km",
          "travelTime": "15 phút đi xe"
        },
        {
          "name": "Hồ Tuyền Lâm",
          "description": "Hồ nước trong xanh với cảnh quan thiên nhiên tuyệt đẹp",
          "distance": "3km",
          "travelTime": "10 phút đi xe"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cơm chay Samten",
          "description": "Set cơm chay với các món từ rau củ địa phương",
          "restaurant": "Nhà hàng chay Samten Hills",
          "price": "80000-150000 VND/suất"
        },
        {
          "name": "Trà thiền",
          "description": "Trà đặc biệt được pha chế theo phương pháp truyền thống",
          "restaurant": "Quán trà Samten Hills",
          "price": "40000-60000 VND/set"
        }
      ]
    },
    {
      "id": "cho-noi-cai-rang",
      "name": "Chợ nổi Cái Răng",
      "location": "Cần Thơ",
      "image": "assets/images/places/checkin-cho-noi-cai-rang-can-tho.jpg",
      "description": "Chợ nổi truyền thống của vùng sông nước miền Tây",
      "detailedDescription": "Chợ nổi Cái Răng là một trong những chợ nổi lớn nhất đồng bằng sông Cửu Long. Đây là nơi giao thương truyền thống trên sông nước, mang đậm bản sắc văn hóa miền Tây Nam Bộ.",
      "howToGet": "Từ trung tâm Cần Thơ đi thuyền khoảng 30 phút theo sông Hậu.",
      "bestTimeToVisit": "Chợ họp từ rạng sáng, nhộn nhịp nhất từ 5h-8h sáng.",
      "attractions": {
        "cultural": [
          {
            "name": "Chợ nổi truyền thống",
            "description": "Khu chợ trên sông với nhiều ghe thuyền buôn bán",
            "image": "assets/images/places/checkin-cho-noi-cai-rang-can-tho.jpg"
          },
          {
            "name": "Khu ẩm thực trên sông",
            "description": "Nơi thưởng thức ẩm thực sông nước",
            "image": "assets/images/places/am-thuc-cai-rang.jpg"
          }
        ],
        "natural": [
          {
            "name": "Cảnh sông nước",
            "description": "Khung cảnh sông nước miền Tây",
            "image": "assets/images/places/song-nuoc-cai-rang.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Hủ tiếu",
          "description": "Món ăn sáng đặc trưng",
          "image": "assets/images/foods/hu-tieu.jpg"
        },
        {
          "name": "Bún riêu cua",
          "description": "Món bún nổi tiếng miền Tây",
          "image": "assets/images/foods/bun-rieu-cua.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Bến Ninh Kiều",
          "description": "Bến tàu du lịch nổi tiếng",
          "distance": "2km",
          "image": "assets/images/places/ben-ninh-kieu.jpg"
        },
        {
          "name": "Nhà cổ Bình Thủy",
          "description": "Di tích kiến trúc cổ",
          "distance": "5km",
          "image": "assets/images/places/nha-co-binh-thuy.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cà phê vợt",
          "description": "Cà phê truyền thống miền Tây",
          "price": "15000-25000 VND/ly",
          "where": "Các ghe bán cà phê trong chợ"
        },
        {
          "name": "Bánh cống",
          "description": "Món ăn đặc sản Cần Thơ",
          "price": "5000-10000 VND/cái",
          "where": "Các ghe bán đồ ăn trong chợ"
        }
      ]
    },
    {
      "id": "phu-chau-mieu",
      "name": "Phù Châu Miếu",
      "location": "TP.HCM",
      "image": "assets/images/places/checkin-phu-chau-mieu-go-vap-hcm.jpg",
      "description": "Di tích tâm linh cổ tại Gò Vấp",
      "detailedDescription": "Phù Châu Miếu là ngôi miếu cổ nằm tại quận Gò Vấp, TP.HCM. Công trình mang đậm kiến trúc truyền thống và là điểm đến tâm linh quan trọng của người dân địa phương.",
      "howToGet": "Từ trung tâm TP.HCM đi xe buýt hoặc taxi đến quận Gò Vấp.",
      "bestTimeToVisit": "Có thể thăm quan quanh năm, đặc biệt vào các dịp lễ tết.",
      "attractions": {
        "religious": [
          {
            "name": "Miếu cổ",
            "description": "Công trình tâm linh với kiến trúc truyền thống",
            "image": "assets/images/places/checkin-phu-chau-mieu-go-vap-hcm.jpg"
          },
          {
            "name": "Khu thờ tự",
            "description": "Nơi thờ phụng trang nghiêm",
            "image": "assets/images/places/khu-tho-phu-chau-mieu.jpg"
          }
        ],
        "cultural": [
          {
            "name": "Khu trưng bày",
            "description": "Nơi trưng bày các hiện vật lịch sử",
            "image": "assets/images/places/trung-bay-phu-chau-mieu.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Chè trái cây",
          "description": "Món chè mát lạnh đặc trưng",
          "image": "assets/images/foods/che-trai-cay.jpg"
        },
        {
          "name": "Bánh ít trần",
          "description": "Bánh truyền thống",
          "image": "assets/images/foods/banh-it-tran.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Công viên Gia Định",
          "description": "Công viên xanh mát",
          "distance": "2km",
          "image": "assets/images/places/cong-vien-gia-dinh.jpg"
        },
        {
          "name": "Chợ Hạnh Thông Tây",
          "description": "Chợ truyền thống sầm uất",
          "distance": "1km",
          "image": "assets/images/places/cho-hanh-thong-tay.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Chè dừa dầm",
          "description": "Chè mát lạnh",
          "price": "20000-30000 VND/ly",
          "where": "Các quán chè gần miếu"
        },
        {
          "name": "Bánh bò thốt nốt",
          "description": "Bánh truyền thống",
          "price": "5000-10000 VND/cái",
          "where": "Các quầy bánh gần miếu"
        }
      ]
    },
    {
      "id": "chua-keo-thai-binh",
      "name": "Chùa Keo",
      "location": "Thái Bình",
      "image": "assets/images/places/checkin-chua-keo-thai-binh.jpg",
      "description": "Di tích kiến trúc nghệ thuật quốc gia",
      "detailedDescription": "Chùa Keo là một trong những ngôi chùa cổ nhất Việt Nam, nổi tiếng với kiến trúc độc đáo thời Lý. Chùa còn lưu giữ nhiều hiện vật quý giá và là điểm đến tâm linh quan trọng của vùng đồng bằng Bắc Bộ.",
      "howToGet": "Từ trung tâm Thái Bình đi khoảng 15km theo hướng Vũ Thư.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là vào mùa xuân, đặc biệt là dịp lễ hội chùa.",
      "attractions": {
        "religious": [
          {
            "name": "Chùa Keo",
            "description": "Ngôi chùa cổ với kiến trúc độc đáo thời Lý",
            "image": "assets/images/places/checkin-chua-keo-thai-binh.jpg"
          },
          {
            "name": "Tháp chuông",
            "description": "Tháp chuông cổ kính",
            "image": "assets/images/places/thap-chuong-chua-keo.jpg"
          }
        ],
        "historical": [
          {
            "name": "Bảo tàng chùa",
            "description": "Nơi lưu giữ các hiện vật lịch sử",
            "image": "assets/images/places/bao-tang-chua-keo.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Xôi cốm",
          "description": "Món xôi truyền thống",
          "image": "assets/images/foods/xoi-com.jpg"
        },
        {
          "name": "Chè lam",
          "description": "Món chè đặc sản",
          "image": "assets/images/foods/che-lam.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Làng nghề dệt Hồng Quang",
          "description": "Làng nghề truyền thống",
          "distance": "5km",
          "image": "assets/images/places/lang-nghe-det.jpg"
        },
        {
          "name": "Đền Trần Thái Bình",
          "description": "Di tích lịch sử",
          "distance": "10km",
          "image": "assets/images/places/den-tran-thai-binh.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cơm chay",
          "description": "Món chay của chùa",
          "price": "30000-50000 VND/phần",
          "where": "Nhà ăn trong chùa"
        },
        {
          "name": "Bánh gai",
          "description": "Đặc sản Thái Bình",
          "price": "10000-15000 VND/cái",
          "where": "Các quầy bán quà lưu niệm"
        }
      ]
    },
    {
      "id": "dinh-yen-tu",
      "name": "Đỉnh Yên Tử",
      "location": "Quảng Ninh",
      "image": "assets/images/places/checkin-dinh-yen-tu-quang-ninh.jpg",
      "description": "Trung tâm Phật giáo của Việt Nam",
      "detailedDescription": "Yên Tử là quần thể di tích danh thắng gắn liền với Phật hoàng Trần Nhân Tông và dòng thiền Trúc Lâm. Nơi đây có cảnh quan thiên nhiên hùng vĩ và nhiều công trình tâm linh quan trọng.",
      "howToGet": "Từ Hà Nội đi xe khách đến Uông Bí (khoảng 130km), sau đó đi cáp treo hoặc leo núi.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là từ tháng 1 đến tháng 3 (mùa lễ hội Yên Tử).",
      "attractions": {
        "religious": [
          {
            "name": "Chùa Đồng",
            "description": "Ngôi chùa đồng cao nhất Việt Nam trên đỉnh Yên Tử",
            "image": "assets/images/places/checkin-dinh-yen-tu-quang-ninh.jpg"
          },
          {
            "name": "Chùa Một Mái",
            "description": "Ngôi chùa cổ độc đáo",
            "image": "assets/images/places/chua-mot-mai.jpg"
          }
        ],
        "natural": [
          {
            "name": "Rừng cổ thụ",
            "description": "Khu rừng nguyên sinh với nhiều cây cổ thụ",
            "image": "assets/images/places/rung-co-thu-yen-tu.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Chè dưỡng sinh",
          "description": "Món chè đặc trưng của vùng núi",
          "image": "assets/images/foods/che-duong-sinh.jpg"
        },
        {
          "name": "Bánh đậu xanh",
          "description": "Đặc sản Quảng Ninh",
          "image": "assets/images/foods/banh-dau-xanh.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Thiền viện Trúc Lâm",
          "description": "Trung tâm thiền học lớn",
          "distance": "2km",
          "image": "assets/images/places/thien-vien-truc-lam.jpg"
        },
        {
          "name": "Suối Giải Oan",
          "description": "Dòng suối linh thiêng",
          "distance": "1km",
          "image": "assets/images/places/suoi-giai-oan.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cơm chay núi",
          "description": "Món chay đặc trưng",
          "price": "40000-60000 VND/phần",
          "where": "Các nhà hàng chay dọc đường lên núi"
        },
        {
          "name": "Trà Yên Tử",
          "description": "Trà đặc sản vùng núi",
          "price": "50000-100000 VND/gói",
          "where": "Các quầy bán đặc sản"
        }
      ]
    },
    {
      "id": "chua-dong-yen-tu",
      "name": "Chùa Đồng Yên Tử",
      "location": "Quảng Ninh",
      "image": "assets/images/places/checkin-chua-dong-yen-tu-quang-ninh.jpg",
      "description": "Ngôi chùa đồng trên đỉnh núi thiêng",
      "detailedDescription": "Chùa Đồng là ngôi chùa nằm trên đỉnh cao nhất của dãy Yên Tử, được đúc hoàn toàn bằng đồng. Đây là điểm đến tâm linh quan trọng và là nơi ngắm cảnh tuyệt đẹp từ độ cao hơn 1000m.",
      "howToGet": "Từ chân núi Yên Tử đi cáp treo hoặc leo bộ khoảng 6km.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là từ tháng 1 đến tháng 3, tránh mùa mưa bão.",
      "attractions": {
        "religious": [
          {
            "name": "Chùa Đồng",
            "description": "Ngôi chùa bằng đồng độc đáo trên đỉnh Yên Tử",
            "image": "assets/images/places/checkin-chua-dong-yen-tu-quang-ninh.jpg"
          },
          {
            "name": "Tượng Phật đồng",
            "description": "Tượng Phật lớn bằng đồng",
            "image": "assets/images/places/tuong-phat-dong.jpg"
          }
        ],
        "natural": [
          {
            "name": "View đỉnh núi",
            "description": "Cảnh quan tuyệt đẹp từ đỉnh Yên Tử",
            "image": "assets/images/places/view-dinh-yen-tu.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Nước suối thiêng",
          "description": "Nước suối từ đỉnh Yên Tử",
          "image": "assets/images/foods/nuoc-suoi-thieng.jpg"
        },
        {
          "name": "Bánh gai Yên Tử",
          "description": "Đặc sản vùng núi",
          "image": "assets/images/foods/banh-gai.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Am Ngọa Vân",
          "description": "Nơi tu hành của Phật hoàng",
          "distance": "3km",
          "image": "assets/images/places/am-ngoa-van.jpg"
        },
        {
          "name": "Tháp Huệ Quang",
          "description": "Tháp cổ linh thiêng",
          "distance": "0.5km",
          "image": "assets/images/places/thap-hue-quang.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Nước suối Yên Tử",
          "description": "Nước suối tinh khiết",
          "price": "10000-15000 VND/chai",
          "where": "Các quầy bán nước dọc đường"
        },
        {
          "name": "Bánh chưng gai",
          "description": "Đặc sản truyền thống",
          "price": "30000-50000 VND/cái",
          "where": "Các quầy bán đặc sản"
        }
      ]
    },
    {
      "id": "den-tran-nam-dinh",
      "name": "Đền Trần",
      "location": "Nam Định",
      "image": "assets/images/places/checkin-den-tran-nam-dinh.jpg",
      "description": "Di tích lịch sử thờ các vua Trần",
      "detailedDescription": "Đền Trần là quần thể di tích lịch sử văn hóa thờ các vua nhà Trần và những người có công với triều đại này. Đây là một trong những công trình kiến trúc tôn giáo tiêu biểu của vùng đồng bằng Bắc Bộ.",
      "howToGet": "Từ trung tâm Nam Định đi khoảng 3km theo đường Trần Thừa.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là vào dịp lễ hội Đền Trần (tháng 1-2 âm lịch).",
      "attractions": {
        "religious": [
          {
            "name": "Đền Trần",
            "description": "Quần thể đền thờ với kiến trúc cổ thời Trần",
            "image": "assets/images/places/checkin-den-tran-nam-dinh.jpg"
          },
          {
            "name": "Điện thờ chính",
            "description": "Nơi thờ các vua Trần",
            "image": "assets/images/places/dien-tho-den-tran.jpg"
          }
        ],
        "historical": [
          {
            "name": "Bảo tàng",
            "description": "Trưng bày hiện vật thời Trần",
            "image": "assets/images/places/bao-tang-den-tran.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Phở bò Nam Định",
          "description": "Phở truyền thống nổi tiếng",
          "image": "assets/images/foods/pho-bo-nam-dinh.jpg"
        },
        {
          "name": "Xôi Phú Nhi",
          "description": "Xôi đặc sản Nam Định",
          "image": "assets/images/foods/xoi-phu-nhi.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Chợ Viềng",
          "description": "Chợ truyền thống nổi tiếng",
          "distance": "5km",
          "image": "assets/images/places/cho-vieng.jpg"
        },
        {
          "name": "Phủ Dầy",
          "description": "Quần thể di tích tâm linh",
          "distance": "15km",
          "image": "assets/images/places/phu-day.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Phở bò Nam Định",
          "description": "Phở truyền thống",
          "price": "35000-50000 VND/bát",
          "where": "Các quán phở gần đền"
        },
        {
          "name": "Bún đũa",
          "description": "Món ăn đặc trưng",
          "price": "25000-35000 VND/bát",
          "where": "Các quán ăn địa phương"
        }
      ]
    },
    {
      "id": "chua-tam-chuc",
      "name": "Chùa Tam Chúc",
      "location": "Hà Nam",
      "image": "assets/images/places/checkin-chua-tam-chuc-ha-nam.jpg",
      "description": "Quần thể chùa lớn nhất thế giới",
      "detailedDescription": "Chùa Tam Chúc là quần thể chùa lớn nhất thế giới, nằm giữa khung cảnh núi non hùng vĩ của Hà Nam. Nơi đây không chỉ là trung tâm tâm linh mà còn là điểm du lịch văn hóa quan trọng của miền Bắc.",
      "howToGet": "Từ Hà Nội đi xe khách hoặc ô tô khoảng 60km theo quốc lộ 1A.",
      "bestTimeToVisit": "Có thể thăm quan quanh năm, đẹp nhất vào mùa xuân và thu.",
      "attractions": {
        "religious": [
          {
            "name": "Quần thể chùa",
            "description": "Khu chùa rộng lớn với kiến trúc độc đáo và cảnh quan đẹp",
            "image": "assets/images/places/checkin-chua-tam-chuc-ha-nam.jpg"
          },
          {
            "name": "Điện Tam Thế",
            "description": "Công trình tâm linh lớn",
            "image": "assets/images/places/dien-tam-the.jpg"
          }
        ],
        "natural": [
          {
            "name": "Hồ Tam Chúc",
            "description": "Hồ nước trong xanh bao quanh chùa",
            "image": "assets/images/places/ho-tam-chuc.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Cơm chay",
          "description": "Món chay tinh tế",
          "image": "assets/images/foods/com-chay-tam-chuc.jpg"
        },
        {
          "name": "Chè sen",
          "description": "Chè thanh mát",
          "image": "assets/images/foods/che-sen.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Núi Ngọc",
          "description": "Núi đá vôi đẹp",
          "distance": "2km",
          "image": "assets/images/places/nui-ngoc.jpg"
        },
        {
          "name": "Làng nghề đá Non Nước",
          "description": "Làng nghề truyền thống",
          "distance": "5km",
          "image": "assets/images/places/lang-nghe-da.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Buffet chay",
          "description": "Các món chay đa dạng",
          "price": "100000-150000 VND/người",
          "where": "Nhà hàng chay trong khuôn viên chùa"
        },
        {
          "name": "Trà sen Tam Chúc",
          "description": "Trà thơm đặc sản",
          "price": "30000-50000 VND/gói",
          "where": "Các quầy bán đặc sản"
        }
      ]
    },
    {
      "id": "hai-dang-vung-tau",
      "name": "Hải đăng Vũng Tàu",
      "location": "Bà Rịa - Vũng Tàu",
      "image": "assets/images/places/checkin-hai-dang-vung-tau.jpg",
      "description": "Ngọn hải đăng lịch sử trên núi Nhỏ, một trong những ngọn hải đăng cổ nhất và quan trọng nhất Việt Nam",
      "detailedDescription": "Hải đăng Vũng Tàu là một trong những ngọn hải đăng cổ nhất và quan trọng nhất Việt Nam, được xây dựng từ thời Pháp thuộc năm 1862. Nằm trên đỉnh núi Nhỏ ở độ cao 170m so với mực nước biển, ngọn hải đăng này đóng vai trò quan trọng trong việc dẫn đường cho tàu thuyền ra vào cảng Vũng Tàu và vùng biển phía Nam. Từ đây có thể ngắm toàn cảnh thành phố Vũng Tàu, biển Đông và các hoạt động của tàu thuyền.",
      "customSection": [
        {
          "title": "Hệ thống Hải đăng Việt Nam",
          "content": "<p>Việt Nam với bờ biển dài hơn 3.260km, sở hữu một hệ thống hải đăng đóng vai trò quan trọng trong hàng hải và chủ quyền biển đảo. Hệ thống này bao gồm hơn 80 ngọn hải đăng lớn nhỏ, trải dài từ Móng Cái đến Hà Tiên, trong đó có nhiều ngọn hải đăng có giá trị lịch sử và kiến trúc độc đáo.</p><p>Các hải đăng được phân bố theo 3 vùng chính:</p><ul><li><strong>Miền Bắc:</strong> Từ Móng Cái đến Lạch Ghép (Thanh Hóa)</li><li><strong>Miền Trung:</strong> Từ Thanh Hóa đến Phan Thiết</li><li><strong>Miền Nam:</strong> Từ Phan Thiết đến Hà Tiên</li></ul>"
        },
        {
          "title": "Các Hải đăng tiêu biểu",
          "content": "<p>Một số ngọn hải đăng nổi tiếng của Việt Nam:</p><ul><li><strong>Hải đăng Hòn Dấu (Hải Phòng):</strong> Ngọn hải đăng cổ nhất Việt Nam, xây dựng năm 1892</li><li><strong>Hải đăng Kê Gà (Bình Thuận):</strong> Ngọn hải đăng cao nhất Đông Nam Á</li><li><strong>Hải đăng Đại Lãnh (Phú Yên):</strong> Nơi đón ánh bình minh đầu tiên trên đất liền</li><li><strong>Hải đăng Vũng Tàu:</strong> Một trong những ngọn hải đăng cổ và quan trọng nhất miền Nam</li><li><strong>Hải đăng Cù Lao Xanh (Quy Nhơn):</strong> Ngọn hải đăng nằm trên đảo, có tầm quan sát rộng</li></ul>"
        },
        {
          "title": "Vai trò của Hải đăng",
          "content": "<p>Hệ thống hải đăng đóng nhiều vai trò quan trọng:</p><ul><li><strong>Dẫn đường hàng hải:</strong> Giúp tàu thuyền định hướng và tránh các vùng nguy hiểm</li><li><strong>Bảo vệ chủ quyền:</strong> Khẳng định sự hiện diện và chủ quyền trên các vùng biển đảo</li><li><strong>Nghiên cứu khoa học:</strong> Là trạm quan trắc khí tượng thủy văn</li><li><strong>Du lịch:</strong> Nhiều hải đăng trở thành điểm tham quan hấp dẫn</li><li><strong>Bảo tồn văn hóa:</strong> Là di sản kiến trúc và lịch sử quan trọng</li></ul>"
        }
      ],
      "howToGet": "Từ trung tâm Vũng Tàu đi bộ hoặc xe máy lên núi Nhỏ theo đường Hạ Long hoặc Trần Phú. Có thể đi bộ khoảng 1000 bậc thang từ chân núi hoặc đi xe máy theo đường nhựa lên đỉnh.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là lúc bình minh hoặc hoàng hôn. Nên tránh những ngày mưa gió vì đường lên khá dốc. Buổi sáng sớm (5h-7h) là thời điểm lý tưởng để ngắm bình minh và toàn cảnh thành phố.",
      "attractions": {
        "historical": [
          {
            "name": "Hải đăng cổ",
            "description": "Công trình lịch sử với tầm nhìn panorama ra biển",
            "image": "assets/images/places/checkin-hai-dang-vung-tau.jpg"
          },
          {
            "name": "Bảo tàng Hải đăng",
            "description": "Nơi trưng bày lịch sử hải đăng",
            "image": "assets/images/places/bao-tang-hai-dang.jpg"
          }
        ],
        "natural": [
          {
            "name": "View biển",
            "description": "Tầm nhìn toàn cảnh biển và thành phố",
            "image": "assets/images/places/view-bien-vung-tau.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Bánh khọt",
          "description": "Món ăn đặc sản Vũng Tàu",
          "image": "assets/images/foods/banh-khot.jpg"
        },
        {
          "name": "Hải sản nướng",
          "description": "Các món hải sản tươi nướng",
          "image": "assets/images/foods/hai-san-nuong.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Tượng Chúa Kitô",
          "description": "Tượng Chúa dang tay nổi tiếng",
          "distance": "1km",
          "image": "assets/images/places/tuong-chua-kito.jpg"
        },
        {
          "name": "Bãi Trước",
          "description": "Bãi biển đẹp trung tâm thành phố",
          "distance": "2km",
          "image": "assets/images/places/bai-truoc.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Yaourt cô Tiên",
          "description": "Thương hiệu yaourt nổi tiếng nhất Vũng Tàu từ năm 1996, được làm thủ công với công thức gia truyền. Yaourt có vị béo ngậy, chua thanh và ngọt dịu đặc trưng",
          "price": "15.000-20.000 VND/hộp",
          "where": "Yaourt cô Tiên - 157 Phan Chu Trinh, Phường 2"
        },
        {
          "name": "Trứng lòng đào",
          "description": "Món ăn vặt đặc trưng của Vũng Tàu, trứng gà luộc vừa chín tới, lòng đào còn mềm, ăn kèm với muối tiêu chanh và bánh mì nóng",
          "price": "10.000-15.000 VND/quả",
          "where": "Các quán ăn vặt dọc đường Hạ Long và khu vực chân núi"
        },
        {
          "name": "Bánh khọt",
          "description": "Món ăn đặc sản Vũng Tàu, bánh giòn bên ngoài, mềm bên trong với nhân tôm tươi",
          "price": "50000-70000 VND/phần",
          "where": "Các quán ăn dọc đường lên hải đăng"
        },
        {
          "name": "Nước dừa tươi",
          "description": "Đồ uống giải khát tự nhiên, dừa Vũng Tàu nổi tiếng ngọt mát",
          "price": "20000-30000 VND/trái",
          "where": "Các quầy bán nước dọc đường"
        }
      ]
    },
    {
      "id": "rach-gam-xoai-mut",
      "name": "Di tích Rạch Gầm - Xoài Mút",
      "location": "Tiền Giang",
      "image": "assets/images/places/checkin-di-tich-rach-gam-xoai-mut-tien-giang.jpg",
      "description": "Di tích lịch sử chiến thắng Rạch Gầm - Xoài Mút",
      "detailedDescription": "Di tích Rạch Gầm - Xoài Mút là nơi diễn ra trận thủy chiến lịch sử năm 1785, khi quân Tây Sơn đánh bại quân Xiêm. Đây là một trong những chiến thắng vẻ vang của dân tộc trên sông nước.",
      "customSection": [
        {
          "title": "Chiến thắng Rạch Gầm - Xoài Múp 1785",
          "content": "<p>Trận thủy chiến Rạch Gầm - Xoài Múp diễn ra vào ngày 19 tháng 1 năm 1785 là một trong những chiến thắng vang dội nhất trong lịch sử chống ngoại xâm của dân tộc. Dưới sự chỉ huy tài tình của Nguyễn Huệ, quân Tây Sơn đã đánh bại hoàn toàn đội quân xâm lược Xiêm La (Thái Lan) gồm 50.000 quân và 300 chiến thuyền do Chúa Nguyễn Ánh cầu viện.</p><p>Với chiến thuật độc đáo kết hợp giữa thủy chiến và bộ chiến, cùng việc tận dụng địa hình sông nước hiểm trở, quân Tây Sơn đã tiêu diệt và bắt sống hầu hết quân địch, phá hủy toàn bộ đoàn thuyền chiến của giặc.</p>"
        },
        {
          "title": "Ý nghĩa lịch sử",
          "content": "<p>Chiến thắng Rạch Gầm - Xoài Múp có ý nghĩa lịch sử to lớn:</p><ul><li>Đập tan âm mưu xâm lược của quân Xiêm</li><li>Khẳng định tài thao lược xuất chúng của Nguyễn Huệ</li><li>Thể hiện sức mạnh quân sự của nghĩa quân Tây Sơn</li><li>Là một trong những trận thủy chiến lớn nhất trong lịch sử Việt Nam</li><li>Minh chứng cho truyền thống đánh giặc giữ nước anh hùng của dân tộc</li></ul>"
        },
        {
          "title": "Chiến thuật độc đáo",
          "content": "<p>Nguyễn Huệ đã sử dụng chiến thuật độc đáo trong trận đánh này:</p><ul><li>Nghiên cứu kỹ địa hình sông nước hiểm trở</li><li>Bố trí quân mai phục dọc hai bờ sông</li><li>Dùng thuyền nhỏ dụ địch vào trận địa đã chuẩn bị</li><li>Kết hợp thủy chiến và bộ chiến tạo thế gọng kìm</li><li>Tận dụng thủy triều và dòng chảy để đánh địch</li></ul><p>Chiến thuật này đã tạo nên một trận đánh kinh điển trong lịch sử quân sự Việt Nam.</p>"
        }
      ],
      "howToGet": "Từ TP.HCM đi xe khách đến Mỹ Tho, sau đó đi xe ôm hoặc taxi đến di tích.",
      "bestTimeToVisit": "Có thể thăm quan quanh năm, tránh mùa mưa lũ.",
      "attractions": {
        "historical": [
          {
            "name": "Khu di tích",
            "description": "Di tích lịch sử với đền thờ và bia tưởng niệm",
            "image": "assets/images/places/checkin-di-tich-rach-gam-xoai-mut-tien-giang.jpg"
          },
          {
            "name": "Bảo tàng",
            "description": "Nơi trưng bày hiện vật lịch sử",
            "image": "assets/images/places/bao-tang-rach-gam.jpg"
          }
        ],
        "natural": [
          {
            "name": "Sông Tiền",
            "description": "Dòng sông lịch sử",
            "image": "assets/images/places/song-tien.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Hủ tiếu Mỹ Tho",
          "description": "Món ăn đặc sản vùng sông nước",
          "image": "assets/images/foods/hu-tieu-my-tho.jpg"
        },
        {
          "name": "Cá lóc nướng trui",
          "description": "Món ăn dân dã miền Tây",
          "image": "assets/images/foods/ca-loc-nuong.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Cồn Thới Sơn",
          "description": "Đảo du lịch nổi tiếng",
          "distance": "5km",
          "image": "assets/images/places/con-thoi-son.jpg"
        },
        {
          "name": "Chợ nổi Cái Bè",
          "description": "Chợ nổi truyền thống",
          "distance": "15km",
          "image": "assets/images/places/cho-noi-cai-be.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Hủ tiếu Mỹ Tho",
          "description": "Món ăn truyền thống",
          "price": "30000-45000 VND/tô",
          "where": "Các quán ăn địa phương"
        },
        {
          "name": "Bánh tráng Mỹ Tho",
          "description": "Đặc sản địa phương",
          "price": "20000-30000 VND/phần",
          "where": "Các quầy bán đồ ăn vặt"
        }
      ]
    },
    {
      "id": "cua-khau-tinh-bien",
      "name": "Cửa khẩu Tịnh Biên",
      "location": "An Giang",
      "image": "assets/images/places/checkin-cua-khau-tinh-bien-an-giang.jpg",
      "description": "Cửa khẩu quốc tế với Campuchia",
      "detailedDescription": "Cửa khẩu Tịnh Biên là một trong những cửa khẩu quốc tế quan trọng giữa Việt Nam và Campuchia. Đây là điểm giao thương sầm uất và là cửa ngõ du lịch quan trọng của vùng Đồng bằng sông Cửu Long.",
      "howToGet": "Từ TP.HCM đi xe khách đến Châu Đốc, sau đó đi xe ôm hoặc taxi đến cửa khẩu.",
      "bestTimeToVisit": "Có thể đến quanh năm, nhộn nhịp nhất vào các ngày trong tuần.",
      "attractions": {
        "border": [
          {
            "name": "Khu cửa khẩu",
            "description": "Điểm giao thương quốc tế sầm uất",
            "image": "assets/images/places/checkin-cua-khau-tinh-bien-an-giang.jpg"
          },
          {
            "name": "Chợ biên giới",
            "description": "Khu chợ buôn bán sầm uất",
            "image": "assets/images/places/cho-bien-gioi.jpg"
          }
        ],
        "shopping": [
          {
            "name": "Khu thương mại",
            "description": "Trung tâm mua sắm hàng ngoại",
            "image": "assets/images/places/khu-thuong-mai.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Bún cá Châu Đốc",
          "description": "Món ăn đặc sản vùng biên",
          "image": "assets/images/foods/bun-ca-chau-doc.jpg"
        },
        {
          "name": "Mắm Châu Đốc",
          "description": "Đặc sản nổi tiếng An Giang",
          "image": "assets/images/foods/mam-chau-doc.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Núi Cấm",
          "description": "Danh thắng nổi tiếng An Giang",
          "distance": "15km",
          "image": "assets/images/places/nui-cam.jpg"
        },
        {
          "name": "Chợ Châu Đốc",
          "description": "Chợ truyền thống sầm uất",
          "distance": "20km",
          "image": "assets/images/places/cho-chau-doc.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Bún cá Châu Đốc",
          "description": "Món ăn truyền thống",
          "price": "30000-45000 VND/tô",
          "where": "Các quán ăn khu vực cửa khẩu"
        },
        {
          "name": "Bánh phồng tôm",
          "description": "Đặc sản địa phương",
          "price": "50000-100000 VND/gói",
          "where": "Các cửa hàng đặc sản"
        }
      ]
    },
    {
      "id": "canh-dong-thang-long",
      "name": "Cánh đồng cây Thăng Long",
      "location": "Bình Thuận",
      "image": "assets/images/places/checkin-canh-dong-thang-long-binh-thuan.png",
      "description": "Cánh đồng điện gió với khung cảnh ngoạn mục",
      "detailedDescription": "Cánh đồng cây Thăng Long là dự án điện gió lớn tại Bình Thuận, tạo nên khung cảnh độc đáo với những cánh quạt khổng lồ giữa đồng cỏ xanh. Đây là điểm check-in nổi tiếng của giới trẻ.",
      "howToGet": "Từ Phan Thiết đi xe máy hoặc ô tô khoảng 40km theo hướng Tuy Phong.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là lúc bình minh hoặc hoàng hôn.",
      "attractions": {
        "modern": [
          {
            "name": "Cánh đồng điện gió",
            "description": "Công trình năng lượng tái tạo với cảnh quan độc đáo",
            "image": "assets/images/places/checkin-canh-dong-thang-long-binh-thuan.png"
          },
          {
            "name": "Trạm quan sát",
            "description": "Điểm ngắm cảnh toàn khu vực",
            "image": "assets/images/places/tram-quan-sat.jpg"
          }
        ],
        "natural": [
          {
            "name": "Đồng cỏ xanh",
            "description": "Cảnh quan thiên nhiên tuyệt đẹp",
            "image": "assets/images/places/dong-co-xanh.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Thanh long",
          "description": "Đặc sản Bình Thuận",
          "image": "assets/images/foods/thanh-long.jpg"
        },
        {
          "name": "Mực một nắng",
          "description": "Hải sản đặc trưng",
          "image": "assets/images/foods/muc-mot-nang.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Bãi biển Hòn Rơm",
          "description": "Bãi biển hoang sơ đẹp",
          "distance": "15km",
          "image": "assets/images/places/bai-bien-hon-rom.jpg"
        },
        {
          "name": "Đồi cát bay Mũi Né",
          "description": "Danh thắng nổi tiếng",
          "distance": "20km",
          "image": "assets/images/places/doi-cat-bay.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Nước ép thanh long",
          "description": "Đồ uống đặc trưng",
          "price": "20000-30000 VND/ly",
          "where": "Các quán nước địa phương"
        },
        {
          "name": "Bánh căn",
          "description": "Món ăn truyền thống",
          "price": "25000-35000 VND/phần",
          "where": "Các quán ăn vặt"
        }
      ]
    },
    {
      "id": "dinh-thay-thim",
      "name": "Dinh Thầy Thím",
      "location": "Bình Thuận",
      "image": "assets/images/places/checkin-dinh-thay-thim.png",
      "description": "Di tích tâm linh cổ của vùng đất Bình Thuận, nơi ghi dấu câu chuyện huyền thoại về đôi vợ chồng đạo sĩ với tấm lòng nhân ái",
      "customSection": {
        "title": "Huyền Thoại Thầy Thím - Câu Chuyện Về Đức Độ và Phép Màu",
        "content": "Theo truyền thuyết từ thời vua Gia Long, có một đạo sĩ tài ba cùng người vợ hiền từ Quảng Nam vào Nam lánh nạn sau khi bị triều đình xét xử oan ức. Họ dừng chân tại làng Tam Tân (nay là xã Tân Tiến, LaGi, Bình Thuận) và được dân làng gọi thân thương là Thầy - Thím. Thầy nổi tiếng với tài phép phi thường và tấm lòng nhân ái: từ việc cầu mưa cứu hạn, chữa bệnh cứu người, đến đóng ghe giúp ngư dân. Một câu chuyện kỳ diệu kể rằng khi bị triều đình kết án, Thầy đã dùng một tấm lụa đào biến thành rồng, đưa vợ chồng bay về phương Nam. Tại Tam Tân, Thầy Thím sống giản dị, giúp đỡ dân làng, thậm chí còn cảm hóa được cả thú rừng. Khi họ qua đời, hai con hổ Bạch-Hắc thường xuyên về tảo mộ, canh giữ phần mộ của Thầy Thím. Cảm phục trước đức độ của họ, vua Thành Thái năm thứ 18 đã ban sắc phong 'Chí Đức Tiên Sinh, Chí Đức Nương Nương Tôn Thần'. Hàng năm vào ngày 15/9 âm lịch, người dân vẫn tổ chức lễ tế thu để tưởng nhớ công đức của Thầy Thím."
      },
      "detailedDescription": "Dinh Thầy Thím là di tích lịch sử văn hóa cấp quốc gia, nơi thờ các vị thần linh và các bậc tiền hiền có công với vùng đất. Công trình mang đậm kiến trúc truyền thống Nam Bộ.",
      "howToGet": "Từ Phan Thiết đi xe máy hoặc ô tô khoảng 20km theo hướng Hàm Thuận Nam.",
      "bestTimeToVisit": "Có thể thăm quan quanh năm, đặc biệt vào các dịp lễ hội.",
      "attractions": {
        "religious": [
          {
            "name": "Đình cổ",
            "description": "Công trình tâm linh với kiến trúc truyền thống",
            "image": "assets/images/places/checkin-dinh-thay-thim.png"
          },
          {
            "name": "Khu thờ tự",
            "description": "Nơi thờ phụng trang nghiêm",
            "image": "assets/images/places/khu-tho-dinh.jpg"
          }
        ],
        "historical": [
          {
            "name": "Bảo tàng",
            "description": "Nơi trưng bày hiện vật lịch sử",
            "image": "assets/images/places/bao-tang-dinh.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Bánh tráng nướng",
          "description": "Món ăn vặt đặc trưng",
          "image": "assets/images/foods/banh-trang-nuong.jpg"
        },
        {
          "name": "Nước mía",
          "description": "Đồ uống giải khát truyền thống",
          "image": "assets/images/foods/nuoc-mia.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Làng chài Mũi Né",
          "description": "Làng chài truyền thống",
          "distance": "10km",
          "image": "assets/images/places/lang-chai-mui-ne.jpg"
        },
        {
          "name": "Suối Hồng",
          "description": "Thắng cảnh thiên nhiên",
          "distance": "15km",
          "image": "assets/images/places/suoi-hong.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Bánh canh chả cá",
          "description": "Món ăn truyền thống",
          "price": "30000-45000 VND/tô",
          "where": "Các quán ăn gần đình"
        },
        {
          "name": "Bánh xèo",
          "description": "Món ăn đặc sản",
          "price": "25000-35000 VND/cái",
          "where": "Các quán ăn địa phương"
        }
      ]
    },
    {
      "id": "ba-chua-xu-nui-sam",
      "name": "Miếu Bà Chúa Xứ",
      "location": "An Giang",
      "image": "assets/images/places/checkin-ba-chua-xu-nui-sam.png",
      "description": "Điểm tâm linh nổi tiếng miền Tây",
      "detailedDescription": "Miếu Bà Chúa Xứ núi Sam là một trong những điểm tâm linh nổi tiếng nhất miền Tây Nam Bộ. Hàng năm có hàng triệu lượt khách hành hương đến cầu may mắn và bình an.",
      "howToGet": "Từ TP.HCM đi xe khách đến Châu Đốc, sau đó đi xe ôm hoặc taxi đến núi Sam.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là vào dịp lễ hội Bà Chúa Xứ (tháng 4-5 âm lịch).",
      "attractions": {
        "religious": [
          {
            "name": "Miếu Bà",
            "description": "Công trình tâm linh linh thiêng với kiến trúc độc đáo",
            "image": "assets/images/places/checkin-ba-chua-xu-nui-sam.png"
          },
          {
            "name": "Điện thờ chính",
            "description": "Nơi thờ phụng trang nghiêm",
            "image": "assets/images/places/dien-tho-ba.jpg"
          }
        ],
        "natural": [
          {
            "name": "Núi Sam",
            "description": "Ngọn núi thiêng với cảnh quan đẹp",
            "image": "assets/images/places/nui-sam.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Bún cá Châu Đốc",
          "description": "Món ăn đặc sản nổi tiếng",
          "image": "assets/images/foods/bun-ca-chau-doc.jpg"
        },
        {
          "name": "Mắm Châu Đốc",
          "description": "Đặc sản truyền thống",
          "image": "assets/images/foods/mam-chau-doc.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Chợ Châu Đốc",
          "description": "Chợ truyền thống sầm uất",
          "distance": "2km",
          "image": "assets/images/places/cho-chau-doc.jpg"
        },
        {
          "name": "Lăng Thoại Ngọc Hầu",
          "description": "Di tích lịch sử",
          "distance": "3km",
          "image": "assets/images/places/lang-thoai-ngoc-hau.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Bún cá Châu Đốc",
          "description": "Món ăn truyền thống",
          "price": "35000-50000 VND/tô",
          "where": "Các quán ăn dưới chân núi"
        },
        {
          "name": "Chè chuối",
          "description": "Món tráng miệng",
          "price": "15000-25000 VND/chén",
          "where": "Các quán chè xung quanh"
        }
      ]
    },
    {
      "id": "cot-co-ca-mau",
      "name": "Cột cờ Cà Mau",
      "location": "Cà Mau",
      "image": "assets/images/places/checkin-cot-co-ca-mau.png",
      "description": "Điểm cực Nam của Tổ quốc",
      "detailedDescription": "Cột cờ Cà Mau đánh dấu điểm cực Nam của đất nước, nằm tại Mũi Cà Mau. Đây là công trình có ý nghĩa lịch sử và là điểm đến không thể bỏ qua khi đến Cà Mau.",
      "howToGet": "Từ TP Cà Mau đi xe khách hoặc thuê xe đến Năm Căn, sau đó đi tàu ra Mũi.",
      "bestTimeToVisit": "Thời điểm thích hợp là mùa khô (tháng 12-4).",
      "attractions": {
        "historical": [
          {
            "name": "Cột cờ Tổ quốc",
            "description": "Công trình lịch sử tại điểm cực Nam của đất nước",
            "image": "assets/images/places/checkin-cot-co-ca-mau.png"
          },
          {
            "name": "Bia tưởng niệm",
            "description": "Bia đánh dấu điểm cực Nam",
            "image": "assets/images/places/bia-tuong-niem.jpg"
          }
        ],
        "natural": [
          {
            "name": "Rừng ngập mặn",
            "description": "Hệ sinh thái đặc trưng",
            "image": "assets/images/places/rung-ngap-man.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Cua Cà Mau",
          "description": "Đặc sản nổi tiếng",
          "image": "assets/images/foods/cua-ca-mau.jpg"
        },
        {
          "name": "Tôm sú",
          "description": "Hải sản tươi ngon",
          "image": "assets/images/foods/tom-su.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Vườn quốc gia Mũi Cà Mau",
          "description": "Khu bảo tồn thiên nhiên",
          "distance": "1km",
          "image": "assets/images/places/vuon-quoc-gia-mui-ca-mau.jpg"
        },
        {
          "name": "Chợ nổi Cà Mau",
          "description": "Chợ truyền thống trên sông",
          "distance": "20km",
          "image": "assets/images/places/cho-noi-ca-mau.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cua rang me",
          "description": "Món ăn đặc sản",
          "price": "200000-300000 VND/kg",
          "where": "Các nhà hàng hải sản"
        },
        {
          "name": "Cá kèo nướng",
          "description": "Món ăn dân dã",
          "price": "100000-150000 VND/phần",
          "where": "Các quán ăn địa phương"
        }
      ]
    },
    {
      "id": "nui-ba-den-tay-ninh",
      "name": "Núi Bà Đen",
      "location": "Tây Ninh",
      "image": "assets/images/places/checkin_nui-ba-den-tay-ninh.png",
      "description": "Ngọn núi thiêng với nhiều di tích tâm linh",
      "detailedDescription": "Núi Bà Đen là ngọn núi cao nhất Nam Bộ, nổi tiếng với quần thể chùa chiền và các di tích tâm linh. Đây là điểm du lịch tâm linh quan trọng của vùng Đông Nam Bộ.",
      "howToGet": "Núi Bà Đen cách TP.HCM khoảng 110km. Từ trung tâm Sài Gòn, bạn có thể di chuyển đến núi bằng xe máy, xe buýt hoặc thuê xe ô tô. Có thể đi xe khách đến Tây Ninh, sau đó đi xe ôm hoặc taxi đến chân núi.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là từ tháng 11 đến tháng 4 năm sau.",
      "attractions": {
        "religious": [
          {
            "name": "Quần thể chùa",
            "description": "Các công trình tâm linh trên núi Bà Đen",
            "image": "assets/images/places/checkin_nui-ba-den-tay-ninh.png"
          },
          {
            "name": "Điện Bà",
            "description": "Nơi thờ Bà Đen linh thiêng",
            "image": "assets/images/places/dien-ba.jpg"
          }
        ],
        "natural": [
          {
            "name": "Thác Đồng Đen",
            "description": "Thác nước đẹp trên núi",
            "image": "assets/images/places/thac-dong-den.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Bánh canh Trảng Bàng",
          "description": "Món ăn đặc sản nổi tiếng của Tây Ninh",
          "image": "assets/images/foods/banh-canh-trang-bang.jpg"
        },
        {
          "name": "Bánh tráng phơi sương",
          "description": "Đặc sản bánh tráng mỏng tang được phơi sương sáng",
          "image": "assets/images/foods/banh-trang-phoi-suong.jpg"
        },
        {
          "name": "Bò tơ Tây Ninh",
          "description": "Thịt bò tơ tươi ngon đặc trưng của vùng",
          "image": "assets/images/foods/bo-to-tay-ninh.jpg"
        },
        {
          "name": "Tàu hủ nóng",
          "description": "Món ăn sáng phổ biến",
          "image": "assets/images/foods/tau-hu-nong.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Tòa Thánh Tây Ninh",
          "description": "Trung tâm đạo Cao Đài",
          "distance": "10km",
          "image": "assets/images/places/toa-thanh-tay-ninh.jpg"
        },
        {
          "name": "Khu du lịch Núi Bà",
          "description": "Khu vui chơi giải trí",
          "distance": "1km",
          "image": "assets/images/places/khu-du-lich-nui-ba.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Bánh canh Trảng Bàng",
          "description": "Món ăn truyền thống đặc sản nên thử",
          "restaurant": "Các quán ăn dưới chân núi",
          "price": "30000-45000 VND/tô"
        },
        {
          "name": "Bánh tráng phơi sương",
          "description": "Đặc sản địa phương nổi tiếng Tây Ninh",
          "restaurant": "Các cửa hàng đặc sản",
          "price": "15000-25000 VND/gói"
        },
        {
          "name": "Bò tơ Tây Ninh",
          "description": "Thịt bò tơ tươi ngon nên thử",
          "restaurant": "Các nhà hàng địa phương",
          "price": "200000-350000 VND/kg"
        },
        {
          "name": "Muối Tây Ninh",
          "description": "Đặc sản muối tinh khiết địa phương",
          "restaurant": "Các cửa hàng đặc sản",
          "price": "20000-40000 VND/kg"
        },
        {
          "name": "Nước mía",
          "description": "Đồ uống giải khát",
          "restaurant": "Các quầy nước dọc đường",
          "price": "10000-15000 VND/ly"
        }
      ]
    },
    {
      "id": "thap-cham-ninh-thuan",
      "name": "Tháp Chàm",
      "location": "Ninh Thuận",
      "image": "assets/images/places/checkin-thap-cham-ninh-thuan.jpg",
      "description": "Di tích kiến trúc Chăm Pa cổ",
      "detailedDescription": "Tháp Chàm Ninh Thuận là quần thể kiến trúc độc đáo của nền văn hóa Chăm Pa. Các tháp được xây dựng từ thế kỷ VIII với kiến trúc đặc trưng và nhiều hoa văn tinh xảo.",
      "howToGet": "Từ Phan Rang đi xe máy hoặc taxi khoảng 7km theo quốc lộ 1A.",
      "bestTimeToVisit": "Có thể thăm quan quanh năm, đẹp nhất vào buổi sáng sớm.",
      "attractions": {
        "historical": [
          {
            "name": "Tháp Chàm",
            "description": "Công trình kiến trúc cổ của văn hóa Chăm Pa",
            "image": "assets/images/places/checkin-thap-cham-ninh-thuan.jpg"
          },
          {
            "name": "Bảo tàng",
            "description": "Nơi trưng bày hiện vật văn hóa Chăm",
            "image": "assets/images/places/bao-tang-cham.jpg"
          }
        ],
        "cultural": [
          {
            "name": "Làng nghề gốm Chăm",
            "description": "Làng nghề truyền thống",
            "image": "assets/images/places/lang-nghe-gom-cham.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Bánh căn",
          "description": "Món ăn đặc trưng Ninh Thuận",
          "image": "assets/images/foods/banh-can.jpg"
        },
        {
          "name": "Thịt nướng Ninh Thuận",
          "description": "Đặc sản nổi tiếng",
          "image": "assets/images/foods/thit-nuong.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Vườn nho",
          "description": "Vườn nho nổi tiếng",
          "distance": "5km",
          "image": "assets/images/places/vuon-nho.jpg"
        },
        {
          "name": "Làng dệt thổ cẩm",
          "description": "Làng nghề truyền thống",
          "distance": "3km",
          "image": "assets/images/places/lang-det-tho-cam.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Bánh căn trứng",
          "description": "Món ăn truyền thống",
          "price": "25000-35000 VND/phần",
          "where": "Các quán ăn địa phương"
        },
        {
          "name": "Rượu nho",
          "description": "Đặc sản vùng miền",
          "price": "100000-200000 VND/chai",
          "where": "Các cửa hàng đặc sản"
        }
      ]
    },
    {
      "id": "mo-han-mac-tu",
      "name": "Mộ nhà thơ Hàn Mặc Tử",
      "location": "Bình Định",
      "image": "assets/images/places/checkin-mo-nha-tho-han-mac-tu_binh-dinh.jpg",
      "description": "Di tích tưởng niệm nhà thơ Hàn Mặc Tử (1912-1940) trên đồi Thi Nhân, Ghềnh Ráng Tiên Sa, nơi lưu giữ hồn thơ lãng mạn của một trong những thi sĩ nổi bật phong trào Thơ Mới Việt Nam",
      "detailedDescription": "Mộ nhà thơ Hàn Mặc Tử (tên thật Nguyễn Trọng Trí) là di tích văn hóa thiêng liêng ghi dấu cuộc đời và sự nghiệp của một trong những nhà thơ lãng mạn nổi tiếng nhất Việt Nam. Khu di tích nằm trên đồi Thi Nhân thuộc khu du lịch Ghềnh Ráng Tiên Sa, Quy Nhơn, với khung cảnh thơ mộng giữa núi đồi và biển cả. Nơi đây không chỉ là khu tưởng niệm mà còn là điểm đến tâm linh dành cho những ai yêu thích văn học và thơ ca. Ngôi mộ đơn sơ nằm giữa khung cảnh đồi núi xanh tươi, xung quanh là rừng cây và đá chồng lên nhau tạo nên không gian thơ mộng, u tịch đúng với hồn thơ Hàn Mặc Tử. Đây là nơi du khách có thể tĩnh tâm, suy ngẫm về cuộc đời và thơ văn của nhà thơ tài hoa nhưng đầy bi kịch.",
      "howToGet": "Từ Quảng trường trung tâm TP Quy Nhơn đi đường An Dương Vương, rẽ vào khu du lịch Ghềnh Ráng Tiên Sa (khoảng 2km về phía Đông Nam). Gửi xe tại cổng và đi bộ theo đường núi khoảng 5-10 phút là đến mộ Hàn Mặc Tử. Có thể di chuyển bằng xe máy, taxi hoặc đi bộ dọc biển.",
      "bestTimeToVisit": "Có thể thăm viếng quanh năm, mở cửa cả ngày và không thu vé vào cổng. Thời gian lý tưởng nhất là sáng sớm hoặc chiều mát để tránh nắng gắt, đặc biệt đẹp vào buổi sáng sớm khi không khí trong lành và yên tĩnh.",
      "customSection": {
        "title": "Hàn Mặc Tử - Nhà thơ của tình yêu và nỗi đau",
        "content": "<div class=\"custom-section-item\"><div><h4>Thân thế</h4><p>Hàn Mặc Tử, tên thật là Nguyễn Trọng Trí, sinh ngày 22 tháng 9 năm 1912 tại Đồng Hới, Quảng Bình. Ông là một trong những nhà thơ tiên phong của dòng thơ lãng mạn hiện đại Việt Nam và là người khởi xướng Trường thơ Loạn.</p><h4>Sự nghiệp văn chương</h4><p>Trong giai đoạn sáng tác từ 1928-1940, ông đã để lại nhiều tác phẩm nổi tiếng như \\\"Gái quê\\\" (1936), \\\"Đau thương\\\" (1938), và \\\"Xuân như ý\\\". Ông cùng với Quách Tấn, Yến Lan, Chế Lan Viên được người đương thời ở Bình Định gọi là \\\"Bàn thành tứ hữu\\\" - Bốn người bạn ở thành Đồ Bàn.</p><h4>Những bài thơ bất hủ</h4><p>Hàn Mặc Tử để lại nhiều bài thơ bất hủ trong nền văn học Việt Nam như \\\"Đây thôn Vĩ Dạ\\\", \\\"Mùa xuân chín\\\", \\\"Tình quê\\\", \\\"Trăng vàng trăng ngọc\\\". Thơ ông mang đậm chất lãng mạn, trữ tình nhưng cũng chứa đựng nỗi đau và sự day dứt của cuộc đời.</p><h4>Cuộc đời và di sản</h4><p>Mặc dù có cuộc đời ngắn ngủi (1912-1940), Hàn Mặc Tử đã để lại dấu ấn sâu đậm trong nền văn học Việt Nam. Ông mất ngày 11 tháng 11 năm 1940 tại Quy Nhơn, Bình Định, khi mới 28 tuổi. Ngày nay, mộ phần của ông trên đồi Thi Nhân đã trở thành một địa điểm văn hóa, thu hút nhiều người yêu thơ và du khách đến thăm viếng.</p></div></div>"
      },
      "attractions": {
        "cultural": [
          {
            "name": "Mộ Hàn Mặc Tử trên đồi Thi Nhân",
            "description": "Ngôi mộ đơn sơ nằm giữa khung cảnh thơ mộng với rừng cây và đá chồng lên nhau, gần mộ có bức tượng bán thân thi sĩ và bia đá khắc thơ",
            "image": "assets/images/places/checkin-mo-nha-tho-han-mac-tu_binh-dinh.jpg"
          },
          {
            "name": "Nhà trưng bày thơ khắc gỗ Dzũ Kha",
            "description": "Nơi lưu giữ các tác phẩm thơ Hàn Mặc Tử được nghệ nhân Dzũ Kha khắc lên gỗ - một hình thức nghệ thuật độc đáo và đầy ý nghĩa",
            "image": "assets/images/places/nha-trung-bay-tho-khac-go.jpg"
          },
          {
            "name": "Trại phong Quy Hòa",
            "description": "Nơi Hàn Mặc Tử sống những năm cuối đời, cách mộ khoảng 2km, là điểm tham quan để hiểu thêm về cuộc đời nhà thơ",
            "image": "assets/images/places/trai-phong-quy-hoa.jpg"
          }
        ],
        "natural": [
          {
            "name": "Đồi Thi Nhân",
            "description": "Khung cảnh thiên nhiên tuyệt đẹp với view nhìn ra biển Quy Hòa xanh ngắt, ghềnh đá lởm chởm và toàn cảnh thành phố Quy Nhơn",
            "image": "assets/images/places/doi-thi-nhan.jpg"
          },
          {
            "name": "Ghềnh Ráng Tiên Sa",
            "description": "Khu du lịch sinh thái với cảnh quan đẹp, nơi có mộ Hàn Mặc Tử và nhiều điểm tham quan khác",
            "image": "assets/images/places/ghenh-rang-tien-sa.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Bánh hỏi lòng heo",
          "description": "Món ăn đặc sản Bình Định với bánh hỏi mỏng mềm ăn cùng lòng heo nấu đậm đà",
          "image": "assets/images/foods/banh-hoi-long-heo.jpg"
        },
        {
          "name": "Bún chả cá Quy Nhơn",
          "description": "Món ăn truyền thống nổi tiếng với cá nướng thơm ngon và bún tươi",
          "image": "assets/images/foods/bun-cha-ca-quy-nhon.jpg"
        },
        {
          "name": "Tôm cang Quy Nhơn",
          "description": "Đặc sản hải sản tươi ngon, thịt ngọt và chắc đặc trưng vùng biển Quy Nhơn",
          "image": "assets/images/foods/tom-cang-quy-nhon.jpg"
        },
        {
          "name": "Bánh xèo tôm nhảy",
          "description": "Món ăn độc đáo của Bình Định với tôm tươi nhảy múa trên bánh xèo giòn rụm",
          "image": "assets/images/foods/banh-xeo-tom-nhay.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Ghềnh Ráng",
          "description": "Thắng cảnh thiên nhiên nổi tiếng với những khối đá granite khổng lồ và view biển đẹp",
          "distance": "1km",
          "travelTime": "5 phút đi bộ",
          "image": "assets/images/places/ghenh-rang.jpg"
        },
        {
          "name": "Bãi tắm Hoàng Hậu",
          "description": "Bãi biển đẹp với cát trắng mịn và nước biển trong xanh, phù hợp tắm biển và nghỉ dưỡng",
          "distance": "2km",
          "travelTime": "10 phút đi bộ",
          "image": "assets/images/places/bai-tam-hoang-hau.jpg"
        },
        {
          "name": "Khu du lịch Ghềnh Ráng Tiên Sa",
          "description": "Khu du lịch sinh thái với nhiều hoạt động giải trí và cảnh quan đẹp",
          "distance": "0.5km",
          "travelTime": "3 phút đi bộ",
          "image": "assets/images/places/khu-du-lich-ghenh-rang.jpg"
        },
        {
          "name": "Trung tâm thành phố Quy Nhơn",
          "description": "Khu vực trung tâm với nhiều điểm mua sắm, ẩm thực và tham quan",
          "distance": "2km",
          "travelTime": "10 phút đi xe máy",
          "image": "assets/images/places/trung-tam-quy-nhon.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Bánh hỏi lòng heo",
          "description": "Món ăn truyền thống đặc trưng Bình Định",
          "price": "35000-50000 VND/phần",
          "where": "Các quán ăn gần khu di tích Ghềnh Ráng"
        },
        {
          "name": "Bún chả cá Quy Nhơn",
          "description": "Đặc sản nổi tiếng với cá nướng thơm ngon",
          "price": "40000-60000 VND/tô",
          "where": "Quán bún chả cá Bà Út - Đường Lê Hồng Phong"
        },
        {
          "name": "Tôm cang nướng",
          "description": "Hải sản tươi ngon đặc trưng vùng biển",
          "price": "200000-300000 VND/kg",
          "where": "Các nhà hàng hải sản ven biển Quy Nhơn"
        },
        {
          "name": "Chè đậu xanh",
          "description": "Món tráng miệng mát lạnh, phù hợp sau khi tham quan",
          "price": "15000-25000 VND/chén",
          "where": "Các quán chè xung quanh khu di tích"
        }
      ]
    },
    {
      "id": "vinh-nghe-an",
      "name": "Thành phố Vinh",
      "location": "Nghệ An",
      "image": "assets/images/places/checkin_vinh_nghe-an.jpg",
      "description": "Thành phố lớn nhất Bắc Trung Bộ",
      "detailedDescription": "Thành phố Vinh là trung tâm kinh tế, văn hóa của tỉnh Nghệ An và vùng Bắc Trung Bộ. Nơi đây có nhiều di tích lịch sử quan trọng và là quê hương của nhiều danh nhân văn hóa.",
      "howToGet": "Có thể đến Vinh bằng máy bay (sân bay Vinh), tàu hỏa hoặc xe khách.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là từ tháng 9 đến tháng 4 năm sau.",
      "attractions": {
        "cultural": [
          {
            "name": "Quảng trường Hồ Chí Minh",
            "description": "Trung tâm văn hóa, chính trị của thành phố",
            "image": "assets/images/places/checkin_vinh_nghe-an.jpg"
          },
          {
            "name": "Bảo tàng Nghệ An",
            "description": "Nơi trưng bày lịch sử văn hóa địa phương",
            "image": "assets/images/places/bao-tang-nghe-an.jpg"
          }
        ],
        "historical": [
          {
            "name": "Khu di tích Kim Liên",
            "description": "Quê hương Chủ tịch Hồ Chí Minh",
            "image": "assets/images/places/kim-lien.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Bánh mướt",
          "description": "Món ăn truyền thống Nghệ An",
          "image": "assets/images/foods/banh-muot.jpg"
        },
        {
          "name": "Cháo lươn",
          "description": "Đặc sản nổi tiếng xứ Nghệ",
          "image": "assets/images/foods/chao-luon.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Biển Cửa Lò",
          "description": "Bãi biển đẹp gần thành phố",
          "distance": "15km",
          "image": "assets/images/places/bien-cua-lo.jpg"
        },
        {
          "name": "Núi Quyết",
          "description": "Điểm ngắm cảnh thành phố",
          "distance": "3km",
          "image": "assets/images/places/nui-quyet.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cháo lươn Vinh",
          "description": "Món ăn đặc trưng",
          "price": "30000-45000 VND/bát",
          "where": "Các quán cháo lươn nổi tiếng"
        },
        {
          "name": "Bánh mướt",
          "description": "Món ăn truyền thống",
          "price": "20000-30000 VND/phần",
          "where": "Các quán ăn sáng"
        }
      ]
    },
    {
      "id": "tuy-hoa-phu-yen",
      "name": "Thành phố Tuy Hòa",
      "location": "Phú Yên",
      "image": "assets/images/places/checkin_tuy-hoa_phu-yen.jpg",
      "description": "Thành phố biển xinh đẹp với danh thắng Gành Đá Đĩa độc đáo, bãi biển hoang sơ và ẩm thực đặc sắc, được mệnh danh là 'viên ngọc ẩn' của duyên hải Nam Trung Bộ",
      "detailedDescription": "Tuy Hòa là thủ phủ của tỉnh Phú Yên, một thành phố biển quyến rũ với những thắng cảnh thiên nhiên tuyệt đẹp và di sản văn hóa phong phú. Nơi đây nổi tiếng với Gành Đá Đĩa - kỳ quan thiên nhiên với những khối đá bazan hình lục giác độc đáo, bãi biển Bãi Xép hoang sơ tuyệt đẹp, và Đầm Ô Loan với hệ sinh thái đa dạng. Phú Yên còn là vùng đất có nền ẩm thực đặc sắc với những món ăn mang đậm bản sắc địa phương như bánh canh hẹ, mực một nắng, sò huyết. Thành phố cũng lưu giữ nhiều di tích lịch sử văn hóa Chăm Pa với quần thể tháp cổ và truyền thống làng nghề truyền thống. Tuy Hòa là điểm đến lý tưởng cho du khách yêu thích khám phá những vẻ đẹp hoang sơ, thưởng thức ẩm thực đậm đà và trải nghiệm văn hóa bản địa.",
      "howToGet": "Từ TP.HCM: máy bay (1 giờ đến sân bay Tuy Hòa), tàu hỏa (10-12 giờ đến ga Tuy Hòa), xe khách (8-10 giờ). Từ Hà Nội: máy bay (1.5 giờ), tàu hỏa (14-16 giờ), xe khách (12-14 giờ). Trong thành phố có thể thuê xe máy, taxi hoặc xe ôm để di chuyển.",
      "bestTimeToVisit": "Thời điểm lý tưởng nhất là từ tháng 3 đến tháng 8 khi thời tiết ổn định, ít mưa bão và biển êm đẹp. Tránh mùa mưa bão từ tháng 9-12. Mùa khô từ tháng 1-8 phù hợp cho các hoạt động tham quan và thể thao biển.",
      "attractions": {
        "natural": [
          {
            "name": "Gành Đá Đĩa",
            "description": "Kỳ quan thiên nhiên với hàng nghìn cột đá bazan hình lục giác xếp chồng lên nhau như những chiếc đĩa khổng lồ, được hình thành từ hoạt động núi lửa cách đây hàng triệu năm",
            "image": "assets/images/places/ganh-da-dia.jpg"
          },
          {
            "name": "Bãi Xép",
            "description": "Bãi biển hoang sơ đẹp nhất Phú Yên với cát vàng mịn, nước biển trong xanh và khung cảnh yên bình, là điểm đến lý tưởng cho việc nghỉ dưỡng và chụp ảnh",
            "image": "assets/images/places/bai-xep.jpg"
          },
          {
            "name": "Đầm Ô Loan",
            "description": "Đầm nước lợ lớn nhất Phú Yên với hệ sinh thái đa dạng, nổi tiếng với đặc sản sò huyết và cảnh quan thiên nhiên tuyệt đẹp với những thúng chai đánh cá độc đáo",
            "image": "assets/images/places/dam-o-loan.jpg"
          },
          {
            "name": "Mũi Điện",
            "description": "Điểm cực Đông của đất liền Việt Nam với hải đăng cổ và cảnh quan biển hùng vĩ, là nơi đón ánh bình minh đầu tiên trên đất liền",
            "image": "assets/images/places/mui-dien.jpg"
          },
          {
            "name": "Hòn Nưa",
            "description": "Hòn đảo nhỏ với bãi biển hoang sơ và rạn san hô đẹp, điểm đến lý tưởng cho hoạt động lặn ngắm san hô và câu cá",
            "image": "assets/images/places/hon-nua.jpg"
          }
        ],
        "cultural": [
          {
            "name": "Tháp Nhạn",
            "description": "Quần thể tháp Chăm cổ từ thế kỷ 12-13 với kiến trúc độc đáo và nghệ thuật điêu khắc tinh xảo, là di sản văn hóa quan trọng của người Chăm",
            "image": "assets/images/places/thap-nhan.jpg"
          },
          {
            "name": "Tháp Bình Lâm",
            "description": "Tháp Chăm cổ còn nguyên vẹn với kiến trúc đặc trưng và giá trị lịch sử văn hóa cao",
            "image": "assets/images/places/thap-binh-lam.jpg"
          },
          {
            "name": "Nhà thờ Mằng Lăng",
            "description": "Công trình kiến trúc tôn giáo độc đáo với lối kiến trúc Âu - Á kết hợp",
            "image": "assets/images/places/nha-tho-mang-lang.jpg"
          }
        ],
        "adventure": [
          {
            "name": "Bãi Môn",
            "description": "Bãi biển với những mỏm đá tự nhiên tạo hình độc đáo, điểm check-in nổi tiếng của giới trẻ",
            "image": "assets/images/places/bai-mon.jpg"
          },
          {
            "name": "Vịnh Vũng Rô",
            "description": "Vịnh kín đẹp nhất Việt Nam với núi non bao quanh và nước biển xanh ngắt, có ý nghĩa lịch sử quan trọng",
            "image": "assets/images/places/vinh-vung-ro.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Bánh canh hẹ",
          "description": "Món ăn đặc trưng của Phú Yên với sợi bánh canh dai ngon, nước dùng đậm đà từ xương heo và hẹ xanh thơm ngon",
          "image": "assets/images/foods/banh-canh-he.jpg"
        },
        {
          "name": "Mực một nắng",
          "description": "Đặc sản hải sản được phơi khô một nắng với hương vị thơm ngon, ngọt tự nhiên của biển khơi",
          "image": "assets/images/foods/muc-mot-nang.jpg"
        },
        {
          "name": "Sò huyết Ô Loan",
          "description": "Đặc sản nổi tiếng từ đầm Ô Loan với thịt sò ngọt thanh và nước dùng màu đỏ đặc trưng",
          "image": "assets/images/foods/so-huyet-o-loan.jpg"
        },
        {
          "name": "Bánh hỏi lòng heo",
          "description": "Món ăn truyền thống với bánh hỏi mềm và lòng heo được nấu đậm đà, thơm ngon",
          "image": "assets/images/foods/banh-hoi-long-heo.jpg"
        },
        {
          "name": "Cá ngừ nướng lá chuối",
          "description": "Đặc sản từ cá ngừ tươi được ướp gia vị và nướng trong lá chuối, giữ nguyên hương vị tự nhiên",
          "image": "assets/images/foods/ca-ngu-nuong-la-chuoi.jpg"
        },
        {
          "name": "Ốc hến xào dứa",
          "description": "Món ăn độc đáo với ốc hến tươi xào cùng dứa, tạo vị chua ngọt hài hòa",
          "image": "assets/images/foods/oc-hen-xao-dua.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Bãi Xép",
          "description": "Bãi biển hoang sơ đẹp nhất Phú Yên với cảnh quan thiên nhiên tuyệt vời",
          "distance": "15km",
          "travelTime": "25 phút đi xe máy",
          "image": "assets/images/places/bai-xep.jpg"
        },
        {
          "name": "Đầm Ô Loan",
          "description": "Đầm nước lợ với hệ sinh thái phong phú và đặc sản sò huyết nổi tiếng",
          "distance": "20km",
          "travelTime": "30 phút đi xe máy",
          "image": "assets/images/places/dam-o-loan.jpg"
        },
        {
          "name": "Gành Đá Đĩa",
          "description": "Kỳ quan thiên nhiên với những cột đá bazan hình lục giác độc đáo",
          "distance": "25km",
          "travelTime": "35 phút đi xe máy",
          "image": "assets/images/places/ganh-da-dia.jpg"
        },
        {
          "name": "Mũi Điện",
          "description": "Điểm cực Đông của đất liền với hải đăng cổ và cảnh bình minh tuyệt đẹp",
          "distance": "30km",
          "travelTime": "45 phút đi xe máy",
          "image": "assets/images/places/mui-dien.jpg"
        },
        {
          "name": "Vịnh Vũng Rô",
          "description": "Vịnh kín đẹp nhất Việt Nam với núi non và biển xanh hùng vĩ",
          "distance": "40km",
          "travelTime": "1 giờ đi xe máy",
          "image": "assets/images/places/vinh-vung-ro.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Bánh canh hẹ",
          "description": "Món ăn đặc trưng Phú Yên với hương vị đậm đà",
          "price": "25000-35000 VND/tô",
          "where": "Quán Cô Ba Sáu - Đường Lê Duẩn, Quán Bà Tám - Chợ Tuy Hòa"
        },
        {
          "name": "Sò huyết Ô Loan",
          "description": "Đặc sản nổi tiếng với thịt sò ngọt thanh",
          "price": "80000-150000 VND/phần",
          "where": "Nhà hàng Hải sản Ô Loan - Đầm Ô Loan, Quán Năm Em - Gần cảng"
        },
        {
          "name": "Mực một nắng nướng",
          "description": "Hải sản đặc trưng được nướng thơm ngon",
          "price": "150000-250000 VND/kg",
          "where": "Chợ đêm Tuy Hòa, Các quán ăn ven biển"
        },
        {
          "name": "Bánh hỏi lòng heo",
          "description": "Món ăn truyền thống với bánh hỏi mềm",
          "price": "30000-45000 VND/phần",
          "where": "Quán Dì Tư - Phố Lý Thường Kiệt, Quán Bà Nội - Gần chợ"
        },
        {
          "name": "Cá ngừ nướng lá chuối",
          "description": "Đặc sản cá ngừ tươi nướng thơm lừng",
          "price": "200000-300000 VND/kg",
          "where": "Nhà hàng Biển Xanh - Đường Trần Hưng Đạo"
        }
      ]
    },
    {
      "id": "ngu-hanh-son-da-nang",
      "name": "Ngũ Hành Sơn",
      "location": "Đà Nẵng",
      "image": "assets/images/places/checkin_ngu-hanh-son_da-nang.jpg",
      "description": "Danh thắng với năm ngọn núi đá vôi",
      "detailedDescription": "Ngũ Hành Sơn là quần thể gồm năm ngọn núi đá vôi, mang tên Kim, Mộc, Thủy, Hỏa, Thổ. Nơi đây có nhiều hang động đẹp, chùa chiền cổ kính và là trung tâm đá mỹ nghệ nổi tiếng.",
      "customSection": [
        {
          "title": "Sự tích & Huyền thoại về Ngũ Hành Sơn",
          "content": "<p>Theo truyền thuyết, Ngũ Hành Sơn được hình thành từ một quả trứng của chim thần khổng lồ. Sau khi chim nở, vỏ trứng vỡ thành năm mảnh, hóa thành năm ngọn núi tượng trưng cho ngũ hành:</p><ul><li><strong>Núi Kim Sơn (Kim):</strong> Tượng trưng cho vàng, cao 106m, có hình dáng như một đồng tiền cổ</li><li><strong>Núi Mộc Sơn (Mộc):</strong> Tượng trưng cho cây cối, có nhiều cây cổ thụ</li><li><strong>Núi Thủy Sơn (Thủy):</strong> Tượng trưng cho nước, là ngọn núi cao nhất và đẹp nhất</li><li><strong>Núi Hỏa Sơn (Hỏa):</strong> Tượng trưng cho lửa, có màu đỏ đặc trưng</li><li><strong>Núi Thổ Sơn (Thổ):</strong> Tượng trưng cho đất, là ngọn núi thấp nhất</li></ul>"
        },
        {
          "title": "Giá trị tâm linh & văn hóa",
          "content": "<p>Ngũ Hành Sơn không chỉ là danh thắng mà còn là trung tâm tâm linh quan trọng:</p><ul><li>Là nơi tu hành của nhiều vị cao tăng từ thế kỷ 17</li><li>Có hệ thống chùa, am tự cổ kính như chùa Linh Ứng, chùa Tam Thai</li><li>Nhiều hang động tự nhiên được biến thành không gian thờ tự như động Huyền Không, động Vân Thông</li><li>Là nơi giao thoa giữa Phật giáo, tín ngưỡng dân gian và văn hóa Chăm</li></ul>"
        },
        {
          "title": "Làng nghề đá mỹ nghệ Non Nước",
          "content": "<p>Dưới chân Ngũ Hành Sơn là làng đá mỹ nghệ Non Nước nổi tiếng:</p><ul><li>Làng nghề truyền thống có từ thế kỷ 18</li><li>Nghệ nhân tạc tượng từ đá cẩm thạch tự nhiên</li><li>Sản phẩm đa dạng từ tượng Phật, trang sức đến đồ trang trí</li><li>Được công nhận là di sản văn hóa phi vật thể quốc gia</li></ul>"
        }
      ],
      "howToGet": "Từ trung tâm Đà Nẵng đi xe máy hoặc taxi khoảng 8km về phía Đông Nam.",
      "bestTimeToVisit": "Có thể thăm quan quanh năm, đẹp nhất vào buổi sáng sớm.",
      "attractions": {
        "natural": [
          {
            "name": "Núi Ngũ Hành Sơn",
            "description": "Quần thể núi đá với nhiều hang động và chùa cổ",
            "image": "assets/images/places/checkin_ngu-hanh-son_da-nang.jpg"
          },
          {
            "name": "Động Huyền Không",
            "description": "Hang động tự nhiên đẹp",
            "image": "assets/images/places/dong-huyen-khong.jpg"
          }
        ],
        "religious": [
          {
            "name": "Chùa Linh Ứng",
            "description": "Ngôi chùa cổ trên núi",
            "image": "assets/images/places/chua-linh-ung.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Mì Quảng",
          "description": "Món ăn đặc trưng Đà Nẵng",
          "image": "assets/images/foods/mi-quang.jpg"
        },
        {
          "name": "Nước mía",
          "description": "Đồ uống giải khát phổ biến",
          "image": "assets/images/foods/nuoc-mia.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Bãi biển Mỹ Khê",
          "description": "Bãi biển đẹp nổi tiếng",
          "distance": "2km",
          "image": "assets/images/places/bai-bien-my-khe.jpg"
        },
        {
          "name": "Làng đá mỹ nghệ",
          "description": "Làng nghề truyền thống",
          "distance": "1km",
          "image": "assets/images/places/lang-da-my-nghe.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Mì Quảng",
          "description": "Món ăn truyền thống",
          "price": "25000-35000 VND/tô",
          "where": "Các quán ăn dưới chân núi"
        },
        {
          "name": "Bánh tráng cuốn thịt heo",
          "description": "Món ăn đặc sản",
          "price": "40000-60000 VND/phần",
          "where": "Các quán ăn địa phương"
        }
      ]
    },
    {
      "id": "hue",
      "name": "Cố đô Huế",
      "location": "Thừa Thiên Huế",
      "image": "assets/images/places/checkin_hue.jpg",
      "description": "Thành phố di sản với những công trình kiến trúc độc đáo",
      "detailedDescription": "Huế - cố đô của Việt Nam, là một thành phố đặc biệt với di sản văn hóa phong phú và kiến trúc độc đáo của triều Nguyễn. Nơi đây không chỉ nổi tiếng với các công trình lịch sử mà còn được biết đến với ẩm thực tinh tế và không gian sông Hương thơ mộng.",
      "howToGet": "Có thể đến Huế bằng máy bay (sân bay Phú Bài), tàu hỏa (ga Huế) hoặc xe khách.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là từ tháng 1 đến tháng 4.",
      "attractions": {
        "historical": [
          {
            "name": "Kinh thành Huế",
            "description": "Quần thể di tích cung đình triều Nguyễn",
            "image": "assets/images/places/checkin_hue.jpg"
          },
          {
            "name": "Lăng Tự Đức",
            "description": "Lăng tẩm hoàng gia đẹp nhất Huế",
            "image": "assets/images/places/lang-tu-duc.jpg"
          }
        ],
        "natural": [
          {
            "name": "Sông Hương",
            "description": "Dòng sông thơ mộng chảy qua thành phố",
            "image": "assets/images/places/song-huong.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Bún bò Huế",
          "description": "Món ăn đặc trưng xứ Huế",
          "image": "assets/images/foods/bun-bo-hue.jpg"
        },
        {
          "name": "Bánh bèo",
          "description": "Món ăn truyền thống",
          "image": "assets/images/foods/banh-beo.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Chùa Thiên Mụ",
          "description": "Ngôi chùa cổ nổi tiếng",
          "distance": "5km",
          "image": "assets/images/places/chua-thien-mu.jpg"
        },
        {
          "name": "Đồi Vọng Cảnh",
          "description": "Điểm ngắm cảnh đẹp",
          "distance": "7km",
          "image": "assets/images/places/doi-vong-canh.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cơm hến",
          "description": "Món ăn dân dã",
          "price": "25000-35000 VND/phần",
          "where": "Các quán ăn ven sông Hương"
        },
        {
          "name": "Chè Huế",
          "description": "Món tráng miệng đặc trưng",
          "price": "15000-25000 VND/chén",
          "where": "Các quán chè truyền thống"
        }
      ]
    },
    {
      "id": "hoi-an-quang-nam",
      "name": "Phố cổ Hội An",
      "location": "Quảng Nam",
      "image": "assets/images/places/checkin_hoi-an_quang-nam.jpg",
      "description": "Phố cổ với kiến trúc truyền thống độc đáo",
      "detailedDescription": "Hội An là đô thị cổ được UNESCO công nhận là Di sản Văn hóa Thế giới. Nơi đây nổi tiếng với những ngôi nhà cổ, đèn lồng rực rỡ và là điểm du lịch hấp dẫn của miền Trung.",
      "howToGet": "Từ Đà Nẵng đi xe khách hoặc taxi khoảng 30km về phía Nam.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là từ tháng 2 đến tháng 4.",
      "attractions": {
        "cultural": [
          {
            "name": "Phố cổ Hội An",
            "description": "Khu phố cổ với kiến trúc truyền thống và đèn lồng",
            "image": "assets/images/places/checkin_hoi-an_quang-nam.jpg"
          },
          {
            "name": "Chùa Cầu",
            "description": "Biểu tượng của Hội An",
            "image": "assets/images/places/chua-cau.jpg"
          }
        ],
        "historical": [
          {
            "name": "Nhà cổ Phùng Hưng",
            "description": "Ngôi nhà cổ tiêu biểu",
            "image": "assets/images/places/nha-co-phung-hung.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Cao lầu",
          "description": "Món mì đặc trưng Hội An",
          "image": "assets/images/foods/cao-lau.jpg"
        },
        {
          "name": "Bánh mì Phượng",
          "description": "Bánh mì nổi tiếng",
          "image": "assets/images/foods/banh-mi-phuong.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Bãi biển An Bàng",
          "description": "Bãi biển đẹp gần phố cổ",
          "distance": "4km",
          "image": "assets/images/places/bai-bien-an-bang.jpg"
        },
        {
          "name": "Làng gốm Thanh Hà",
          "description": "Làng nghề truyền thống",
          "distance": "3km",
          "image": "assets/images/places/lang-gom-thanh-ha.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cao lầu",
          "description": "Món ăn đặc trưng",
          "price": "30000-45000 VND/tô",
          "where": "Các quán trong phố cổ"
        },
        {
          "name": "Hoành thánh",
          "description": "Món ăn truyền thống",
          "price": "25000-35000 VND/phần",
          "where": "Chợ Hội An và các quán ăn"
        }
      ]
    },
    {
      "id": "deo-ngang",
      "name": "Đèo Ngang",
      "location": "Quảng Bình - Hà Tĩnh",
      "image": "assets/images/places/checkin_deo-ngang.jpg",
      "description": "Cửa ải thiên nhiên giữa Bắc - Trung",
      "detailedDescription": "Đèo Ngang là ranh giới tự nhiên giữa hai tỉnh Quảng Bình và Hà Tĩnh, nổi tiếng với cảnh quan hùng vĩ và nhiều truyền thuyết lịch sử. Đây là một trong những cung đường đèo đẹp nhất miền Trung.",
      "howToGet": "Đèo nằm trên quốc lộ 1A, cách thành phố Đồng Hới khoảng 80km về phía Bắc.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là từ tháng 3 đến tháng 8.",
      "attractions": {
        "natural": [
          {
            "name": "Đèo Ngang",
            "description": "Cung đường đèo với cảnh quan thiên nhiên hùng vĩ",
            "image": "assets/images/places/checkin_deo-ngang.jpg"
          },
          {
            "name": "Biển Đèo Ngang",
            "description": "Bãi biển hoang sơ dưới chân đèo",
            "image": "assets/images/places/bien-deo-ngang.jpg"
          }
        ],
        "historical": [
          {
            "name": "Bia Đèo Ngang",
            "description": "Di tích lịch sử ghi dấu ranh giới",
            "image": "assets/images/places/bia-deo-ngang.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Bánh bèo Hà Tĩnh",
          "description": "Món ăn truyền thống",
          "image": "assets/images/foods/banh-beo-ha-tinh.jpg"
        },
        {
          "name": "Kẹo cu đơ",
          "description": "Đặc sản Hà Tĩnh",
          "image": "assets/images/foods/keo-cu-do.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Vũng Chùa - Đảo Yến",
          "description": "Khu di tích lịch sử",
          "distance": "20km",
          "image": "assets/images/places/vung-chua-dao-yen.jpg"
        },
        {
          "name": "Bãi biển Thiên Cầm",
          "description": "Bãi biển đẹp Hà Tĩnh",
          "distance": "30km",
          "image": "assets/images/places/bai-bien-thien-cam.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Bánh bèo chén",
          "description": "Món ăn truyền thống",
          "price": "20000-30000 VND/10 chén",
          "where": "Các quán ăn dọc đèo"
        },
        {
          "name": "Cháo canh",
          "description": "Món ăn đặc trưng",
          "price": "25000-35000 VND/tô",
          "where": "Các quán ăn địa phương"
        }
      ]
    },
    {
      "id": "dai-noi-hue",
      "name": "Đại Nội Huế",
      "location": "Thừa Thiên Huế",
      "image": "assets/images/places/checkin_dai-noi_hue.jpg",
      "description": "Hoàng cung của triều Nguyễn",
      "detailedDescription": "Đại Nội Huế là quần thể kiến trúc hoàng cung của triều Nguyễn, bao gồm nhiều cung điện, đền đài và công trình kiến trúc độc đáo. Đây là di sản văn hóa thế giới được UNESCO công nhận.",
      "howToGet": "Đại Nội nằm ở trung tâm thành phố Huế, dễ dàng di chuyển bằng nhiều phương tiện.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là từ tháng 1 đến tháng 4.",
      "attractions": {
        "historical": [
          {
            "name": "Hoàng thành",
            "description": "Quần thể cung điện với kiến trúc hoàng gia độc đáo",
            "image": "assets/images/places/checkin_dai-noi_hue.jpg"
          },
          {
            "name": "Ngọ Môn",
            "description": "Cổng chính của Hoàng thành",
            "image": "assets/images/places/ngo-mon.jpg"
          }
        ],
        "cultural": [
          {
            "name": "Bảo tàng cổ vật",
            "description": "Nơi trưng bày cổ vật hoàng gia",
            "image": "assets/images/places/bao-tang-co-vat.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Cơm hến",
          "description": "Món ăn dân dã xứ Huế",
          "image": "assets/images/foods/com-hen.jpg"
        },
        {
          "name": "Bánh khoái",
          "description": "Món ăn truyền thống",
          "image": "assets/images/foods/banh-khoai.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Chùa Thiên Mụ",
          "description": "Ngôi chùa cổ nổi tiếng",
          "distance": "5km",
          "image": "assets/images/places/chua-thien-mu.jpg"
        },
        {
          "name": "Cầu Trường Tiền",
          "description": "Cây cầu biểu tượng của Huế",
          "distance": "1km",
          "image": "assets/images/places/cau-truong-tien.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Bánh bèo",
          "description": "Món ăn truyền thống",
          "price": "20000-30000 VND/10 chén",
          "where": "Các quán ăn gần Đại Nội"
        },
        {
          "name": "Chè Huế",
          "description": "Món tráng miệng đặc trưng",
          "price": "15000-25000 VND/chén",
          "where": "Các quán chè trong khu vực"
        }
      ]
    },
    {
      "id": "cho-con-da-nang",
      "name": "Chợ Cồn",
      "location": "Đà Nẵng",
      "image": "assets/images/places/checkin_cho-con_da-nang.jpg",
      "description": "Khu chợ truyền thống lớn nhất Đà Nẵng",
      "detailedDescription": "Chợ Cồn là khu chợ truyền thống lớn nhất Đà Nẵng, nơi tập trung nhiều mặt hàng đặc sản và ẩm thực địa phương. Đây là điểm đến lý tưởng để tìm hiểu văn hóa ẩm thực và đời sống của người dân địa phương.",
      "howToGet": "Chợ nằm ở trung tâm thành phố Đà Nẵng, dễ dàng di chuyển bằng nhiều phương tiện.",
      "bestTimeToVisit": "Chợ họp từ sáng sớm đến tối, nhộn nhịp nhất vào buổi sáng.",
      "attractions": {
        "shopping": [
          {
            "name": "Khu chợ truyền thống",
            "description": "Nơi tập trung nhiều đặc sản và ẩm thực Đà Nẵng",
            "image": "assets/images/places/checkin_cho-con_da-nang.jpg"
          },
          {
            "name": "Khu ẩm thực",
            "description": "Nơi thưởng thức đặc sản Đà Nẵng",
            "image": "assets/images/places/am-thuc-cho-con.jpg"
          }
        ],
        "cultural": [
          {
            "name": "Khu bán đồ thủ công",
            "description": "Nơi bán các sản phẩm thủ công mỹ nghệ",
            "image": "assets/images/places/thu-cong-cho-con.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Mì Quảng",
          "description": "Món ăn đặc trưng Đà Nẵng",
          "image": "assets/images/foods/mi-quang.jpg"
        },
        {
          "name": "Bánh tráng cuốn thịt heo",
          "description": "Món ăn truyền thống",
          "image": "assets/images/foods/banh-trang-cuon-thit-heo.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Sông Hàn",
          "description": "Dòng sông biểu tượng",
          "distance": "1km",
          "image": "assets/images/places/song-han.jpg"
        },
        {
          "name": "Cầu Rồng",
          "description": "Cầu biểu tượng của Đà Nẵng",
          "distance": "2km",
          "image": "assets/images/places/cau-rong.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Mì Quảng",
          "description": "Món ăn truyền thống",
          "price": "25000-35000 VND/tô",
          "where": "Các quán trong chợ"
        },
        {
          "name": "Bánh tráng kẹp",
          "description": "Món ăn vặt đặc trưng",
          "price": "15000-25000 VND/cái",
          "where": "Khu ẩm thực chợ"
        }
      ]
    },
    {
      "id": "cau-hien-luong",
      "name": "Cầu Hiền Lương",
      "location": "Quảng Trị",
      "image": "assets/images/places/checkin-cau-hien-luong-quang-tri.png",
      "description": "Cây cầu lịch sử trên sông Bến Hải, biểu tượng của sự chia cắt và thống nhất đất nước. Với chiều dài 178m, cầu Hiền Lương không chỉ là chứng nhân lịch sử mà còn là điểm du lịch thu hút du khách tìm hiểu về một giai đoạn lịch sử đặc biệt của dân tộc.",
      "customSection": {
        "title": "Hiệp định Geneva 1954 và Cầu Hiền Lương",
        "content": "<div class=\"custom-section-item\">\n<div class=\"folk-song-description\">\n<h4>Hiệp định Geneva 1954</h4>\nHiệp định Geneva được ký kết ngày 21/7/1954 tại Geneva, Thụy Sĩ, chính thức chấm dứt cuộc chiến tranh Đông Dương lần thứ nhất. Theo hiệp định này, vĩ tuyến 17 và sông Bến Hải trở thành ranh giới quân sự tạm thời giữa hai miền Nam - Bắc Việt Nam. Cầu Hiền Lương, bắc qua sông Bến Hải, trở thành biểu tượng của sự phân chia này.\n\n<h4>Ý nghĩa lịch sử</h4>\nCầu Hiền Lương được sơn hai màu: phía Bắc màu đỏ, phía Nam màu vàng, tượng trưng cho hai chế độ chính trị khác nhau. Trong suốt 21 năm (1954-1975), cây cầu này là điểm chứng kiến nhiều cuộc chia ly đau thương của các gia đình Việt Nam và cũng là nơi ghi dấu khát vọng thống nhất đất nước của toàn dân tộc.\n\n<h4>Khu phi quân sự (DMZ)</h4>\nTheo Hiệp định Geneva, một khu phi quân sự rộng 10km (mỗi bên 5km) được thiết lập dọc theo sông Bến Hải. Khu vực này trở thành vùng đệm giữa hai miền, dưới sự giám sát của Ủy ban Quốc tế Kiểm soát và Giám sát (ICC).\n\n<h4>Di tích lịch sử ngày nay</h4>\nHiện nay, cầu Hiền Lương và khu vực xung quanh đã trở thành một quần thể di tích lịch sử quốc gia đặc biệt. Nơi đây không chỉ là điểm du lịch hấp dẫn mà còn là địa điểm giáo dục truyền thống lịch sử cho thế hệ trẻ, nhắc nhớ về một thời kỳ đặc biệt trong lịch sử dân tộc và giá trị của hòa bình, thống nhất.</div>\n</div>"
      },
      "detailedDescription": "Cầu Hiền Lương là một di tích lịch sử quan trọng, nằm trên sông Bến Hải, tỉnh Quảng Trị. Được xây dựng từ thời Pháp thuộc, cây cầu này từng là ranh giới tạm thời giữa hai miền Nam - Bắc Việt Nam trong giai đoạn 1954-1975. Với hai màu sơn đặc trưng ở hai đầu cầu, công trình này đã trở thành biểu tượng của sự chia cắt và sau này là sự thống nhất đất nước. Ngày nay, cầu Hiền Lương không chỉ là điểm tham quan du lịch ý nghĩa mà còn là nơi giáo dục truyền thống lịch sử cho thế hệ trẻ.",
      "howToGet": "Từ trung tâm thành phố Đông Hà, Quảng Trị, bạn di chuyển theo Quốc lộ 1A khoảng 30km về phía Bắc là đến cầu Hiền Lương. Có thể đi bằng xe máy (khoảng 45 phút) hoặc taxi (khoảng 400.000 VND/chiều).",
      "bestTimeToVisit": "Thời điểm thích hợp để thăm cầu Hiền Lương là từ tháng 2 đến tháng 8, khi thời tiết khô ráo và thuận lợi cho việc tham quan. Nên đến vào buổi sáng sớm hoặc chiều tối để tránh nắng nóng và có những bức ảnh đẹp nhất.",
      "nearbyAttractions": [
        {
          "name": "Địa đạo Vịnh Mốc",
          "description": "Hệ thống địa đạo nổi tiếng thời kháng chiến, được xây dựng để bảo vệ người dân và chiến sĩ trong thời kỳ chiến tranh. Địa đạo có 3 tầng với tổng chiều dài hơn 1.700m.",
          "distance": "15km về phía Đông Bắc",
          "travelTime": "25 phút đi xe máy hoặc 20 phút đi ô tô",
          "image": "assets/images/places/dia-dao-vinh-moc.jpg"
        },
        {
          "name": "Thành cổ Quảng Trị",
          "description": "Di tích lịch sử của những trận đánh ác liệt trong chiến tranh, nơi ghi dấu 81 ngày đêm chiến đấu anh dũng của quân và dân ta năm 1972",
          "distance": "20km về phía Nam",
          "travelTime": "35 phút đi xe máy hoặc 25 phút đi ô tô",
          "image": "assets/images/places/thanh-co-quang-tri.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cơm hến",
          "description": "Món ăn dân dã đặc trưng của xứ Quảng, được chế biến từ hến tươi sông Bến Hải kết hợp với các loại rau thơm và gia vị đặc biệt",
          "restaurant": "Quán Cơm Hến Hiền Lương",
          "price": "30000-50000 VND/phần",
          "where": "Các quán ăn dọc đường Quốc lộ 1A, gần cầu Hiền Lương"
        },
        {
          "name": "Bánh bột lọc",
          "description": "Bánh trong suốt nhân tôm thịt, đặc sản của vùng đất Quảng Trị, được làm từ bột sắn tinh chế với công thức gia truyền",
          "restaurant": "Quán Bánh Bột Lọc Cô Hai",
          "price": "20000-40000 VND/10 cái",
          "where": "Chợ địa phương và các quán ăn vặt gần khu di tích"
        }
      ]
    },
    {
      "id": "cho-dong-xuan-ha-noi",
      "name": "Chợ Đồng Xuân Hà Nội",
      "location": "Hà Nội",
      "image": "assets/images/places/checkin-cho-dong-xuan-ha-noi.jpg",
      "description": "Khu chợ truyền thống lớn nhất và lâu đời nhất Hà Nội, là biểu tượng văn hóa và thương mại của Thủ đô với lịch sử hơn 130 năm. Chợ không chỉ là trung tâm mua sắm sầm uất mà còn là điểm đến du lịch hấp dẫn của Hà Nội.",
      "detailedDescription": "Chợ Đồng Xuân được xây dựng từ năm 1889 dưới thời Pháp thuộc, là khu chợ lớn nhất ở khu vực phố cổ Hà Nội. Với kiến trúc độc đáo mang dấu ấn thời gian, chợ Đồng Xuân là nơi tập trung buôn bán đa dạng các mặt hàng từ vải vóc, quần áo, đồ gia dụng đến thực phẩm tươi sống. Đặc biệt, tầng 1 của chợ nổi tiếng với khu ẩm thực phong phú, nơi du khách có thể thưởng thức các món ăn đặc trưng của Hà Nội.",
      "howToGet": "Chợ nằm ở trung tâm khu phố cổ Hà Nội, số 1 phố Đồng Xuân. Có thể đi bộ từ Hồ Hoàn Kiếm khoảng 10 phút, hoặc đi taxi, xe ôm công nghệ với giá khoảng 15.000-30.000 VND.",
      "bestTimeToVisit": "Chợ hoạt động từ 6h sáng đến 19h tối hàng ngày. Buổi sáng sớm (6h-9h) là thời điểm lý tưởng để mua thực phẩm tươi sống, còn buổi chiều thích hợp để mua sắm quần áo và đồ gia dụng.",
      "nearbyAttractions": [
        {
          "name": "Phố cổ Hà Nội",
          "description": "Khu phố cổ với 36 phố phường truyền thống, mỗi phố chuyên kinh doanh một mặt hàng đặc trưng. Nơi đây còn lưu giữ nhiều công trình kiến trúc và nét văn hóa độc đáo của Hà Nội xưa.",
          "distance": "0.2km",
          "travelTime": "5 phút đi bộ",
          "image": "assets/images/places/pho-co-ha-noi.jpg"
        },
        {
          "name": "Hồ Hoàn Kiếm",
          "description": "Trái tim của Hà Nội, nơi có Tháp Rùa, cầu Thê Húc và đền Ngọc Sơn. Đây là điểm đến không thể bỏ qua khi du lịch Hà Nội.",
          "distance": "0.8km",
          "travelTime": "10 phút đi bộ",
          "image": "assets/images/places/ho-hoan-kiem.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Phở gà Đồng Xuân",
          "description": "Món phở truyền thống với nước dùng ngọt thanh, thịt gà mềm và bánh phở dai ngon. Được nấu theo công thức gia truyền nhiều đời",
          "restaurant": "Phở gà Bà Chiểu",
          "price": "40000-55000 VND/bát",
          "where": "Khu ẩm thực tầng 1 chợ Đồng Xuân"
        },
        {
          "name": "Bún chả Hà Nội",
          "description": "Món ăn đặc trưng của người Hà Nội với thịt nướng thơm lừng, nước chấm chua ngọt đậm đà và bún tươi",
          "restaurant": "Bún chả Đồng Xuân",
          "price": "35000-50000 VND/suất",
          "where": "Các quán ăn xung quanh khu vực chợ"
        }
      ]
    },
    {
      "id": "cho-rong-nam-dinh",
      "name": "Chợ Rồng Nam Định",
      "location": "Nam Định",
      "image": "assets/images/places/checkin-cho-rong-nam-dinh.jpg",
      "description": "Khu chợ truyền thống lớn nhất Nam Định, biểu tượng văn hóa và thương mại của thành phố với lịch sử hơn 100 năm. Chợ không chỉ là trung tâm mua sắm sầm uất mà còn là nơi gìn giữ những nét văn hóa đặc trưng của vùng đất Nam Định.",
      "detailedDescription": "Chợ Rồng Nam Định là một trong những khu chợ lớn nhất miền Bắc, được xây dựng từ thời Pháp thuộc. Với kiến trúc độc đáo và quy mô hoành tráng, chợ là nơi tập trung buôn bán các mặt hàng đa dạng từ thực phẩm, vải vóc đến đồ gia dụng. Đặc biệt, chợ nổi tiếng với khu vực bán vải và may mặc, phản ánh truyền thống dệt may lâu đời của Nam Định. Không gian chợ được tổ chức khoa học với nhiều khu vực chuyên biệt, tạo thuận lợi cho việc mua sắm.",
      "howToGet": "Chợ nằm ở trung tâm thành phố Nam Định, cách ga Nam Định khoảng 1km. Bạn có thể đi bộ từ trung tâm thành phố hoặc bắt xe ôm, taxi với giá từ 15.000-30.000 VND tùy khoảng cách.",
      "bestTimeToVisit": "Chợ hoạt động từ 5h sáng đến 18h hàng ngày. Buổi sáng sớm từ 5h-8h là thời điểm sầm uất nhất, đặc biệt thích hợp để mua thực phẩm tươi sống và trải nghiệm không khí buôn bán nhộn nhịp.",
      "nearbyAttractions": [
        {
          "name": "Nhà thờ Chính tòa Nam Định",
          "description": "Công trình kiến trúc Gothic ấn tượng được xây dựng từ năm 1880, là một trong những nhà thờ lớn và đẹp nhất miền Bắc. Nhà thờ nổi bật với hai tháp chuông cao 44m và những ô cửa kính màu tuyệt đẹp.",
          "distance": "800m về phía Đông",
          "travelTime": "10 phút đi bộ hoặc 3 phút đi xe",
          "image": "assets/images/places/nha-tho-chinh-toa.jpg"
        },
        {
          "name": "Khu phố cổ Nam Định",
          "description": "Khu phố với những công trình kiến trúc cổ từ thời Pháp thuộc, nơi lưu giữ nhiều giá trị văn hóa và lịch sử của thành phố. Khu vực này còn nổi tiếng với nhiều quán ăn truyền thống.",
          "distance": "500m về phía Nam",
          "travelTime": "7 phút đi bộ",
          "image": "assets/images/places/pho-co-nam-dinh.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Phở bò Nam Định",
          "description": "Món phở truyền thống với nước dùng đậm đà, thịt bò mềm và bánh phở dai ngon. Đặc biệt là cách pha nước dùng với nhiều gia vị bí truyền tạo nên hương vị độc đáo",
          "restaurant": "Phở Bò Bà Vân",
          "price": "35000-50000 VND/bát",
          "where": "Đối diện cổng chợ Rồng, khu vực phía Nam"
        },
        {
          "name": "Bún đũa Nam Định",
          "description": "Món bún đặc trưng của Nam Định với sợi bún tròn dài, ăn kèm chả lụa, giò sống và nước dùng trong vắt. Món ăn này thể hiện sự tinh tế trong ẩm thực Nam Định",
          "restaurant": "Quán Bún Đũa Cô Thảo",
          "price": "25000-35000 VND/bát",
          "where": "Khu ẩm thực trong chợ Rồng, tầng 1"
        }
      ]
    },
    {
      "id": "lang-mau-lieu-hanh",
      "name": "Lăng Mẫu Liễu Hạnh Phủ Dầy",
      "location": "Nam Định",
      "image": "assets/images/places/checkin-lang-mau-lieu-hanh-phu-day-nam-dinh.jpg",
      "description": "Di tích tâm linh nổi tiếng thờ Thánh Mẫu Liễu Hạnh, một trong Tứ bất tử trong tín ngưỡng dân gian Việt Nam. Quần thể di tích không chỉ là trung tâm tín ngưỡng thờ Mẫu lớn nhất cả nước mà còn là nơi bảo tồn và phát huy các giá trị văn hóa truyền thống.",
      "detailedDescription": "Lăng Mẫu Liễu Hạnh tại Phủ Dầy là một trong những trung tâm tín ngưỡng thờ Mẫu lớn nhất Việt Nam. Quần thể di tích bao gồm nhiều công trình kiến trúc nghệ thuật độc đáo như đền, phủ, lăng, miếu được xây dựng theo kiến trúc truyền thống. Nơi đây không chỉ là điểm đến tâm linh mà còn là di tích văn hóa quan trọng, nơi diễn ra nhiều lễ hội truyền thống và hoạt động hát văn, hầu đồng. Phủ Dầy còn lưu giữ nhiều hiện vật quý giá và là nơi nghiên cứu về tín ngưỡng thờ Mẫu của người Việt.",
      "howToGet": "Từ thành phố Nam Định, đi theo hướng Tây Nam khoảng 25km theo quốc lộ 38B. Bạn có thể đi xe khách (khoảng 45 phút, giá 30.000 VND/người) hoặc taxi (khoảng 300.000 VND/chiều).",
      "bestTimeToVisit": "Có thể đến vào bất kỳ thời điểm nào trong năm, nhưng nên tránh những ngày mưa lớn. Thời điểm lý tưởng nhất là vào các dịp lễ hội (tháng 3 âm lịch) để được trải nghiệm không khí tâm linh sôi động và các hoạt động văn hóa đặc sắc.",
      "nearbyAttractions": [
        {
          "name": "Đền Trần Nam Định",
          "description": "Quần thể di tích lịch sử văn hóa thờ các vua nhà Trần, nơi diễn ra lễ hội khai ấn đầu năm nổi tiếng. Công trình kiến trúc độc đáo mang đậm dấu ấn thời Trần.",
          "distance": "15km về phía Đông",
          "travelTime": "25 phút đi ô tô hoặc xe máy",
          "image": "assets/images/places/den-tran.jpg"
        },
        {
          "name": "Chợ Viềng Nam Định",
          "description": "Phiên chợ truyền thống nổi tiếng, theo tín ngưỡng dân gian, đi chợ Viềng sẽ mua được may mắn cho cả năm. Chợ họp vào đêm mồng 7 tháng Giêng âm lịch.",
          "distance": "10km về phía Tây",
          "travelTime": "20 phút đi ô tô",
          "image": "assets/images/places/cho-vieng.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Xôi Phủ Dầy",
          "description": "Món xôi truyền thống được nấu từ gạo nếp cái hoa vàng, dẻo thơm và được cúng trong các dịp lễ hội. Xôi được gói trong lá dong tạo hương vị đặc trưng",
          "restaurant": "Quán Xôi Bà Liên",
          "price": "20000-30000 VND/suất",
          "where": "Khu vực cổng Phủ Dầy"
        },
        {
          "name": "Chè kho Nam Định",
          "description": "Món chè truyền thống của Nam Định, được nấu công phu từ đường phèn và gạo nếp, có vị ngọt thanh và dẻo thơm. Món tráng miệng phổ biến trong các dịp lễ hội",
          "restaurant": "Chè Kho Cô Hương",
          "price": "15000-25000 VND/bát",
          "where": "Dọc đường vào Phủ Dầy"
        }
      ]
    },
    {
      "id": "dinh-fansipan",
      "name": "Đỉnh Fansipan",
      "location": "Lào Cai",
      "image": "assets/images/places/checkin-dinh-fansipan-lao-cai.jpg",
      "description": "Nóc nhà Đông Dương với độ cao 3.143m",
      "detailedDescription": "Fansipan là đỉnh núi cao nhất Việt Nam và khu vực Đông Dương, thuộc dãy Hoàng Liên Sơn. Ngày nay, du khách có thể lên đỉnh bằng cáp treo hiện đại hoặc chinh phục bằng cách leo núi. Từ đỉnh núi, du khách có thể ngắm nhìn toàn cảnh thung lũng Mường Hoa và dãy Hoàng Liên hùng vĩ.",
      "howToGet": "Từ thị trấn Sa Pa, bạn có thể đi cáp treo lên đỉnh Fansipan hoặc tham gia tour leo núi 2-3 ngày.",
      "bestTimeToVisit": "Thời điểm đẹp nhất để chinh phục Fansipan là từ tháng 9 đến tháng 3 năm sau, khi thời tiết khô ráo và có nhiều nắng."
    },
    {
      "id": "deo-bao-loc",
      "name": "Đèo Bảo Lộc",
      "location": "Lâm Đồng",
      "image": "assets/images/places/checkin-deo-bao-loc-lam-dong.jpg",
      "description": "Cung đường đèo uốn lượn với cảnh quan thiên nhiên tuyệt đẹp",
      "detailedDescription": "Đèo Bảo Lộc là một trong những cung đường đèo đẹp nhất Việt Nam, nối liền thành phố Bảo Lộc với các vùng lân cận. Đèo có độ dài khoảng 10km với nhiều khúc cua uốn lượn, hai bên là những đồi chè xanh mướt và thung lũng sâu.",
      "howToGet": "Đèo nằm trên Quốc lộ 20, cách thành phố Bảo Lộc khoảng 10km về phía Nam.",
      "bestTimeToVisit": "Thời điểm lý tưởng để chinh phục đèo Bảo Lộc là từ tháng 12 đến tháng 4, khi thời tiết khô ráo và có nhiều nắng.",
      "attractions": {
        "natural": [
          {
            "name": "Đồi chè Bảo Lộc",
            "description": "Những đồi chè xanh mướt trải dài hai bên đèo",
            "image": "assets/images/places/doi-che-bao-loc.jpg"
          },
          {
            "name": "Thác Damb'ri",
            "description": "Thác nước cao nhất tỉnh Lâm Đồng",
            "image": "assets/images/places/thac-dambri.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Trà Bảo Lộc",
          "description": "Trà xanh thượng hạng từ đồi chè Bảo Lộc",
          "image": "assets/images/foods/tra-bao-loc.jpg"
        },
        {
          "name": "Cá tầm nướng",
          "description": "Đặc sản cá tầm từ các hồ nuôi cá vùng cao",
          "image": "assets/images/foods/ca-tam-nuong.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Thác Đamri",
          "description": "Thác nước hùng vĩ cao 57m",
          "distance": "15km",
          "image": "assets/images/places/thac-damri.jpg"
        },
        {
          "name": "Chùa Linh Quy Pháp Ấn",
          "description": "Ngôi chùa nổi tiếng với cổng trời",
          "distance": "20km",
          "image": "assets/images/places/chua-linh-quy-phap-an.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Lẩu cá tầm",
          "description": "Món ăn đặc trưng vùng cao nguyên",
          "price": "200000-300000 VND/nồi",
          "where": "Các nhà hàng dọc đèo Bảo Lộc"
        },
        {
          "name": "Trà Bảo Lộc tươi",
          "description": "Trà tươi hái từ đồi chè",
          "price": "20000-30000 VND/ly",
          "where": "Các quán trà dọc đường"
        }
      ]
    },
    {
      "id": "nha-lao-thieu-nhi-da-lat",
      "name": "Nhà Lao Thiếu Nhi Đà Lạt",
      "location": "Lâm Đồng",
      "image": "assets/images/places/checkin-nha-lao-thieu-nhi-da-lat-lam-dong.jpg",
      "description": "Di tích lịch sử ghi dấu thời kỳ kháng chiến",
      "detailedDescription": "Nhà Lao Thiếu Nhi Đà Lạt là một di tích lịch sử quan trọng, nơi ghi dấu những trang sử hào hùng của dân tộc trong thời kỳ kháng chiến. Công trình này ngày nay đã trở thành điểm tham quan giáo dục truyền thống cho thế hệ trẻ.",
      "howToGet": "Di tích nằm trong trung tâm thành phố Đà Lạt, có thể di chuyển bằng xe máy hoặc taxi.",
      "bestTimeToVisit": "Có thể tham quan vào bất kỳ thời điểm nào trong năm, nhưng nên tránh những ngày mưa lớn.",
      "attractions": {
        "historical": [
          {
            "name": "Nhà Lao Thiếu Nhi",
            "description": "Di tích lịch sử với kiến trúc thời Pháp",
            "image": "assets/images/places/nha-lao-thieu-nhi.jpg"
          },
          {
            "name": "Bảo tàng",
            "description": "Khu trưng bày hiện vật lịch sử",
            "image": "assets/images/places/bao-tang-nha-lao.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Bánh mì xíu mại",
          "description": "Món ăn sáng phổ biến ở Đà Lạt",
          "image": "assets/images/foods/banh-mi-xiu-mai.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Dinh Bảo Đại",
          "description": "Cung điện của vua Bảo Đại",
          "distance": "2km",
          "image": "assets/images/places/dinh-bao-dai.jpg"
        },
        {
          "name": "Hồ Xuân Hương",
          "description": "Hồ trung tâm thành phố Đà Lạt",
          "distance": "1km",
          "image": "assets/images/places/ho-xuan-huong.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Bánh ướt lòng gà",
          "description": "Món ăn đặc trưng Đà Lạt",
          "price": "35000-50000 VND/phần",
          "where": "Các quán ăn gần di tích"
        },
        {
          "name": "Cà phê",
          "description": "Cà phê Arabica Đà Lạt",
          "price": "25000-40000 VND/ly",
          "where": "Các quán cà phê xung quanh"
        }
      ]
    },
    {
      "id": "nui-da-con-voi",
      "name": "Núi Đá Voi",
      "location": "Đắk Lắk",
      "image": "assets/images/places/checkin-nui-da-con-voi-dak-lak.jpg",
      "description": "Danh thắng với hình dáng độc đáo giống như một chú voi",
      "detailedDescription": "Núi Đá Voi là một danh thắng nổi tiếng của Đắk Lắk, với hình dáng tự nhiên giống như một chú voi đang nằm nghỉ. Đây không chỉ là điểm du lịch hấp dẫn mà còn gắn liền với nhiều truyền thuyết của người dân địa phương.",
      "howToGet": "Từ trung tâm thành phố Buôn Ma Thuột, đi theo hướng Đông Nam khoảng 15km là đến núi Đá Voi.",
      "bestTimeToVisit": "Thời điểm thích hợp để tham quan là từ tháng 11 đến tháng 4 năm sau, khi thời tiết khô ráo.",
      "attractions": {
        "natural": [
          {
            "name": "Núi Đá Voi",
            "description": "Khối đá tự nhiên có hình dáng như voi",
            "image": "assets/images/places/nui-da-voi.jpg"
          },
          {
            "name": "Thác Đray Sap",
            "description": "Thác nước hùng vĩ gần núi Đá Voi",
            "image": "assets/images/places/thac-dray-sap.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Cơm lam",
          "description": "Cơm nấu trong ống tre, đặc sản Tây Nguyên",
          "image": "assets/images/foods/com-lam.jpg"
        },
        {
          "name": "Rượu cần",
          "description": "Đồ uống truyền thống của người Tây Nguyên",
          "image": "assets/images/foods/ruou-can.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Thác Đray Sap",
          "description": "Thác nước đẹp của Tây Nguyên",
          "distance": "10km",
          "image": "assets/images/places/thac-dray-sap.jpg"
        },
        {
          "name": "Buôn Đôn",
          "description": "Làng của những người thuần dưỡng voi",
          "distance": "25km",
          "image": "assets/images/places/buon-don.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cơm lam gà nướng",
          "description": "Món ăn đặc trưng của Tây Nguyên",
          "price": "60000-80000 VND/phần",
          "where": "Các quán ăn địa phương gần núi Đá Voi"
        },
        {
          "name": "Cà phê Buôn Ma Thuột",
          "description": "Cà phê đặc sản vùng Tây Nguyên",
          "price": "15000-25000 VND/ly",
          "where": "Các quán cà phê xung quanh khu vực"
        }
      ]
    },
    {
      "id": "deo-phu-son",
      "name": "Đèo Phú Sơn",
      "location": "Lâm Đồng - Đắk Lắk",
      "image": "assets/images/places/checkin-deo-phu-son.jpg",
      "description": "Cung đường đèo hùng vĩ nối liền hai tỉnh Lâm Đồng và Đắk Lắk, với khung cảnh núi rừng Tây Nguyên tuyệt đẹp",
      "detailedDescription": "Đèo Phú Sơn là một trong những cung đường đèo đẹp của Tây Nguyên, nối liền hai tỉnh Lâm Đồng và Đắk Lắk. Đèo có độ dài khoảng 10km với nhiều khúc cua uốn lượn, hai bên là rừng thông và các đồi cà phê xanh mướt. Từ đỉnh đèo, du khách có thể ngắm nhìn toàn cảnh núi rừng Tây Nguyên hùng vĩ và những thung lũng trải dài.",
      "howToGet": "Đèo nằm trên tuyến đường từ Đà Lạt đi Buôn Ma Thuột, cách thành phố Đà Lạt khoảng 150km về phía Đông Bắc. Có thể di chuyển bằng xe máy hoặc ô tô từ hai đầu Đà Lạt hoặc Buôn Ma Thuột.",
      "bestTimeToVisit": "Thời điểm đẹp nhất để chinh phục đèo là từ tháng 11 đến tháng 4 năm sau, khi thời tiết Tây Nguyên khô ráo, thuận lợi cho việc di chuyển và ngắm cảnh.",
      "attractions": {
        "natural": [
          {
            "name": "Đỉnh đèo Phú Sơn",
            "description": "Điểm ngắm cảnh tuyệt đẹp nhìn ra núi rừng Tây Nguyên",
            "image": "assets/images/places/dinh-deo-phu-son.jpg"
          },
          {
            "name": "Thác Phú Sơn",
            "description": "Thác nước hoang sơ gần đèo",
            "image": "assets/images/places/thac-phu-son.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Cà phê Tây Nguyên",
          "description": "Cà phê đặc sản vùng cao nguyên",
          "image": "assets/images/foods/ca-phe-tay-nguyen.jpg"
        },
        {
          "name": "Rau rừng nướng",
          "description": "Các loại rau rừng đặc trưng của vùng Tây Nguyên",
          "image": "assets/images/foods/rau-rung.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Vườn quốc gia Chư Yang Sin",
          "description": "Khu bảo tồn thiên nhiên với nhiều loài động thực vật quý hiếm",
          "distance": "30km",
          "image": "assets/images/places/vuon-quoc-gia-chu-yang-sin.jpg"
        },
        {
          "name": "Thác Dray Sap",
          "description": "Thác nước hùng vĩ của Tây Nguyên",
          "distance": "45km",
          "image": "assets/images/places/thac-dray-sap.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cơm lam",
          "description": "Món ăn truyền thống của người Tây Nguyên",
          "price": "30000-50000 VND/phần",
          "where": "Các quán ăn dọc đèo"
        },
        {
          "name": "Cà phê sữa đá",
          "description": "Cà phê nguyên chất Tây Nguyên",
          "price": "15000-25000 VND/ly",
          "where": "Các quán cà phê dọc đường"
        }
      ]
    },
    {
      "id": "buon-ma-thuot",
      "name": "Thành phố Buôn Ma Thuột",
      "location": "Đắk Lắk",
      "image": "assets/images/places/checkin-thanh-pho-buon-ma-thuot.jpg",
      "description": "Thủ phủ của cà phê Việt Nam",
      "detailedDescription": "Buôn Ma Thuột là thành phố lớn nhất Tây Nguyên và được mệnh danh là thủ phủ cà phê của Việt Nam. Nơi đây không chỉ nổi tiếng với những đồi cà phê bạt ngàn mà còn có nền văn hóa đa dạng của các dân tộc Tây Nguyên.",
      "howToGet": "Có thể đến Buôn Ma Thuột bằng máy bay (sân bay Buôn Ma Thuột) hoặc xe khách từ các tỉnh thành lớn.",
      "bestTimeToVisit": "Mùa khô từ tháng 11 đến tháng 4 là thời điểm lý tưởng để thăm Buôn Ma Thuột.",
      "attractions": {
        "cultural": [
          {
            "name": "Bảo tàng Đắk Lắk",
            "description": "Nơi trưng bày văn hóa Tây Nguyên",
            "image": "assets/images/places/bao-tang-dak-lak.jpg"
          },
          {
            "name": "Buôn Akô Dhông",
            "description": "Làng đồng bào dân tộc E Đê truyền thống",
            "image": "assets/images/places/buon-ako-dhong.jpg"
          }
        ]
      },
      "localFood": [
        {
          "name": "Cà phê Buôn Ma Thuột",
          "description": "Cà phê nổi tiếng nhất Việt Nam",
          "image": "assets/images/foods/ca-phe-buon-ma-thuot.jpg"
        },
        {
          "name": "Bún đỏ",
          "description": "Món ăn đặc trưng của người Tây Nguyên",
          "image": "assets/images/foods/bun-do.jpg"
        }
      ],
      "nearbyAttractions": [
        {
          "name": "Buôn Đôn",
          "description": "Làng voi nổi tiếng",
          "distance": "40km",
          "image": "assets/images/places/buon-don.jpg"
        },
        {
          "name": "Hồ Lắk",
          "description": "Hồ nước ngọt lớn nhất Đắk Lắk",
          "distance": "45km",
          "image": "assets/images/places/ho-lak.jpg"
        }
      ],
      "recommendedFood": [
        {
          "name": "Phở khô Gia Lai",
          "description": "Món ăn đặc trưng Tây Nguyên",
          "price": "35000-50000 VND/tô",
          "where": "Các quán ăn trong thành phố"
        },
        {
          "name": "Cà phê sữa đá",
          "description": "Cà phê nguyên chất Buôn Ma Thuột",
          "price": "15000-25000 VND/ly",
          "where": "Các quán cà phê trong thành phố"
        }
      ]
    },
    {
      "id": "cho-sapa",
      "name": "Chợ Sa Pa",
      "location": "Lào Cai",
      "image": "assets/images/places/checkin-cho-sapa-lao-cai.jpg",
      "description": "Khu chợ truyền thống của người dân vùng cao",
      "detailedDescription": "Chợ Sa Pa là nơi giao thương sầm uất của đồng bào các dân tộc vùng cao Tây Bắc. Nơi đây không chỉ là điểm mua sắm mà còn là nơi giao lưu văn hóa độc đáo giữa các dân tộc H'Mông, Dao, Tày, Giáy.",
      "howToGet": "Chợ nằm ở trung tâm thị trấn Sa Pa, dễ dàng di chuyển bằng đi bộ từ các khách sạn trong khu vực.",
      "bestTimeToVisit": "Chợ phiên họp vào các ngày cuối tuần là sôi động nhất, đặc biệt vào sáng sớm.",
      "localFood": [
        {
          "name": "Thắng cố",
          "description": "Món ăn truyền thống của người H'Mông, được nấu từ thịt ngựa và các loại gia vị đặc biệt.",
          "image": "assets/images/foods/thang-co.jpg"
        },
        {
          "name": "Cá hồi nướng",
          "description": "Đặc sản cá hồi Sa Pa được nướng với gia vị đặc trưng vùng cao.",
          "image": "assets/images/foods/ca-hoi-nuong.jpg"
        }
      ]
    },
    {
      "id": "cho-tinh-sapa",
      "name": "Chợ Tình Sa Pa",
      "location": "Lào Cai",
      "image": "assets/images/places/checkin-cho-tinh-sapa-lao-cai.jpg",
      "description": "Phiên chợ độc đáo của người dân tộc vùng cao",
      "detailedDescription": "Chợ Tình Sa Pa là nét văn hóa đặc sắc của đồng bào dân tộc vùng cao, nơi các chàng trai cô gái trẻ gặp gỡ, giao lưu và tìm hiểu nhau. Chợ không chỉ là nơi buôn bán mà còn là điểm hẹn văn hóa độc đáo.",
      "howToGet": "Chợ nằm ở khu vực trung tâm Sa Pa, có thể đi bộ hoặc xe máy từ các điểm trong thị trấn.",
      "bestTimeToVisit": "Chợ thường họp vào tối thứ 7 hàng tuần, đặc biệt sôi động vào các dịp lễ tết."
    },
    {
      "id": "wat-arun",
      "name": "Chùa Wat Arun",
      "location": "Bangkok, Thái Lan",
      "image": "assets/images/places/checkin-chua-wat-arun-thai-lan.jpg",
      "description": "Ngôi chùa Bình Minh nổi tiếng của Thái Lan",
      "detailedDescription": "Wat Arun hay còn gọi là Chùa Bình Minh là một trong những ngôi chùa nổi tiếng nhất Bangkok, Thái Lan. Với kiến trúc độc đáo và vị trí bên bờ sông Chao Phraya, chùa là điểm đến không thể bỏ qua khi đến Bangkok.",
      "howToGet": "Từ trung tâm Bangkok, bạn có thể đi thuyền qua sông Chao Phraya để đến chùa.",
      "bestTimeToVisit": "Thời điểm đẹp nhất để thăm chùa là lúc hoàng hôn, khi ánh nắng chiếu vào các tháp chùa tạo nên khung cảnh tuyệt đẹp."
    },
    {
      "id": "san-bay-suvarnabhumi",
      "name": "Sân bay Suvarnabhumi",
      "location": "Bangkok, Thái Lan",
      "image": "assets/images/places/checkin-san-bay-suvarnabhumi-bangkok.jpg",
      "description": "Sân bay quốc tế chính của Thái Lan",
      "detailedDescription": "Sân bay Suvarnabhumi là một trong những sân bay hiện đại và lớn nhất Đông Nam Á. Với kiến trúc độc đáo và quy mô hoành tráng, sân bay không chỉ là cửa ngõ giao thương mà còn là điểm check-in nổi tiếng của du khách.",
      "howToGet": "Từ trung tâm Bangkok có thể đi taxi, xe buýt hoặc tàu điện Airport Rail Link.",
      "bestTimeToVisit": "Sân bay hoạt động 24/7, nhưng thời điểm ít đông đúc nhất là từ 23h đến 4h sáng."
    },
    {
      "id": "chua-van-thien",
      "name": "Chùa Vạn Thiện",
      "location": "Đồng Nai",
      "image": "assets/images/places/checkin-chua-van-thien-dong-nai.jpg",
      "description": "Ngôi chùa cổ kính với kiến trúc độc đáo",
      "detailedDescription": "Chùa Vạn Thiện là một trong những ngôi chùa cổ của tỉnh Đồng Nai, với kiến trúc độc đáo kết hợp giữa phong cách truyền thống và hiện đại. Chùa không chỉ là nơi sinh hoạt tâm linh mà còn là điểm đến văn hóa hấp dẫn.",
      "howToGet": "Từ trung tâm thành phố Biên Hòa, đi theo hướng dẫn đến chùa khoảng 10km.",
      "bestTimeToVisit": "Có thể thăm quan quanh năm, đặc biệt vào các dịp lễ Phật giáo."
    },
    {
      "id": "cua-khau-huu-nghi-lang-son",
      "name": "Cửa khẩu Hữu Nghị",
      "location": "Lạng Sơn",
      "image": "assets/images/places/checkin-cua-khau-huu-nghi-lang-son.jpg",
      "description": "Cửa khẩu quốc tế quan trọng nối liền Việt Nam và Trung Quốc, là trung tâm giao thương sầm uất của vùng biên giới phía Bắc",
      "detailedDescription": "Cửa khẩu Hữu Nghị là một trong những cửa khẩu quốc tế lớn nhất Việt Nam, nằm trên địa phận tỉnh Lạng Sơn. Đây là điểm kết nối quan trọng trong giao thương giữa Việt Nam và Trung Quốc, với lịch sử phát triển lâu dài. Khu vực cửa khẩu không chỉ là nơi thông quan hàng hóa mà còn là điểm du lịch hấp dẫn, nơi du khách có thể tìm hiểu về đời sống văn hóa vùng biên giới.",
      "howToGet": "Từ trung tâm thành phố Lạng Sơn đi theo Quốc lộ 1A khoảng 20km về phía Bắc. Có thể đi xe khách hoặc taxi từ bến xe Lạng Sơn.",
      "bestTimeToVisit": "Thời điểm thích hợp nhất là từ tháng 10 đến tháng 3 năm sau, khi thời tiết mát mẻ và thuận lợi cho việc tham quan, mua sắm.",
      "nearbyAttractions": [
        {
          "name": "Chợ Đông Kinh",
          "description": "Khu chợ truyền thống lớn của Lạng Sơn, nơi bán nhiều đặc sản địa phương",
          "distance": "18km",
          "travelTime": "30 phút đi xe máy"
        },
        {
          "name": "Núi Phai Vệ",
          "description": "Danh thắng với nhiều hang động và đền chùa cổ",
          "distance": "15km",
          "travelTime": "25 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Vịt quay Lạng Sơn",
          "description": "Món vịt quay truyền thống với công thức đặc biệt của người Lạng Sơn",
          "restaurant": "Nhà hàng Vịt quay Kỳ Lừa",
          "price": "250000-300000 VND/con",
          "where": "Khu vực gần cửa khẩu"
        },
        {
          "name": "Phở chua",
          "description": "Món phở đặc trưng của Lạng Sơn với vị chua độc đáo",
          "restaurant": "Quán phở chua Bà Hằng",
          "price": "35000-45000 VND/tô",
          "where": "Các quán ăn trong khu vực"
        }
      ]
    },
    {
      "id": "doi-cat-trang-binh-thuan",
      "name": "Đồi cát trắng Bình Thuận",
      "location": "Bình Thuận",
      "image": "assets/images/places/checkin-doi-cat-trang-binh-thuan.jpg",
      "description": "Đồi cát trắng tinh khôi với cảnh quan sa mạc độc đáo, một trong những điểm check-in nổi tiếng của Bình Thuận",
      "detailedDescription": "Đồi cát trắng Bình Thuận là một trong những thắng cảnh đặc biệt của vùng Nam Trung Bộ, được ví như 'sa mạc thu nhỏ' của Việt Nam. Những đồi cát trắng tinh khôi trải dài với những đường cong mềm mại được tạo nên bởi gió, tạo nên khung cảnh độc đáo và ấn tượng. Đây là điểm đến lý tưởng cho những người yêu thích nhiếp ảnh và khám phá thiên nhiên.",
      "howToGet": "Từ trung tâm Phan Thiết đi theo đường ven biển khoảng 15km. Có thể thuê xe máy hoặc tham gia tour du lịch địa phương.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là từ 5h-7h sáng hoặc 16h-18h chiều để ngắm bình minh/hoàng hôn và tránh nắng nóng.",
      "nearbyAttractions": [
        {
          "name": "Bàu Trắng",
          "description": "Hồ nước ngọt giữa sa mạc, tạo nên cảnh quan độc đáo",
          "distance": "5km",
          "travelTime": "10 phút đi xe máy"
        },
        {
          "name": "Làng chài Mũi Né",
          "description": "Làng chài truyền thống với nhiều hải sản tươi sống",
          "distance": "8km",
          "travelTime": "15 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Bánh căn Phan Thiết",
          "description": "Bánh căn nóng hổi với nước chấm đặc biệt",
          "restaurant": "Quán Bánh căn 14",
          "price": "30000-40000 VND/phần",
          "where": "Khu vực Mũi Né"
        },
        {
          "name": "Hải sản tươi sống",
          "description": "Các món hải sản tươi ngon từ làng chài",
          "restaurant": "Nhà hàng Hải sản Mũi Né",
          "price": "200000-500000 VND/người",
          "where": "Ven biển Mũi Né"
        }
      ]
    },
    {
      "id": "ha-noi-pho-co",
      "name": "Phố cổ Hà Nội",
      "location": "Hà Nội",
      "image": "assets/images/places/checkin-ha-noi.jpg",
      "description": "Khu phố cổ với 36 phố phường truyền thống, nơi lưu giữ những giá trị văn hóa và kiến trúc độc đáo của Thăng Long - Hà Nội",
      "detailedDescription": "Phố cổ Hà Nội là khu vực có lịch sử hơn 1000 năm, với 36 phố phường mang đậm dấu ấn văn hóa và kiến trúc truyền thống. Mỗi con phố gắn liền với một nghề thủ công truyền thống, tạo nên bản sắc văn hóa độc đáo của Hà Nội xưa. Khu phố cổ không chỉ là điểm du lịch hấp dẫn mà còn là nơi sinh sống và buôn bán sầm uất của người dân Thủ đô.",
      "howToGet": "Từ trung tâm Hà Nội có thể đi bộ hoặc xe máy đến khu phố cổ. Điểm trung tâm là Hồ Hoàn Kiếm.",
      "bestTimeToVisit": "Thời điểm đẹp nhất là từ tháng 10 đến tháng 3, khi thời tiết mát mẻ. Nên đến vào cuối tuần khi có phố đi bộ.",
      "nearbyAttractions": [
        {
          "name": "Hồ Hoàn Kiếm",
          "description": "Trái tim của Hà Nội với Tháp Rùa và cầu Thê Húc đỏ thắm",
          "distance": "0.5km",
          "travelTime": "5 phút đi bộ"
        },
        {
          "name": "Chợ Đồng Xuân",
          "description": "Khu chợ truyền thống lớn nhất Hà Nội",
          "distance": "1km",
          "travelTime": "10 phút đi bộ"
        }
      ],
      "recommendedFood": [
        {
          "name": "Phở Hà Nội",
          "description": "Món phở truyền thống với nước dùng đặc biệt",
          "restaurant": "Phở Gia Truyền",
          "price": "45000-60000 VND/bát",
          "where": "Phố Bát Đàn"
        },
        {
          "name": "Bún chả",
          "description": "Bún chả với thịt nướng thơm lừng và nước chấm chuẩn vị Hà Nội",
          "restaurant": "Bún chả Hàng Quạt",
          "price": "40000-50000 VND/suất",
          "where": "Phố Hàng Quạt"
        }
      ]
    },
    {
      "id": "bai-bien-sam-son",
      "name": "Bãi biển Sầm Sơn",
      "location": "Thanh Hóa",
      "image": "assets/images/places/checkin_bai-bien-sam-son_thanh-hoa.jpg",
      "description": "Bãi biển nổi tiếng của miền Bắc với bờ cát trắng mịn và nhiều di tích lịch sử văn hóa",
      "detailedDescription": "Bãi biển Sầm Sơn là một trong những bãi biển đẹp và nổi tiếng nhất miền Bắc, với chiều dài hơn 6km bờ biển cát trắng mịn. Nơi đây không chỉ là điểm du lịch nghỉ dưỡng lý tưởng mà còn có nhiều di tích lịch sử văn hóa như Đền Độc Cước, núi Trường Lệ. Bãi biển Sầm Sơn còn nổi tiếng với những lễ hội truyền thống và ẩm thực hải sản phong phú.",
      "howToGet": "Từ Hà Nội đi theo Quốc lộ 1A khoảng 180km về phía Nam. Có thể đi xe khách hoặc ô tô riêng, mất khoảng 4 giờ đi đường.",
      "bestTimeToVisit": "Mùa du lịch biển đẹp nhất từ tháng 4 đến tháng 8, thời tiết nắng đẹp và biển lặng sóng.",
      "nearbyAttractions": [
        {
          "name": "Đền Độc Cước",
          "description": "Di tích tâm linh nổi tiếng gắn với truyền thuyết về vị thần một chân",
          "distance": "2km",
          "travelTime": "10 phút đi xe máy"
        },
        {
          "name": "Núi Trường Lệ",
          "description": "Danh thắng với cảnh quan đẹp và nhiều hang động tự nhiên",
          "distance": "3km",
          "travelTime": "15 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Nem chua Thanh Hóa",
          "description": "Đặc sản nem chua nổi tiếng của vùng đất Thanh Hóa",
          "restaurant": "Cửa hàng đặc sản Thanh Hóa",
          "price": "100000-150000 VND/kg",
          "where": "Khu chợ Sầm Sơn"
        },
        {
          "name": "Hải sản tươi sống",
          "description": "Các món hải sản tươi ngon được đánh bắt từ biển",
          "restaurant": "Khu ẩm thực biển Sầm Sơn",
          "price": "200000-500000 VND/người",
          "where": "Dọc bãi biển Sầm Sơn"
        }
      ]
    },
    {
      "id": "chua-dien-tho-binh-thuan",
      "name": "Chùa Diên Thọ",
      "location": "Bình Thuận",
      "image": "assets/images/places/checkin_Chua-dien-tho_Binh-Thuan.jpg",
      "description": "Ngôi chùa cổ kính với kiến trúc độc đáo, là điểm đến tâm linh quan trọng của Bình Thuận",
      "detailedDescription": "Chùa Diên Thọ là một trong những ngôi chùa cổ của tỉnh Bình Thuận, mang đậm dấu ấn kiến trúc Phật giáo truyền thống. Chùa không chỉ là nơi sinh hoạt tâm linh mà còn là điểm đến văn hóa với nhiều giá trị lịch sử. Không gian chùa yên tĩnh với nhiều cây cổ thụ và các công trình kiến trúc độc đáo.",
      "howToGet": "Từ trung tâm Phan Thiết đi khoảng 10km theo hướng Tây. Có thể đi xe máy hoặc taxi.",
      "bestTimeToVisit": "Có thể thăm quan quanh năm, đặc biệt vào các dịp lễ Phật giáo như Phật Đản, Vu Lan.",
      "nearbyAttractions": [
        {
          "name": "Tháp Pô Sah Inư",
          "description": "Di tích kiến trúc Chăm cổ",
          "distance": "5km",
          "travelTime": "15 phút đi xe máy"
        },
        {
          "name": "Suối Tiên",
          "description": "Khu du lịch sinh thái với cảnh quan đẹp",
          "distance": "8km",
          "travelTime": "20 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cơm chay",
          "description": "Các món ăn chay được chế biến tinh tế",
          "restaurant": "Nhà hàng chay chùa Diên Thọ",
          "price": "30000-50000 VND/phần",
          "where": "Trong khuôn viên chùa"
        },
        {
          "name": "Bánh xèo Phan Thiết",
          "description": "Món bánh xèo đặc trưng của vùng đất Bình Thuận",
          "restaurant": "Quán bánh xèo Bà Hai",
          "price": "25000-35000 VND/cái",
          "where": "Gần chùa"
        }
      ]
    },
    {
      "id": "tam-coc-bich-dong-ninh-binh",
      "name": "Tam Cốc - Bích Động",
      "location": "Ninh Bình",
      "image": "assets/images/places/checkin_tam-coc-bich-dong_ninh-binh.png",
      "description": "Quần thể danh thắng với cảnh quan sông nước hữu tình, hang động kỳ thú và núi đá vôi hùng vĩ, được mệnh danh là 'Vịnh Hạ Long trên cạn'",
      "detailedDescription": "Tam Cốc - Bích Động là một trong những danh thắng nổi tiếng nhất của Ninh Bình, nằm trong quần thể Tràng An được UNESCO công nhận là Di sản văn hóa và thiên nhiên thế giới. Tam Cốc có nghĩa là 'ba hang', bao gồm hang Cả, hang Hai và hang Ba. Du khách sẽ được thưởng ngoạn cảnh đẹp trên thuyền kayak men theo dòng sông Ngô Đồng qua các hang động tuyệt đẹp. Bích Động được gọi là 'Nam thiên đệ nhất động', là quần thể chùa động nằm trong lòng núi đá vôi với kiến trúc độc đáo.",
      "howToGet": "Từ Hà Nội đi xe khách hoặc ô tô riêng theo Quốc lộ 1A khoảng 100km về phía Nam, mất khoảng 2 giờ. Từ trung tâm thành phố Ninh Bình đi khoảng 7km nữa đến Tam Cốc.",
      "bestTimeToVisit": "Thời điểm đẹp nhất từ tháng 10 đến tháng 4 năm sau khi thời tiết mát mẻ. Tháng 5-6 là mùa lúa chín vàng rất đẹp, tháng 9-10 là mùa hoa sen nở.",
      "nearbyAttractions": [
        {
          "name": "Hang Múa",
          "description": "Đỉnh núi với tầm nhìn toàn cảnh Tam Cốc tuyệt đẹp",
          "distance": "2km",
          "travelTime": "10 phút đi xe máy"
        },
        {
          "name": "Tràng An",
          "description": "Quần thể di sản thế giới với nhiều hang động và cảnh quan hùng vĩ",
          "distance": "8km",
          "travelTime": "20 phút đi xe máy"
        },
        {
          "name": "Chùa Bái Đính",
          "description": "Quần thể chùa lớn nhất Việt Nam với nhiều kỷ lục",
          "distance": "15km",
          "travelTime": "30 phút đi xe máy"
        }
      ],
      "recommendedFood": [
        {
          "name": "Cơm cháy dê Ninh Bình",
          "description": "Món đặc sản nổi tiếng với cơm cháy giòn và thịt dê thơm ngon",
          "restaurant": "Nhà hàng Thúy Kiều",
          "price": "200000-300000 VND/phần",
          "where": "Khu vực Tam Cốc"
        },
        {
          "name": "Bánh cuốn thanh long",
          "description": "Bánh cuốn đặc biệt làm từ thanh long, đặc sản độc đáo của Ninh Bình",
          "restaurant": "Quán bánh cuốn Tam Cốc",
          "price": "30000-40000 VND/phần",
          "where": "Gần bến thuyền Tam Cốc"
        },
        {
          "name": "Bia Ninh Bình",
          "description": "Bia tươi địa phương có vị ngọt thanh, rất phù hợp với khí hậu",
          "restaurant": "Các quán ăn địa phương",
          "price": "15000-20000 VND/ly",
          "where": "Khắp khu vực Tam Cốc"
        }
      ]
    }
  ]
}
