{
  "name": "Hong Phung Phat",
  "title": "Senior Software Developer",
  "dateOfBirth": "30 Sep 1992",
  "location": {
    "address": "201/1/4 Doi Cung, Ward 9",
    "district": "District 11",
    "city": "Ho Chi Minh City",
    "country": "Vietnam"
  },
  "contact": {
    "phone": "+84 764 74 99 64",
    "email": "hpphat1992@gmail.com",
    "linkedin": "https://www.linkedin.com/in/hpphat1992/",
    "github": "https://github.com/hbslovely"
  },
  "languages": [
    {
      "name": "Vietnamese",
      "level": "Native"
    },
    {
      "name": "English",
      "level": "Professional Working Proficiency (IELTS 6.0)"
    }
  ],
  "summary": "Results-driven Senior Web Developer with over 8 years of expertise in front-end development and modern web technologies. Demonstrated track record of delivering high-quality solutions across diverse sectors including social networks, data management systems, and travel platforms. Proficient in HTML5, JavaScript, CSS, and various modern frameworks such as Angular and React. Skilled in leading development teams and implementing best practices throughout the entire software development lifecycle.\n\nCurrently focused on architecting scalable web applications while mentoring junior developers. Passionate about clean code, performance optimization, and staying current with emerging technologies. Actively pursuing advancement towards a Full Stack Developer or Technical Lead role, with a strong emphasis on building robust, user-centric applications.",
  "professionalHighlights": [
    "Led development teams of 3-5 members in delivering complex web applications",
    "Implemented responsive design principles resulting in 40% improved mobile user engagement",
    "Reduced application load time by 60% through optimization techniques",
    "Mentored 5+ junior developers in modern web development practices"
  ],
  "interests": [
    "Web Architecture & Design Patterns",
    "Performance Optimization",
    "Team Leadership",
    "Emerging Technologies",
    "Technical Writing"
  ],
  "availability": {
    "status": "Open to opportunities",
    "preferredWorkType": ["Full-time", "Contract"],
    "remoteWork": "Available for remote work"
  }
}